{"pr_number": 475, "pr_title": "Update readmes to match common design (Network Analysis category) 2/2", "pr_createdAt": "2020-04-21T08:01:04Z", "pr_url": "https://github.com/Esri/arcgis-runtime-samples-java/pull/475", "timeline": [{"oid": "1c666e4f9a69fe311b4baf234aa366f511abdb2e", "url": "https://github.com/Esri/arcgis-runtime-samples-java/commit/1c666e4f9a69fe311b4baf234aa366f511abdb2e", "message": "update readmes to match common design", "committedDate": "2020-04-21T07:57:43Z", "type": "commit"}, {"oid": "961ad3d3bb5cfe1cdfb5006087c6a677a3af2223", "url": "https://github.com/Esri/arcgis-runtime-samples-java/commit/961ad3d3bb5cfe1cdfb5006087c6a677a3af2223", "message": "fix alt text spelling", "committedDate": "2020-04-21T09:10:50Z", "type": "commit"}, {"oid": "12be87ac1a8ac54f33634a81be833e1dc1dc685a", "url": "https://github.com/Esri/arcgis-runtime-samples-java/commit/12be87ac1a8ac54f33634a81be833e1dc1dc685a", "message": "readme title to sentence case", "committedDate": "2020-04-21T09:11:26Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQxMzc1MTEyNQ==", "url": "https://github.com/Esri/arcgis-runtime-samples-java/pull/475#discussion_r413751125", "bodyText": "this section isn't quite right, partially reverting back to original instructions\n\n  \n    \n      \n        Suggested change\n        \n          \n    \n\n        \n      \n    \n    \n      \n          \n            \n            Click near a road to start adding a stop to the route, click again to place it on the map. A number graphic will show its order in the route. After adding at least 2 stops, a route will display. Choose \"Fastest\" or \"Shortest\" from the drop down menu to control how the route is optimized. Use a secondary click on stops to select them, and then primary-click to re-place them. The route will update on-the-fly while moving stops. The green box marks the boundary of the routable area provided by the offline data.\n          \n          \n            \n            Left-click near a road to add a stop to the route. A number graphic will show its order in the route. After adding at least 2 stops, a route will display. Choose \"Fastest\" or \"Shortest\" from the drop down menu to control how the route is optimized. To move a stop, right-click the graphic to select it, move your mouse to reposition and finally right-click again to set the new position. The route will update on-the-fly while moving stops. The green box marks the boundary of the routable area provided by the offline data.", "author": "Rachael-E", "createdAt": "2020-04-23T11:54:10Z", "path": "network_analysis/offline-routing/README.md", "diffHunk": "@@ -1,36 +1,38 @@\n-# Offline Routing\n+# Offline routing\n \n-Solve a route on-the-fly using only offline data.\n+Solve a route on-the-fly using offline data.\n \n-![](OfflineRouting.gif)\n+![Image of offline routing](OfflineRouting.gif)\n+\n+## Use case\n+\n+You can use an offline network to enable routing in disconnected scenarios. For example, you could provide offline location capabilities to field workers repairing critical infrastructure in a disaster when network availability is limited.\n \n ## How to use the sample\n \n-Left-click near a road to add a stop to the route. A number graphic will show its order in the route. After adding at least 2 stops, a route will display. Use the combo box in the top left corner to choose between the travel modes \"Fastest\" and \"Shortest\" (how the route is optimized). To move a stop, right-click the graphic to select it, then move your mouse to reposition, and finally right-click again to set the new position. The route will update on-the-fly while moving stops. The green box marks the boundary of the route geodatabase.\n+Click near a road to start adding a stop to the route, click again to place it on the map. A number graphic will show its order in the route. After adding at least 2 stops, a route will display. Choose \"Fastest\" or \"Shortest\" from the drop down menu to control how the route is optimized. Use a secondary click on stops to select them, and then primary-click to re-place them. The route will update on-the-fly while moving stops. The green box marks the boundary of the routable area provided by the offline data.", "originalCommit": "12be87ac1a8ac54f33634a81be833e1dc1dc685a", "replyToReviewId": null, "replies": null, "type": "inlineReview"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQxMzc1MTc5Ng==", "url": "https://github.com/Esri/arcgis-runtime-samples-java/pull/475#discussion_r413751796", "bodyText": "Suggested change\n        \n          \n    \n\n        \n      \n    \n    \n      \n          \n            \n            Use the 'Edit Mode' toggle buttons to select whether to add Stops or Barriers to the route. The route will be solved automatically as you add stops and barriers, and information about the length of the route and directions will be shown in the controls area. Select 'Find best sequence' to allow stops to be re-ordered in order to find an optimum route. Select 'Preserve first stop' to preserve the first stop. Select 'Preserve last stop' to preserve the last stop. You can use the 'Reset' button to reset the sample.\n          \n          \n            \n            Use the \"Edit Mode\" toggle buttons to select whether to add Stops or Barriers to the route. The route will be solved automatically as you add stops and barriers, and information about the length of the route and directions will be shown in the controls area. Select 'Find best sequence' to allow stops to be re-ordered in order to find an optimum route. Select 'Preserve first stop' to preserve the first stop. Select 'Preserve last stop' to preserve the last stop. You can use the \"Reset\" button to reset the sample.", "author": "Rachael-E", "createdAt": "2020-04-23T11:55:22Z", "path": "network_analysis/routing-around-barriers/README.md", "diffHunk": "@@ -1,16 +1,18 @@\n # Routing around barriers\n \n-Find a route with multiple stops and barriers.\n+Find a route that reaches all stops without crossing any barriers.\n \n-![](RoutingAroundBarriers.png)\n+![Image of routing around barriers](RoutingAroundBarriers.png)\n \n ## Use case\n \n-Delivery trucks need to find efficient routes to multiple stops, taking into account barriers such as traffic accidents or blocked roads. The route may be optimized to reduce overall travel time or travel distance. If stops are added to an existing route, it may be more efficient to reorder the stops to achieve the most efficient route.\n+You can define barriers to avoid unsafe areas, for example flooded roads, when planning the most efficient route to evacuate a hurricane zone. When solving a route, barriers allow you to define portions of the road network that cannot be traversed. You could also use this functionality to plan routes when you know an area will be inaccessible due to a community activity like an organized race or a market night.\n+\n+In some situations, it is further beneficial to find the most efficient route that reaches all stops, reordering them to reduce travel time. For example, a delivery service may target a number of drop-off addresses, specifically looking to avoid congested areas or closed roads, arranging the stops in the most time-effective order.\n \n ## How to use the sample\n \n-Use the Edit Mode toggle buttons to select whether to add Stops or Barriers to the route. Click 'Determine Route' to find the route and display it. Select 'Find best sequence' to allow stops to be re-ordered in order to find an optimum route. Select 'Preserve first stop' to preserve the first stop. Select 'Preserve last stop' to preserve the last stop.\n+Use the 'Edit Mode' toggle buttons to select whether to add Stops or Barriers to the route. The route will be solved automatically as you add stops and barriers, and information about the length of the route and directions will be shown in the controls area. Select 'Find best sequence' to allow stops to be re-ordered in order to find an optimum route. Select 'Preserve first stop' to preserve the first stop. Select 'Preserve last stop' to preserve the last stop. You can use the 'Reset' button to reset the sample.", "originalCommit": "12be87ac1a8ac54f33634a81be833e1dc1dc685a", "replyToReviewId": null, "replies": null, "type": "inlineReview"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQxMzc1Mjc1Ng==", "url": "https://github.com/Esri/arcgis-runtime-samples-java/pull/475#discussion_r413752756", "bodyText": "I think we've been learning towards using double quotes for button names", "author": "Rachael-E", "createdAt": "2020-04-23T11:56:51Z", "path": "network_analysis/service-area-task/README.md", "diffHunk": "@@ -1,43 +1,38 @@\n-# Service Area Task\n+# Service area task\n \n-Find the service area for a point.\n+Find the service area within a network from a given point.\n \n-A service area shows locations that can be reached from a facility based off a certain impedance [such as travel time]. Barriers can also be added which can effect the impedance by not letting traffic through or adding the time is takes to pass that barrier.\n+![Image of service area task](ServiceAreaTask.gif)\n \n-![](ServiceAreaTask.gif)\n+## Use case\n \n-## How to use sample\n+A service area shows locations that can be reached from a facility based off a certain impedance, such as travel time or distance. Barriers can increase impedance by either adding to the time it takes to pass through the barrier or by altogether preventing passage.\n \n-1. In order to find any service areas at least one ServiceAreaFaciltiy needs to be added.\n-2. To add a facility, click the facility button, then click anywhere on the MapView.\n-3. To add a barrier, click the barrier button, and click multiple locations on MapView.\n-    * Hit the barrier button again to finish drawing barrier.\n-    * Hitting any other button will also stop the barrier from drawing.\n-4. To show service areas around facilities that were added, click show service areas button.\n-5. Reset button, clears all graphics and reset ServiceAreaTask.\n+You might calculate the region around a hospital in which ambulances can service in 30 min or less.\n \n-## How it works\n+## How to use the sample\n+\n+In order to find any service areas at least one facility needs to be added to the map view. Add facilities to the map by clicking the 'Add Facilities' button and then clicking anywhere on the map. To add a barrier, click the 'Add Barrier' button, and click multiple locations on map. Clicking any other button will stop the barrier from drawing. To show the service areas around facilities that were added, click 'Show Service Areas' button. The 'Reset' button clears all graphics and resets the service area task.", "originalCommit": "12be87ac1a8ac54f33634a81be833e1dc1dc685a", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQxNDM1NDQ0Nw==", "url": "https://github.com/Esri/arcgis-runtime-samples-java/pull/475#discussion_r414354447", "bodyText": "Yep, this was inconsistent. Updated!", "author": "JonLavi", "createdAt": "2020-04-24T07:24:22Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQxMzc1Mjc1Ng=="}], "type": "inlineReview"}, {"oid": "e21626f89d5baa134c64383f23434c135f4b8bc4", "url": "https://github.com/Esri/arcgis-runtime-samples-java/commit/e21626f89d5baa134c64383f23434c135f4b8bc4", "message": "Update README.md", "committedDate": "2020-04-23T16:32:27Z", "type": "commit"}, {"oid": "a268f02234c72ca6d83b08ac37ef7efef2c678e8", "url": "https://github.com/Esri/arcgis-runtime-samples-java/commit/a268f02234c72ca6d83b08ac37ef7efef2c678e8", "message": "Apply suggestions from code review\n\nCo-Authored-By: Rachael Ellen <36415565+Rachael-E@users.noreply.github.com>", "committedDate": "2020-04-24T07:21:47Z", "type": "commit"}, {"oid": "f2640ff613c70d2ca132a00f84557d2ce6eb160a", "url": "https://github.com/Esri/arcgis-runtime-samples-java/commit/f2640ff613c70d2ca132a00f84557d2ce6eb160a", "message": "Update README.md", "committedDate": "2020-04-24T07:23:48Z", "type": "commit"}]}