{"data": {"repository": {"pullRequest": {"id": "MDExOlB1bGxSZXF1ZXN0NDY4MjI1OTYw", "number": 5868, "reviewThreads": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOC0xOFQwMjoyMDozNFrOEZSS2g==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOC0xOFQwMjoyMDozNFrOEZSS2g==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDIzOlB1bGxSZXF1ZXN0UmV2aWV3VGhyZWFkMjk0OTQ5NTk0OnYy", "diffSide": "RIGHT", "path": "thirdeye/pom.xml", "isResolved": false, "comments": {"totalCount": 2, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOC0xOFQwMjoyMDozNFrOHCA9fw==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOC0xOFQwODoyNjoxMlrOHCI7ZA==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3MTg3NDk0Mw==", "bodyText": "what is the license for this library?", "url": "https://github.com/apache/pinot/pull/5868#discussion_r471874943", "createdAt": "2020-08-18T02:20:34Z", "author": {"login": "kishoreg"}, "path": "thirdeye/pom.xml", "diffHunk": "@@ -545,6 +545,54 @@\n     </dependencies>\n   </dependencyManagement>\n \n+  <profiles>\n+    <profile>\n+      <id>bigquery</id>\n+      <properties>\n+        <avro.version>1.9.0</avro.version>\n+        <google-auth-library-oauth2-http.version>0.13.0</google-auth-library-oauth2-http.version>\n+        <gax.version>1.42.0</gax.version>\n+        <google-api-services-bigquery.version>v2-rev426-1.25.0</google-api-services-bigquery.version>\n+        <jdbc42.version>1.2.4</jdbc42.version>\n+      </properties>\n+    <dependencyManagement>\n+      <dependencies>\n+        <dependency>\n+          <groupId>com.google.auth</groupId>\n+          <artifactId>google-auth-library-oauth2-http</artifactId>\n+          <version>${google-auth-library-oauth2-http.version}</version>\n+        </dependency>\n+        <dependency>\n+          <groupId>com.google.api</groupId>\n+          <artifactId>gax</artifactId>\n+          <version>${gax.version}</version>\n+        </dependency>\n+        <dependency>\n+          <groupId>com.google.apis</groupId>\n+          <artifactId>google-api-services-bigquery</artifactId>\n+          <version>${google-api-services-bigquery.version}</version>\n+        </dependency>\n+        <dependency>\n+          <groupId>org.apache.avro</groupId>\n+          <artifactId>avro</artifactId>\n+          <version>${avro.version}</version>\n+        </dependency>\n+        <dependency>\n+          <groupId>com.simba.googlebigquery</groupId>", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "fb1d4bfb61944ced81487dcbafb3f8555d595e39"}, "originalPosition": 46}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3MjAwNTQ3Ng==", "bodyText": "In terms of download and usage:\nhttps://cloud.google.com/bigquery/providers/simba-drivers#do_the_drivers_require_a_license\nDo the drivers require a license?\nPrevious versions of the documentation accompanying the drivers made reference to licensing files. \nThese provided drivers do not require a license file, and the documentation has been updated to make this clearer.\n\nNote: The drivers will require a license file (or free trial) if downloaded directly from Simba. \nPlease use the links above to avoid incurring licensing costs.\n\nIn terms of end user license agreement, it's a \"homemade\" license as found in the zip package in EULA.txt\nThe documentation from google seems a bit contradictory with the EULA.txt, so I contacted both parties to have more explanations.\n\n  EULA.txt\nEND-USER LICENSE AGREEMENT (EULA) \n\nIMPORTANT ñ READ CAREFULLY: THIS END-USER LICENSE AGREEMENT (THIS \"AGREEMENT\") \nIS A LEGAL AGREEMENT BETWEEN YOU AND SIMBA (HEREINAFTER DEFINED). PLEASE READ \nTHIS AGREEMENT CAREFULLY BEFORE DOWNLOADING, INSTALLING OR USING THE PROGRAM \n(HEREINAFTER DEFINED). THE PROGRAM MAY INCLUDE PRODUCT ACTIVATION AND OTHER \nTECHNOLOGY DESIGNED TO PREVENT UNAUTHORIZED USE AND COPYING. BY INSTALLING OR \nUSING THE PROGRAM YOU CONSENT TO THE TRANSMISSION OF CERTAIN COMPUTER \nINFORMATION REQUIRED FOR ACTIVATION AND/OR VALIDATION. \n\nEFFECT OF PURCHASE ORDERS; ORDERING DOCUMENTATION. SIMBA WILL NOT BE BOUND BY, \nAND SPECIFICALLY OBJECTS TO, ANY TERM, CONDITION OR OTHER PROVISION THAT IS \nDIFFERENT FROM OR IN ADDITION TO THE SALES ORDER ASSOCIATED HEREWITH AND/OR \nTHIS AGREEMENT THAT IS PROFFERED BY YOU IN ANY RECEIPT, ACCEPTANCE, \nCONFIRMATION, CORRESPONDENCE, OR OTHERWISE. FURTHER, ALL PREPRINTED CLAUSES ON \nANY ORDER FORM PROVIDED BY YOU ARE DEEMED DELETED OR SUPERSEDED BY SAID SALES \nORDER AND/OR THIS AGREEMENT. \n\nOTHER CONTRACTS. THE TERMS AND CONDITIONS OF THIS AGREEMENT MAY BE MODIFIED BY \nA SEPARATE SOFTWARE LICENSE AGREEMENT BETWEEN SIMBA AND THE PROGRAMíS END \nUSER. \n\nUSE CONSENT. YOU ARE DEEMED TO CONSENT TO BE BOUND BY THE TERMS AND CONDITIONS \nOF THIS AGREEMENT BY INSTALLING, COPYING, OR OTHERWISE USING THE PROGRAM. \nFUTHERMORE, THIS AGREEMENT IS ENFORCEABLE AGAINST YOU AND ANY PERSON THAT \nOBTAINED THE PROGRAM AND ON WHOSE BEHALF IT IS USED. \n\nELECTRONIC SIGNATURE. YOU AGREE TO THE USE OF ELECTRONIC COMMUNICATION TO \nENTER INTO THIS AGREEMENT AND HEREBY WAIVE ANY RIGHTS OR REQUIREMENTS UNDER \nANY LAWS OR REGULATIONS IN ANY JURISDICTION THAT REQUIRE AN ORIGINAL \n(NON-ELECTRONIC) SIGNATURE OR DELIVERY OR RETENTION OF NON-ELECTRONIC RECORDS \nTO THE EXTENT PERMITTED UNDER APPLICABLE LAW. IF YOU DO NOT AGREE TO THE TERMS \nAND CONDITIONS OR THIS AGREEMENT, DO NOT PROCEED WITH THE DOWNLOAD, \nINSTALLATION OR USE OF THE PROGRAM. \n\n1. GENERAL TERMS; AUTHORITY. This Agreement governs your use of the \naccompanying computer software program or technology (the \"Program\"), which \nProgram is owned or controlled by Simba Technologies Incorporated, or one of \nits subsidiaries or affiliates (collectively referred to herein as \"Simba\"). \nYou represent and warrant that you have authorized the download and \ninstallation of the Program, or the owner of the computer or server on which \nit will be installed has authorized you to do so. Your rights to use and \nreproduce the Program are expressly set out in this Agreement. \n\n2. USE INDEMNIFICATION. You agree to defend, indemnify and hold harmless \nSimba, its suppliers and its resellers from and against liabilities, costs, \ndamages and expenses (including settlement costs and reasonable attorney fees) \narising from any claims from anybody that result from or relate to your use, \nreproduction or distribution of the Program. \n\n3. OWNERSHIP RIGHTS. The Program is licensed and not sold. The Program is \nprotected by Canadian and United States copyright laws and international \ntreaty provisions. Simba owns and retains all right, title, and interest in \nand to the Program, including all copyrights, patents, trade secret rights, \ntrademarks, and other Intellectual Property Rights therein. Nothing in this \nAgreement, including the possession, installation, or use of the Program \nassigns or transfers to any person any title, right or interest to the \nIntellectual Property Rights in the Program, except as explicitly specified in \nthis Agreement. For purposes of this Agreement, the sale of the Program shall \nmean and confer only the license right to use the Software as specified in \nthis Agreement. \"Intellectual Property Rights\" means patents, rights to \ninventions, copyright and related rights, trademarks, trade names and domain \nnames, rights in get-up, rights in goodwill or to sue for passing off, rights \nin designs, rights in computer software, database rights, rights in \nconfidential information (including know-how and trade secrets) and any other \nintellectual property rights, in each case whether registered or unregistered \nand including all applications (or rights to apply) for, and renewals or \nextensions of, such rights and all similar or equivalent rights or forms of \nprotection which may now or in the future subsist in any part of the world. \n\n4. LICENSE GRANT. Subject to the terms and conditions of this Agreement, Simba \ngrants a limited, non-exclusive, non-transferable, and non-sub-licensable \nright to you to download, install and use the Program for the term and as \notherwise indicated on the invoice associated with your purchase of the \nrelevant Program(s) (the \"License\"). You will immediately inform Simba if the \nProgram is intended to be used outside the scope of the License. A separate \nlicense for any use outside the scope of this Agreement must be obtained from \nSimba in writing in advance of any such use. Notwithstanding anything to the \ncontrary contained herein, an upgrade to new versions/releases of the \nProgram(s) is outside the scope of the License and such upgrade(s) must be \nlicensed separately. \n\n5. SUBSCRIPTION FEES; EFFECT OF NON-PAYMENT. Unless the License is perpetual, \nthe License shall be limited, non-perpetual and granted on a subscription-fee \nbasis requiring annual renewal. Failure to renew and pay the subscription fee \nwill cancel and terminate your rights to use the Program. You have the \nobligation to pay and remit the subscription fee on a timely basis and in \nadvance. \n\n6. TRANSFER AND USE RESTRICTIONS. You may not sell, license, sub-license, \nlend, rent, share, lease, transmit, telecommunicate, distribute, embed, assign \nor otherwise transfer the Program to others. You must comply with all \napplicable Canadian, United States and other export control laws related to \nyour use of the Program. Except as expressly permitted above, you may not \nmodify, reverse engineer, decompile, decrypt, extract or otherwise disassemble \nthe Program. The License does not permit you to distribute or make the Program \navailable over any network where it could be used by multiple devices at the \nsame time. The License does not permit you to directly or indirectly, reverse \nengineer, adapt, modify, decompile, disassemble, translate the Program or \ncreate derivative works based on the Program in any way including without \nlimitation, removal of the installer program, electronic end user license \nagreement, \"About\" screen, or any copyright or other proprietary notice that \nappears in the Program, or otherwise attempt to discover the source code of \nthe Program. In addition, the License does not permit you to remove or alter \nany proprietary notices or labels on the Program. There shall be no rights \nimplied to you or any person using the Program. The license rights granted \nunder this Agreement shall terminate immediately in the event of a breach of \nany provisions of this Agreement. \n\n7. TERMINATION. Simba may terminate this Agreement immediately and without \nprior notice if you breach any term, or otherwise fail to strictly comply with \nthis Agreement. In the event of termination for any reason, you agree to \nimmediately destroy and/or erase the original and all copies of the Program \nand to discontinue its use, and you will not otherwise retain or store the \nProgram or any copies thereof, in any form or medium. You also agree to \nprovide to Simba proof of confirmation of your discontinuance and non-use upon \nrequest. \n\n8. WARRANTIES. Simba warrants for a period of ninety (90) days from the date \nthe Program is delivered to you that the Program shall substantially conform \nto Simbaís documented specifications. In the event of any alleged breach of \nthe above express warranties, you shall report the details of such alleged \nbreach in writing to Simba within the specified ninety (90) day warranty \nperiod. If such alleged breach is reported as required and substantiated by \nSimba, your exclusive remedies shall be, at Simbaís sole option, for Simba to \npromptly repair or replace the Program or any portion thereof necessary to \nremedy the breach, or to refund the fees actually received by Simba for the \nLicense. EXCEPT AS SET FORTH ABOVE, YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT \nTHE USE OF THE PROGRAM IS AT YOUR SOLE RISK. SIMBA PROVIDES THE PROGRAM \n(INCLUDING, BUT NOT LIMITED TO, ANY DOCUMENTATION AND SUPPORT) ON AN \"AS IS\", \n\"WHERE IS\" BASIS WITHOUT ANY WARRANTY OF ANY KIND, EITHER EXPRESS, IMPLIED OR \nSTATUORY, INCLUDING, BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF \nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, ACCURACY, NON-INFRINGEMENT, \nOR CONDITION ARISING FROM COURSE OF PERFORMANCE, COURSE OF DEALING OR USAGE OF \nTRADE. SIMBA DOES NOT WARRANT THAT THE FUNCTIONS CONTAINED IN THE PROGRAM WILL \nMEET YOUR REQUIREMENTS, OR THAT THE OPERATION OF THE PROGRAM WILL BE ERROR \nFREE OR UNINTERRUPTED, OR THAT DEFECTS IN PROGRAM WILL BE CORRECTED. \nFURTHERMORE, SIMBA DOES NOT WARRANT OR MAKE ANY REPRESENTATIONS REGARDING THE \nUSE OR THE RESULTS OF THE USE OF THE PROGRAM IN TERMS OF ITS CORRECTNESS, \nACCURACY, RELIABILITY, OR OTHERWISE. NO ORAL OR WRITTEN INFORMATION OR ADVICE \nGIVEN BY SIMBA OR ITS AUTHORIZED REPRESENTATIVES SHALL CREATE A WARRANTY OR IN \nANY WAY INCREASE THE SCOPE OF THIS WARRANTY. \n\n9. DISCLAIMER & RELEASE. EXCEPT RELATED TO THE EXPRESS WARRANTIES AND \nINDEMNITIES SET FORTH HEREIN, YOU HEREBY WAIVE, RELEASE AND DISCLAIM, ALL \nWARRANTIES, CONDITIONS, INDEMNITIES, OBLIGATIONS AND LIABILITIES OF SIMBA AND \nALL OTHER REMEDIES, RIGHTS, CAUSES OF ACTION AND CLAIMS AGAINST SIMBA WITH \nRESPECT TO THE PROGRAM, ALL RELATED DOCUMENTATION AND ANY SERVICES FURNISHED \nUNDER THIS AGREEMENT, INCLUDING, BUT NOT LIMITED TO, ANY OBLIGATION, \nLIABILITY, RIGHT, REMEDY OR CLAIM IN CONTRACT, INCLUDING FUNDAMENTAL BREACH, \nTORT, NOTWITHSTANDING ANY FAULT, NEGLIGENCE, STRICT LIABILITY OR PRODUCT \nLIABILITY OF SIMBA (WHETHER ACTIVE, PASSIVE OR IMPUTED) AND ANY OBLIGATION, \nLIABILITY, REMEDY, RIGHT OR CLAIM FOR INFRINGEMENT. YOU ACKNOWLEDGE THE \nPROGRAM IS NOT DESIGNED OR LICENSED FOR USE IN HAZARDOUS ENVIRONMENTS \nREQUIRING FAIL-SAFE CONTROLS, INCLUDING, BUT NOT LIMITED TO, OPERATION OF \nNUCLEAR FACILITIES, AIRCRAFT NAVIGATION OR COMMUNICATION SYSTEMS, AIR TRAFFIC \nCONTROL, LIFE SUPPORT OR WEAPONS SYSTEMS. WITHOUT LIMITING THE GENERALITY OF \nTHE FOREGOING, SIMBA EXPRESSLY DISCLAIMS ANY EXPRESS OR IMPLIED WARRANTY OR \nCONDITION OF FITNESS FOR SUCH PURPOSES. YOU ACKNOWLEDGE THAT SIMBA IS ONLY \nWILLING TO ENTER INTO THIS AGREEMENT ON THE CONDITION THAT YOU AGREE TO BE \nBOUND BY THE LIMITATIONS SET FORTH IN THIS AGREEMENT. \n\n10. LIMITATION OF LIABILITY. SIMBA WILL HAVE NO LIABILITY OR OBLIGATION FOR \nANY DAMAGES OR REMEDIES, INCLUDING, WITHOUT LIMITATION, THE COST OF SUBSTITUTE \nGOODS, LOST OR CORRUPTION OF DATA, LOST PROFITS, LOST REVENUES OR ANY OTHER \nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, GENERAL, PUNITIVE, CONSEQUENTIAL OR \nEXEMPLARY DAMAGES, ARISING OUT OF THIS AGREEMENT OR THE USE OR INABILITY TO \nUSE THE PROGRAM. IN NO EVENT WILL SIMBAíS TOTAL AGGREGATE LIABILITY (WHETHER \nIN CONTRACT (INCLUDING FUNDAMENTAL BREACH), WARRANTY, TORT (INCLUDING \nNEGLIGENCE), PRODUCT LIABILITY, INTELLECTUAL PROPERTY INFRINGEMENT OR OTHER \nLEGAL THEORY WITH REGARD TO THE PROGRAM AND/OR THIS AGREEMENT EXCEED THE FEES \nACTUALLY RECEIVED BY SIMBA DIRECTLY ATTRIBUTABLE TO THIS LICENSE OR ONE \nHUNDRED DOLLARS ($100.00), WHICHEVER IS LESSER. Furthermore, Simba will not be \nliable for any delay or failure to perform its obligations under this \nAgreement as a result of any causes or conditions beyond Simbaís reasonable \ncontrol as determined in its sole discretion. \n\n11. INTELLECTUAL PROPERTY CLAIMS. Subject to Section 10 hereof, Simba will \nindemnify and hold you harmless against any damages resulting from use of the \nProgram finally awarded against you pursuant to a judicial proceeding, to the \nextent such proceeding is based upon an infringement of any valid U.S. or \nCanadian patent issued prior to the date you receive the Program from Simba, \nor any valid U.S. or Canadian copyright by the Program, provided that you: (i) \npromptly give written notice of the claim to Simba; (ii) give Simba sole \ncontrol of the defense and settlement of the claim; (iii) provide to Simba all \navailable information and assistance; and (iv) have not compromised or settled \nsuch claim. If the Program is found to infringe or in Simbaís opinion is \nlikely to infringe, Simba may at its sole discretion elect to: (i) obtain for \nyou the right to use the Program; (ii) replace or modify the Program so that \nit is non-infringing; or (iii) remove the Program and refund fees paid by you \nto Simba for the Program. Simba will have no obligation under this Section 11 \nfor any claims which result from: (i) use of the Program in combination with \nany non-Simba provided software (including any portion of the Program not \nauthored by Simba); (ii) Simbaís compliance with your designs or \nspecifications; (iii) modification of the Program by you or anyone other than \nSimba; or (iv) use of an allegedly infringing version of the Program, if the \nalleged infringement could be avoided by the use of a different version made \navailable to you by Simba. This Section 11 sets forth the entire liability of \nSimba and your exclusive remedies for claims of infringement involving the \nProgram. \n\n12. CONFIDENTIAL INFORMATION. You acknowledge that the Program and its \nassociated materials constitute confidential information of Simba that is \nproprietary and valuable to Simba and its licensors and you will use the same \nlevel of care as a reasonable and prudent businessperson would to protect and \nsafeguard the confidentiality of such confidential information while it is in \nyour possession or control. You will not use or reproduce the Program for any \npurpose not expressly set out herein and will not disclose to or grant any \nother party access to the Program for any purpose, other than as expressly \npermitted herein. You acknowledge and agree that you will not publish or make \npublic any performance details or information about the Program without the \nprior written permission of Simba. You acknowledge and agree that performance \nand testing results are confidential information and will only be shared with \nthose within your organization who have a need to know. If you breach your \nconfidentiality covenants herein, then in addition to any other remedies Simba \nmay be entitled to, Simba will be entitled to apply to a court of competent \nequitable jurisdiction for and obtain injunctive relief, including an \ninterlocutory injunction, to enjoin such breach or any anticipated breach. You \nacknowledge that other remedies will not adequately compensate Simba in the \nevent of your breach or anticipated breach of your confidentiality covenants \nherein. Your confidentiality covenants in this Section 12 will not apply to \ninformation which you can conclusively prove: (i) was developed independently \nby you without the use of the Program; (ii) is generally available to the \npublic; or (iii) is available to you on a non-confidential basis from other \nlawful sources. \n\n13. U.S. GOVERNMENT RESTRICTED RIGHTS LEGEND. If the Program is acquired by \nany agency or other part of the U.S. government in a transaction subject to \nthe Federal Acquisition Regulations or the Defense Federal Acquisition \nRegulations, the Program is furnished with Restricted Rights. Use, \nduplication, or disclosure of the Program by the U.S. government is subject to \nall applicable restrictions set forth in such Regulations, as amended from \ntime to time, including subparagraphs (c)(1) and (2) of the Commercial \nComputer Software-Restricted Rights clause at Section 48 C.F.R. 52.227-19. \n\n14. SURVIVAL. Sections 2, 3, 5, 6, 7, 8, 9, 10, 11, 14, 15, 16, 17, 18 and 20, \nand all other provisions of this Agreement which may reasonably be interpreted \nas surviving termination of this Agreement, shall survive the termination of \nthis Agreement. \n\n15. ENTIRE AGREEMENT. This Agreement constitutes the entire agreement between \nyou and Simba regarding the Program. If any provision is found to be invalid \nby a court of competent jurisdiction, the balance of the provisions will \nremain in full force and effect. This Agreement will be governed by and \nconstrued in accordance with the laws of the State of Texas, United States, \nexcluding its conflict of laws rules. The parties hereby attorn to the \njurisdiction of the courts located within the city of Austin, State of Texas, \nUnited States, in the event of any dispute hereunder. The provisions of the \nU.N. Convention on Contracts For The International Sale of Goods (1980) and \nthe American Law Instituteís Principles of the Law of Software Contracts \n(\"Principles\") are expressly excluded. The parties agree that (i) the \nPrinciples shall have no application whatsoever to the interpretation or \nenforcement of this Agreement, and (ii) neither party shall invoke the \nPrinciples in whole or in part in any proceeding relating to this Agreement. \nNotwithstanding the foregoing, Simba may bring suit in any appropriate forum \nor court of competent jurisdiction for any breach of this Agreement or \nmisappropriation of its intellectual property rights, including claims for \nequitable and injunctive relief. \n\n16. ENUREMENT. The rights, restrictions, limitations, disclaimers and remedies \ngranted to, retained by, or for the benefit of Simba will enure to the benefit \nof and will be enforceable by Simba and its licensors, successors and assigns. \nThe obligations, covenants and rights, which apply to you, will enure to your \nbenefit and will be binding on you and your permitted successors and assigns. \n\n17. PUBLICITY. You agree that Simba may, at its option, refer to you in its \nmarketing and promotional materials as a licensee of the Program, unless you \nadvise Simba to the contrary in writing within thirty (30) days of the date \nyou receive the Program. \n\n18. NON-PERSONAL DATA. You agree that Simba may collect, maintain, process and \nuse diagnostic, technical and related information, including information \nrelated to your device, computer, system, application software, peripherals to \nfacilitate the provision of software update, product support and compliance \nverification, and otherwise to improve the Program and other software products \nand delivery of related services. \n\n19. TAXES. You certify that you are not resident in Canada for purposes of the \nExcise Tax Act and that you are not registered under that Act. Where \napplicable, you agree to advise Simba in the event there is any change to your \nresidence status or should you become registered for the purposes of the \nExcise Tax Act. \n\n20. FORCE MAJEURE. Simba shall not be liable hereunder for any failure or \ndelay in the performance of its obligations under this Agreement if such \nfailure or delay is on account of causes beyond its control, including labor \ndisputes, civil commotion, war, fires, floods, inclement weather, governmental \nregulations or controls, casualty, government authority, strikes, or acts of \nGod, in which event Simba shall be excused from its obligations for the period \nof the delay and for a reasonable time thereafter. \n\nv.2017.01 \n\nPage 2 of 5", "url": "https://github.com/apache/pinot/pull/5868#discussion_r472005476", "createdAt": "2020-08-18T08:26:12Z", "author": {"login": "cyrilou242"}, "path": "thirdeye/pom.xml", "diffHunk": "@@ -545,6 +545,54 @@\n     </dependencies>\n   </dependencyManagement>\n \n+  <profiles>\n+    <profile>\n+      <id>bigquery</id>\n+      <properties>\n+        <avro.version>1.9.0</avro.version>\n+        <google-auth-library-oauth2-http.version>0.13.0</google-auth-library-oauth2-http.version>\n+        <gax.version>1.42.0</gax.version>\n+        <google-api-services-bigquery.version>v2-rev426-1.25.0</google-api-services-bigquery.version>\n+        <jdbc42.version>1.2.4</jdbc42.version>\n+      </properties>\n+    <dependencyManagement>\n+      <dependencies>\n+        <dependency>\n+          <groupId>com.google.auth</groupId>\n+          <artifactId>google-auth-library-oauth2-http</artifactId>\n+          <version>${google-auth-library-oauth2-http.version}</version>\n+        </dependency>\n+        <dependency>\n+          <groupId>com.google.api</groupId>\n+          <artifactId>gax</artifactId>\n+          <version>${gax.version}</version>\n+        </dependency>\n+        <dependency>\n+          <groupId>com.google.apis</groupId>\n+          <artifactId>google-api-services-bigquery</artifactId>\n+          <version>${google-api-services-bigquery.version}</version>\n+        </dependency>\n+        <dependency>\n+          <groupId>org.apache.avro</groupId>\n+          <artifactId>avro</artifactId>\n+          <version>${avro.version}</version>\n+        </dependency>\n+        <dependency>\n+          <groupId>com.simba.googlebigquery</groupId>", "state": "SUBMITTED", "replyTo": {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3MTg3NDk0Mw=="}, "originalCommit": {"oid": "fb1d4bfb61944ced81487dcbafb3f8555d595e39"}, "originalPosition": 46}]}}]}}}, "rateLimit": {"limit": 5000, "remaining": 4001, "cost": 1, "resetAt": "2021-11-11T21:28:48Z"}}}