{"data": {"repository": {"pullRequest": {"id": "MDExOlB1bGxSZXF1ZXN0NDg5NTc1MDQz", "number": 12875, "reviewThreads": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOS0xOFQyMzowMDoxN1rOElI_AA==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOS0xOFQyMzowMDoxN1rOElI_AA==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDIzOlB1bGxSZXF1ZXN0UmV2aWV3VGhyZWFkMzA3Mzc5OTY4OnYy", "diffSide": "RIGHT", "path": "website/www/site/content/en/contribute/dependencies.md", "isResolved": false, "comments": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOS0xOFQyMzowMDoxN1rOHUeM2g==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOS0xOFQyMzowMDoxN1rOHUeM2g==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5MTIyODM3OA==", "bodyText": "To help with reviews, only the first sentences are different. Rest of the paragraph is unchanged.", "url": "https://github.com/apache/beam/pull/12875#discussion_r491228378", "createdAt": "2020-09-18T23:00:17Z", "author": {"login": "aaltay"}, "path": "website/www/site/content/en/contribute/dependencies.md", "diffHunk": "@@ -89,4 +89,4 @@ __Dependencies of Java SDK components that may cause issues to other components\n \n ## Dependency updates and backwards compatibility\n \n-Beam releases [adhere to](/get-started/downloads/) semantic versioning. Hence, community members should take care when updating dependencies. Minor version updates to dependencies should be backwards compatible in most cases. Some updates to dependencies though may result in backwards incompatible API or functionality changes to Beam. PR reviewers and committers should take care to detect any dependency updates that could potentially introduce backwards incompatible changes to Beam before merging and PRs that update dependencies should include a statement regarding this verification in the form of a PR comment. Dependency updates that result in backwards incompatible changes to non-experimental features of Beam should be held till the next major version release of Beam. Any exceptions to this policy should only occur in extreme cases (for example, due to a security vulnerability of an existing dependency that is only fixed in a subsequent major version) and should be discussed on the Beam dev list. Note that backwards incompatible changes to experimental features may be introduced in a minor version release.\n+Beam [releases](/get-started/downloads/) generally follow the rules of semantic versioning. Hence, community members should take care when updating dependencies. Minor version updates to dependencies should be backwards compatible in most cases. Some updates to dependencies though may result in backwards incompatible API or functionality changes to Beam. PR reviewers and committers should take care to detect any dependency updates that could potentially introduce backwards incompatible changes to Beam before merging and PRs that update dependencies should include a statement regarding this verification in the form of a PR comment. Dependency updates that result in backwards incompatible changes to non-experimental features of Beam should be held till the next major version release of Beam. Any exceptions to this policy should only occur in extreme cases (for example, due to a security vulnerability of an existing dependency that is only fixed in a subsequent major version) and should be discussed on the Beam dev list. Note that backwards incompatible changes to experimental features may be introduced in a minor version release.", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "5c457511ac10f4f0808d6b327a150f3bf1b590d7"}, "originalPosition": 5}]}}]}}}, "rateLimit": {"limit": 5000, "remaining": 3163, "cost": 1, "resetAt": "2021-11-12T09:44:50Z"}}}