{"pr_number": 7779, "pr_title": "Tweaks for PHP client Markdown files suggested by markdownlint", "pr_createdAt": "2020-10-21T08:05:32Z", "pr_url": "https://github.com/OpenAPITools/openapi-generator/pull/7779", "timeline": [{"oid": "efebe062bb9361cc13048d9d6ba2d34b8dc1102e", "url": "https://github.com/OpenAPITools/openapi-generator/commit/efebe062bb9361cc13048d9d6ba2d34b8dc1102e", "message": "Tweaks for PHP client Markdown files suggested by markdownlint", "committedDate": "2020-10-21T07:59:24Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDIyNzk3Nw==", "url": "https://github.com/OpenAPITools/openapi-generator/pull/7779#discussion_r510227977", "bodyText": "Personally, I prefer putting this block on top for growth hacking but I'm ok to give your suggestion a try to move it to the bottom of the page.", "author": "wing328", "createdAt": "2020-10-22T14:53:05Z", "path": "modules/openapi-generator/src/main/resources/php/README.mustache", "diffHunk": "@@ -4,29 +4,19 @@\n {{{appDescriptionWithNewLines}}}\n {{/appDescriptionWithNewLines}}\n \n-This PHP package is automatically generated by the [OpenAPI Generator](https://openapi-generator.tech) project:", "originalCommit": "efebe062bb9361cc13048d9d6ba2d34b8dc1102e", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDI0MTMwNA==", "url": "https://github.com/OpenAPITools/openapi-generator/pull/7779#discussion_r510241304", "bodyText": "@wing328 as discussed in #7530, the \"growth hacking\" effort is possible without it being overwhelming.\nFrom the POV of the:\n\ngenerator developer, the generator is the most important thing, the code generated is a side-effect, just test files.\ngenerator user, the point of the generator is to generate the best possible package, not promote the generator itself, perpetuum mobile style. :)\npackage user (the developer using the generated code), the generator is totally irrelevant, it might as well not exist, what's important is the code offered in the package, how to use it and get stuff done.\n\nPOV in 1. and 3. are in total opposition, this change is trying to shift the focus a bit more from being laser focused on 1. a bit toward 3. to better realize 2. The goals of 1. should still be realized, but in a more subtle way.", "author": "dkarlovi", "createdAt": "2020-10-22T15:10:22Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDIyNzk3Nw=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDI0NTg4MA==", "url": "https://github.com/OpenAPITools/openapi-generator/pull/7779#discussion_r510245880", "bodyText": "BTW this same issue is visible here: this URL is not the homepage of the package built, it's either the info.contact.url provided in the spec or something the user provides, exactly the same issue as the authorship/license.", "author": "dkarlovi", "createdAt": "2020-10-22T15:16:31Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDIyNzk3Nw=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDkwMTI5OQ==", "url": "https://github.com/OpenAPITools/openapi-generator/pull/7779#discussion_r510901299", "bodyText": "the generator is totally irrelevant, it might as well not exist, what's important is the code offered in the package, how to use it and get stuff done.\n\nMany users still not aware that the API clients can be auto-generated instead of manually written. It doesn't hurt to make them aware there's such thing called OpenAPI Generator that they can use to generate code.", "author": "wing328", "createdAt": "2020-10-23T13:55:39Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDIyNzk3Nw=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDkxMzQwOQ==", "url": "https://github.com/OpenAPITools/openapi-generator/pull/7779#discussion_r510913409", "bodyText": "@wing328 I understand that as do I understand your desire to promote the generator, it's perfectly understandable and not unreasonable.\nMy intention here is to point out generator's users have no inherent interest to promote the generator, they're not its core developer team. What they want from the generator is generating high-quality code which they can offer as \"SDKs\" for their API's users (or use themselves). The generator for group 2. is a tool, a means to an end, it's not the destination.\nThe group 3. doesn't care about the generator at all, they're primarily interested to use the code generated, they're twice removed from it, for them, the code generated is the product. The code and the docs generated should reflect that better, aligning them a bit more toward the interest of users of the code generated goes a long way.\nIt's not about \"informing the users of the package about the generator which made the package\", it's about the package itself. The meta-documentation obviously has its place, but it's shouldn't be the primary focus.", "author": "dkarlovi", "createdAt": "2020-10-23T14:13:48Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDIyNzk3Nw=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDkxNTU1OQ==", "url": "https://github.com/OpenAPITools/openapi-generator/pull/7779#discussion_r510915559", "bodyText": "Think about it like this: if this was a printing press, it would be trying to add a chapter about itself to each book it's printing because it's trying to inform the readers about itself. :) Yes, it's in the printing press's best interest to put the word out, but there's more than one way to do it, being too direct can seem obnoxious and have the opposite effect from the desired one.", "author": "dkarlovi", "createdAt": "2020-10-23T14:16:57Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDIyNzk3Nw=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDkyMDE3OA==", "url": "https://github.com/OpenAPITools/openapi-generator/pull/7779#discussion_r510920178", "bodyText": "I never said the promotional message should be the focus. I'm not against generating a better package. Putting the message at the top of the package doesn't mean we (openapi-generator contributors) are not focusing on the quality of the package.", "author": "wing328", "createdAt": "2020-10-23T14:23:54Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMDIyNzk3Nw=="}], "type": "inlineReview"}]}