{"pr_number": 52821, "pr_title": "[DOCS] Document `any` keyword in EQL syntax", "pr_createdAt": "2020-02-26T14:40:54Z", "pr_url": "https://github.com/elastic/elasticsearch/pull/52821", "timeline": [{"oid": "fbca013e8b5949a233b38d55edb3231a7c001968", "url": "https://github.com/elastic/elasticsearch/commit/fbca013e8b5949a233b38d55edb3231a7c001968", "message": "[DOCS] Document `any` keyword in EQL syntax\n\nAdds documentation for the `any` keyword to the EQL syntax docs.\n\nIncludes:\n\n* Definition of an event type and its relationship to the event type\n  field.\n* Example matching all event types using `any` keyword\n* Example matching event types beginning with a digit\n* Example using `any` with `where true`", "committedDate": "2020-02-26T14:39:41Z", "type": "commit"}, {"oid": "c8f7faab5054a12ba6332f8c249aa91c2e52bb5c", "url": "https://github.com/elastic/elasticsearch/commit/c8f7faab5054a12ba6332f8c249aa91c2e52bb5c", "message": "Remove references to `event_type_field` default", "committedDate": "2020-02-26T18:30:43Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NDk3Nzc5Mg==", "url": "https://github.com/elastic/elasticsearch/pull/52821#discussion_r384977792", "bodyText": "I think it's safe to drop this section, since we've never suggested anywhere else that this should be supported behavior.\nThere is an issue that was created for this (#51853), but I think that's more of a feature request than a bug.\nMy worry here is that the emphasis on digits could cause confusion. You also currently run into the same problem if there are hyphens or special characters in the event type.\nOne thing we could do, is reuse or merge this section with the previous mention that documents that don't have an \"event type\" and can't that be queried with the form <event type> where <condition>, can use any where. I think it's good that you show cases where any where ...  is convenient, and also when it's necessary.", "author": "rw-access", "createdAt": "2020-02-27T08:34:50Z", "path": "docs/reference/eql/syntax.asciidoc", "diffHunk": "@@ -14,21 +14,59 @@ experimental::[]\n [[eql-basic-syntax]]\n === Basic syntax\n \n-EQL queries require an event type and a matching condition. The `where` keyword connects them.\n+EQL queries require an event type and a matching condition. The `where` keyword\n+connects them.\n \n [source,eql]\n ----\n event_type where condition\n ----\n \n-For example, the following EQL query matches `process` events with a `process.name`\n-field value of `svchost.exe`:\n+For example, the following EQL query matches `process` events with a\n+`process.name` field value of `svchost.exe`:\n \n [source,eql]\n ----\n process where process.name == \"svchost.exe\"\n ----\n \n+[discrete]\n+[[eql-syntax-event-types]]\n+==== Event types\n+\n+In {es}, an event type is a valid, indexed value of the\n+<<eql-required-fields,event type field>>. You can set the event type field using\n+the `event_type_field` parameter of the EQL search API.\n+\n+[discrete]\n+[[eql-syntax-match-any-event-type]]\n+===== Match any event type\n+\n+To match events of any type, use the `any` keyword.\n+\n+For example, the following EQL query matches any event with a\n+`network.protocol` field value of `http`:\n+\n+[source,eql]\n+----\n+any where network.protocol == \"http\"\n+----\n+\n+[discrete]\n+[[eql-syntax-event-types-starting-with-digits]]\n+===== Event types starting with digits\n+\n+EQL queries cannot start with a digit. To match event types starting with a", "originalCommit": "c8f7faab5054a12ba6332f8c249aa91c2e52bb5c", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NTAwMTQ4Ng==", "url": "https://github.com/elastic/elasticsearch/pull/52821#discussion_r385001486", "bodyText": "Thanks for the feedback @rw-access. With ea38a56, I added a sentence to the previous section stating that any where can be used for documents without an event type field. Feels much less corner-case-y.", "author": "jrodewig", "createdAt": "2020-02-27T09:23:31Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NDk3Nzc5Mg=="}], "type": "inlineReview"}, {"oid": "ea38a5698e6bfa67d62b6b53ed6bfd01e63f4b4a", "url": "https://github.com/elastic/elasticsearch/commit/ea38a5698e6bfa67d62b6b53ed6bfd01e63f4b4a", "message": "Reuse \"Events starting with digits\" section", "committedDate": "2020-02-27T09:21:21Z", "type": "commit"}, {"oid": "c1eaefd9ff441a2de64dfcc0c32bd121e16b4a96", "url": "https://github.com/elastic/elasticsearch/commit/c1eaefd9ff441a2de64dfcc0c32bd121e16b4a96", "message": "Updates for #53073", "committedDate": "2020-03-04T12:17:52Z", "type": "commit"}, {"oid": "d6e5c1916fce86404b06c6d19388e25ce6aa26a1", "url": "https://github.com/elastic/elasticsearch/commit/d6e5c1916fce86404b06c6d19388e25ce6aa26a1", "message": "Merge branch 'master' into docs__eql-any-where", "committedDate": "2020-03-04T12:21:42Z", "type": "commit"}]}