{"pr_number": 57184, "pr_title": "[DOCS] Explain flood stage watermark.", "pr_createdAt": "2020-05-26T22:29:42Z", "pr_url": "https://github.com/elastic/elasticsearch/pull/57184", "timeline": [{"oid": "0acaaa74ef3ac3b5b46ef10ca33340949b0f4f01", "url": "https://github.com/elastic/elasticsearch/commit/0acaaa74ef3ac3b5b46ef10ca33340949b0f4f01", "message": "Changes for issue #36114.", "committedDate": "2020-05-26T22:27:00Z", "type": "commit"}, {"oid": "8643f7529f3f7f64747757d35754467b28733779", "url": "https://github.com/elastic/elasticsearch/commit/8643f7529f3f7f64747757d35754467b28733779", "message": "Adding stronger wording to the new note.", "committedDate": "2020-05-26T22:31:12Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQzMTA4NDcwOQ==", "url": "https://github.com/elastic/elasticsearch/pull/57184#discussion_r431084709", "bodyText": "I don't think the last sentence follows from the description. I think it'd be lovely to have a paragraph on when it is useful to modify these settings, but that it'd belong more at the top of the page than here. I think if you modify the settings you typically modify all of them. I think you mostly are interested in modifying them if you have a very big disk and 85%/90%/95% would be quite wasteful. Of if you write lots of data very quickly compared to the amount of disk so the defaults aren't conservative enough.", "author": "nik9000", "createdAt": "2020-05-27T12:39:12Z", "path": "docs/reference/modules/cluster/disk_allocator.asciidoc", "diffHunk": "@@ -37,23 +37,23 @@ file or updated dynamically on a live cluster with the\n     changed in 8.0. This setting can be set to `true` to enable the\n     disk watermarks for a single data node cluster (will become default in 8.0).\n \n+[[cluster-routing-flood_stage]]\n `cluster.routing.allocation.disk.watermark.flood_stage`::\n +\n --\n-Controls the flood stage watermark. It defaults to 95%, meaning that\n-Elasticsearch enforces a read-only index block\n+Controls the flood stage watermark, which defaults to 95%. Elasticsearch enforces a read-only index block\n (`index.blocks.read_only_allow_delete`) on every index that has one or more\n-shards allocated on the node that has at least one disk exceeding the flood\n-stage. This is a last resort to prevent nodes from running out of disk space.\n-The index block is automatically released once the disk utilization falls below\n+shards allocated on the node, and that has at least one disk exceeding the flood\n+stage. This setting is a last resort to prevent nodes from running out of disk space.\n+The index block is automatically released when the disk utilization falls below\n the high watermark.\n \n-NOTE: You can not mix the usage of percentage values and byte values within\n-these settings. Either all are set to percentage values, or all are set to byte\n-values. This is so that we can we validate that the settings are internally\n-consistent (that is, the low disk threshold is not more than the high disk\n-threshold, and the high disk threshold is not more than the flood stage\n-threshold).\n+NOTE: You cannot mix the usage of percentage values and byte values within\n+these settings. Either all values are set to percentage values, or all are set to byte\n+values. This enforcement is so that Elasticsearch can validate that the settings are internally\n+consistent, ensuring that the low disk threshold is less than the high disk\n+threshold, and the high disk threshold is less than the flood stage\n+threshold. Therefore, you typically do not need to modify this setting.", "originalCommit": "8643f7529f3f7f64747757d35754467b28733779", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQzMTQxOTI0Mw==", "url": "https://github.com/elastic/elasticsearch/pull/57184#discussion_r431419243", "bodyText": "I removed the last sentence this commit. If you think an expanded explanation of why users might want to modify these settings is warranted, let me know.", "author": "lockewritesdocs", "createdAt": "2020-05-27T20:21:55Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQzMTA4NDcwOQ=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQzMTQzMDkzNQ==", "url": "https://github.com/elastic/elasticsearch/pull/57184#discussion_r431430935", "bodyText": "I do think it'd be nice, but this is a good change as it stands now anyway. Merge anytime you are ready!", "author": "nik9000", "createdAt": "2020-05-27T20:45:09Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQzMTA4NDcwOQ=="}], "type": "inlineReview"}, {"oid": "f82d51a552c8988ad4f4053ca3ed0914845bf126", "url": "https://github.com/elastic/elasticsearch/commit/f82d51a552c8988ad4f4053ca3ed0914845bf126", "message": "Removing statement about typically not needting to set the read-only allow delete block.", "committedDate": "2020-05-27T19:08:38Z", "type": "commit"}, {"oid": "03fbd466eefcf85f6df48b913986b4a361bc7aa7", "url": "https://github.com/elastic/elasticsearch/commit/03fbd466eefcf85f6df48b913986b4a361bc7aa7", "message": "Replacing Elasticsearch with {es} variable.", "committedDate": "2020-05-28T12:23:03Z", "type": "commit"}]}