{"pr_number": 63079, "pr_title": "[DOCS] Document escaped backticks for identifiers", "pr_createdAt": "2020-09-30T14:53:51Z", "pr_url": "https://github.com/elastic/elasticsearch/pull/63079", "timeline": [{"oid": "bbe121f563089caaaafee2af97b9967867578871", "url": "https://github.com/elastic/elasticsearch/commit/bbe121f563089caaaafee2af97b9967867578871", "message": "[DOCS] Document escaped backticks for identifiers", "committedDate": "2020-09-30T14:52:01Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU3NzExMQ==", "url": "https://github.com/elastic/elasticsearch/pull/63079#discussion_r497577111", "bodyText": "Underscores are also valid. Also, if a field name starts with a number (i.e. 10x, then it also needs to be wrapped in backticks)", "author": "rw-access", "createdAt": "2020-09-30T14:55:40Z", "path": "docs/reference/eql/syntax.asciidoc", "diffHunk": "@@ -54,6 +54,30 @@ For example, the following EQL query matches any documents with a\n any where network.protocol == \"http\"\n ----\n \n+[discrete]\n+[[eql-syntax-escape-identifiers]]\n+==== Escape an event category or field name\n+\n+Event categories or field names containing non-alphanumeric characters must be\n+escaped with enclosing backticks (+++`+++). Non-alphanumeric characters include\n+underscores (`_`), dots (`.`), hyphens (`-`), or spaces.", "originalCommit": "bbe121f563089caaaafee2af97b9967867578871", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU3OTQ3OA==", "url": "https://github.com/elastic/elasticsearch/pull/63079#discussion_r497579478", "bodyText": "Thanks! I haven't tested this yet so I'll confirm.", "author": "jrodewig", "createdAt": "2020-09-30T14:58:36Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU3NzExMQ=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU4MDQxNg==", "url": "https://github.com/elastic/elasticsearch/pull/63079#discussion_r497580416", "bodyText": "and dots are still fine for fields, as long as they are in the middle and not at the ends. process.name is still valid", "author": "rw-access", "createdAt": "2020-09-30T14:59:41Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU3NzExMQ=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU5NTA0Mw==", "url": "https://github.com/elastic/elasticsearch/pull/63079#discussion_r497595043", "bodyText": "Thanks for pointing this out @rw-access. Was able to confirm in my testing. I won't mention dots at all as ES doesn't allow the creation of fields starting or ending with a dot.", "author": "jrodewig", "createdAt": "2020-09-30T15:18:34Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU3NzExMQ=="}], "type": "inlineReview"}, {"oid": "6912399c3e057f1f9405dd856521f4d4a24516e4", "url": "https://github.com/elastic/elasticsearch/commit/6912399c3e057f1f9405dd856521f4d4a24516e4", "message": "Fix escape reqs", "committedDate": "2020-09-30T15:15:57Z", "type": "commit"}, {"oid": "677b0bd29a667ee84dc31537e364f4d594af704e", "url": "https://github.com/elastic/elasticsearch/commit/677b0bd29a667ee84dc31537e364f4d594af704e", "message": "Fix heading", "committedDate": "2020-09-30T15:29:58Z", "type": "commit"}]}