{"pr_number": 65898, "pr_title": "[DOCS] EQL: Add diagrams for sequence matching", "pr_createdAt": "2020-12-04T17:35:55Z", "pr_url": "https://github.com/elastic/elasticsearch/pull/65898", "timeline": [{"oid": "fd9fff6314ed5798341953e19aafff67c9023947", "url": "https://github.com/elastic/elasticsearch/commit/fd9fff6314ed5798341953e19aafff67c9023947", "message": "[DOCS] EQL: Add diagrams for sequence matching", "committedDate": "2020-12-04T17:46:45Z", "type": "forcePushed"}, {"oid": "88430aaae8aac845d5a16adab8630f5923b4333e", "url": "https://github.com/elastic/elasticsearch/commit/88430aaae8aac845d5a16adab8630f5923b4333e", "message": "[DOCS] EQL: Add diagrams for sequence matching", "committedDate": "2020-12-04T17:47:36Z", "type": "forcePushed"}, {"oid": "ad19a4d02c45ad60c692cae0b76cedd136e1c961", "url": "https://github.com/elastic/elasticsearch/commit/ad19a4d02c45ad60c692cae0b76cedd136e1c961", "message": "[DOCS] EQL: Add diagrams for sequence matching", "committedDate": "2020-12-04T18:07:29Z", "type": "forcePushed"}, {"oid": "140a7878a14cc349bdd90ac634e1c31553d9fbb4", "url": "https://github.com/elastic/elasticsearch/commit/140a7878a14cc349bdd90ac634e1c31553d9fbb4", "message": "[DOCS] EQL: Add diagrams for sequence matching", "committedDate": "2020-12-04T18:08:32Z", "type": "commit"}, {"oid": "140a7878a14cc349bdd90ac634e1c31553d9fbb4", "url": "https://github.com/elastic/elasticsearch/commit/140a7878a14cc349bdd90ac634e1c31553d9fbb4", "message": "[DOCS] EQL: Add diagrams for sequence matching", "committedDate": "2020-12-04T18:08:32Z", "type": "forcePushed"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUzNjI5MjQ5NQ==", "url": "https://github.com/elastic/elasticsearch/pull/65898#discussion_r536292495", "bodyText": "I originally tried using SVG images here similar to the ones above, but they broke up the example too much.", "author": "jrodewig", "createdAt": "2020-12-04T18:24:00Z", "path": "docs/reference/eql/syntax.asciidoc", "diffHunk": "@@ -847,81 +847,165 @@ The query's event items correspond to the following states:\n * State B:  `[process where process.name == \"bash\"]`\n * Complete: `[process where process.name == \"cat\"]`\n \n+image::images/eql/sequence-state-machine.svg[align=\"center\"]\n+\n To find matching sequences, the query uses separate state machines for each\n-unique `user.name` value. Pending sequence matches move through each machine's\n-states as follows:\n+unique `user.name` value. Based on the data set, you can expect two state\n+machines: one for the `root` user and one for `elkbee`.\n+\n+image::images/eql/separate-state-machines.svg[align=\"center\"]\n+\n+Pending sequence matches move through each machine's states as follows:\n \n [source,txt]\n ----\n-{ \"index\" : { \"_id\" : \"1\" } }\n+{ \"index\" : { \"_id\": \"1\" } }\n { \"user\": { \"name\": \"root\" }, \"process\": { \"name\": \"attrib\" }, ...}\n // Creates sequence [1] in state A for the \"root\" user.\n //\n-// root: A=[1]\n-\n-{ \"index\" : { \"_id\" : \"2\" } }\n+// +-------------------------root-------------------------+\n+// |  +-----------+     +-----------+     +------------+  |\n+// |  |  State A  |     |  State B  |     |  Complete  |  |\n+// |  +-----------+     +-----------+     +------------+  |\n+// |  |    [1]    |     |           |     |            |  |\n+// |  +-----------+     +-----------+     +------------+  |\n+// +------------------------------------------------------+", "originalCommit": "140a7878a14cc349bdd90ac634e1c31553d9fbb4", "replyToReviewId": null, "replies": null, "type": "inlineReview"}, {"oid": "145978ce6837851fb9b27cb94d5685e441df7a44", "url": "https://github.com/elastic/elasticsearch/commit/145978ce6837851fb9b27cb94d5685e441df7a44", "message": "wrap ascii diagram headings in quotes", "committedDate": "2020-12-04T18:28:21Z", "type": "commit"}, {"oid": "61682cdf8254ac423feb25d20d00728695fc377b", "url": "https://github.com/elastic/elasticsearch/commit/61682cdf8254ac423feb25d20d00728695fc377b", "message": "Remove arrow", "committedDate": "2020-12-04T18:29:29Z", "type": "commit"}, {"oid": "12dde4ed4f1b3a19569e3336c8b2c51cf9c068a8", "url": "https://github.com/elastic/elasticsearch/commit/12dde4ed4f1b3a19569e3336c8b2c51cf9c068a8", "message": "Whitespace", "committedDate": "2020-12-04T20:17:54Z", "type": "commit"}]}