{"pr_number": 1745, "pr_title": "Fix flakey GcMetricsIT", "pr_createdAt": "2020-10-21T05:50:56Z", "pr_url": "https://github.com/apache/accumulo/pull/1745", "timeline": [{"oid": "4c066f07259dac01528401706af545a45121c242", "url": "https://github.com/apache/accumulo/commit/4c066f07259dac01528401706af545a45121c242", "message": "Fix flakey GcMetricsIT\n\n* Check the metrics sink file for the next update after the test starts,\n  rather than assuming two attempts are sufficient\n* For the second read of the metrics sink file, get any update strictly\n  *after* the first update\n* Don't rely on `System.currentTimeMillis()` across cores as much,\n  because that's not very reliable", "committedDate": "2020-10-21T05:47:04Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUwOTM4MzQ3NA==", "url": "https://github.com/apache/accumulo/pull/1745#discussion_r509383474", "bodyText": "This looks fine - I do not recall if I had issues and made subsequent changes that makes this work - but I do recall trying to deal with cases where there were multiple runs or multiple tests within a file.  The file tailer would return the last line in the file - and often that was from a different test and that would invalidate any comparisons between metrics updates.  Because these read / parsing the hadoop metrics file, there was not as much control as I would prefer and this was a work-around for those limitations.\nI think the file tailer is used in other metrics tests (FateMetrics) and may benefit from the same changes.\nAlso, you could argue that these tests are unnecessary - they seem to border on testing the metrics system as much as our functionality - for development they were necessary - for us, the tests could just make sure that the proper values are available to the metrics system, but on the other hand it the test do validate the end-end metrics publishing.  Validating that we publish metrics at some level seems desirable - how much we actually need to then validate the values is where I keep going back and forth.", "author": "EdColeman", "createdAt": "2020-10-21T15:25:09Z", "path": "test/src/main/java/org/apache/accumulo/test/functional/GcMetricsIT.java", "diffHunk": "@@ -98,10 +98,8 @@ public void gcMetricsPublished() {\n \n       var updateTimestamp = System.currentTimeMillis();\n \n-      // Read two updates, throw away the first snapshot - it could have been from a previous run\n-      // or another test (the file appends.)\n-      LineUpdate firstUpdate = waitForUpdate(-1, gcTail);\n-      firstUpdate = waitForUpdate(firstUpdate.getLastUpdate(), gcTail);\n+      // Get next update after current time\n+      LineUpdate firstUpdate = waitForUpdate(updateTimestamp, gcTail);", "originalCommit": "4c066f07259dac01528401706af545a45121c242", "replyToReviewId": null, "replies": null, "type": "inlineReview"}]}