{"pr_number": 9197, "pr_title": "[squeezebox] Clarify the process of adding/discovering the server", "pr_createdAt": "2020-12-02T01:04:41Z", "pr_url": "https://github.com/openhab/openhab-addons/pull/9197", "timeline": [{"oid": "17fed72596ff412c5117b1eceef2025abea7914a", "url": "https://github.com/openhab/openhab-addons/commit/17fed72596ff412c5117b1eceef2025abea7914a", "message": "Clarify the process of adding/discovering the server", "committedDate": "2020-12-02T01:02:23Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUzNjM4MDMwNg==", "url": "https://github.com/openhab/openhab-addons/pull/9197#discussion_r536380306", "bodyText": "Please put each sentence on its own line.\n\n  \n    \n      \n        Suggested change\n        \n          \n    \n\n        \n      \n    \n    \n      \n          \n            \n            Once it is added as a Thing the Squeeze Server bridge will discover Squeeze Players automatically. If your Squeeze Server is not discovered automatically, you can add it manually by creating a .thing file containing something like this (more example [below](https://www.openhab.org/addons/bindings/squeezebox/#thing-configuration)):\n          \n          \n            \n            Once it is added as a Thing the Squeeze Server bridge will discover Squeeze Players automatically.\n          \n          \n            \n            If your Squeeze Server is not discovered automatically, you can add it manually by creating a .thing file containing something like this (more example [below](https://www.openhab.org/addons/bindings/squeezebox/#thing-configuration)):", "author": "cpmeister", "createdAt": "2020-12-04T21:08:07Z", "path": "bundles/org.openhab.binding.squeezebox/README.md", "diffHunk": "@@ -25,7 +25,10 @@ Squeeze players may be official Logitech products or other players like [Squeeze\n ## Discovery\n \n A Squeeze Server is discovered through UPnP in the local network.\n-Once it is added as a Thing the Squeeze Server bridge will discover Squeeze Players automatically.\n+Once it is added as a Thing the Squeeze Server bridge will discover Squeeze Players automatically. If your Squeeze Server is not discovered automatically, you can add it manually by creating a .thing file containing something like this (more example [below](https://www.openhab.org/addons/bindings/squeezebox/#thing-configuration)):", "originalCommit": "17fed72596ff412c5117b1eceef2025abea7914a", "replyToReviewId": null, "replies": null, "type": "inlineReview"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUzNjQyMTE1Nw==", "url": "https://github.com/openhab/openhab-addons/pull/9197#discussion_r536421157", "bodyText": "I find this change a little confusing.\n\n\nThis section is talking about Discovery, so it seems out of place to be giving examples of how to create the thing using a .things file (not a .thing file). I'd suggest putting the .things file example further down in the document where the Items file example is given.\n\n\nAlso, even if the case where server thing is not discovered automatically, it still can be created through the Admin UI (as all other things can be created). However, since this is not mentioned, it leaves the user with the idea that if it's not discovered automatically, then they need to create it using a .things file. It just feels like a discussion of how to create things manually using any method (UI or .things file) is out of place in the section on Discovery.", "author": "mhilbush", "createdAt": "2020-12-04T22:28:30Z", "path": "bundles/org.openhab.binding.squeezebox/README.md", "diffHunk": "@@ -25,7 +25,10 @@ Squeeze players may be official Logitech products or other players like [Squeeze\n ## Discovery\n \n A Squeeze Server is discovered through UPnP in the local network.\n-Once it is added as a Thing the Squeeze Server bridge will discover Squeeze Players automatically.\n+Once it is added as a Thing the Squeeze Server bridge will discover Squeeze Players automatically. If your Squeeze Server is not discovered automatically, you can add it manually by creating a .thing file containing something like this (more example [below](https://www.openhab.org/addons/bindings/squeezebox/#thing-configuration)):", "originalCommit": "17fed72596ff412c5117b1eceef2025abea7914a", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDU0NjI5MDIzOQ==", "url": "https://github.com/openhab/openhab-addons/pull/9197#discussion_r546290239", "bodyText": "@mhilbush I pretty much agree with your comments here - such a paragraph simply does not belong into the discovery section, especially as it is biased towards textual configuration.\nI don't see this answered or addressed - what made you approve it now nonetheless?", "author": "kaikreuzer", "createdAt": "2020-12-19T22:20:10Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUzNjQyMTE1Nw=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDU0NjI5MTMyOQ==", "url": "https://github.com/openhab/openhab-addons/pull/9197#discussion_r546291329", "bodyText": "The example was removed, which is what I thought was most out of place.\nAlso, the whole doc is a bit dated, as it's been modified and extended quite a few times (mostly by me). As I'm considering a complete rewrite after the 3.0 release, I didn't find the change too objectionable.", "author": "mhilbush", "createdAt": "2020-12-19T22:31:52Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUzNjQyMTE1Nw=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDU0NjI5MzcyNg==", "url": "https://github.com/openhab/openhab-addons/pull/9197#discussion_r546293726", "bodyText": "This section is talking about Discovery, so it seems out of place to be giving examples of how to create the thing using a .things file\n\nFrom a user perspective, it makes sense that a section about discovery also mentions what to do when discovery doesn't work. To just say that the server will be discovered automatically is missleading for users where autodiscovery - for whatever reason - doesn't work and they will appreciate information about how to proceed. I agree that the details don't need to be in the discovery section. It would work just as well to move the example to a different place and then refer to it, e.g. by saying something like \"If the Server is not discovered automatically, it can be added manually via the Admin UI or by creating a .things file as described below.\"\nAn alternative would be to rename the section from \"Discovery\" to something like \"Adding the server\". Autodiscovery, UI, and things file would then three ways of adding the server.\n\nif the case where server thing is not discovered automatically, it still can be created through the Admin UI (as all other things can be created). However, since this is not mentioned, it leaves the user with the idea that if it's not discovered automatically, then they need to create it using a .things file.\n\nFully agree. The UI option should also be mentioned. I didn't do so because the entire page seemed to be focussed on textual configuration and because I am not sure what UI changes are forthcoming in OH3.", "author": "tophee", "createdAt": "2020-12-19T22:56:44Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUzNjQyMTE1Nw=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDU0NjI5NDMyOA==", "url": "https://github.com/openhab/openhab-addons/pull/9197#discussion_r546294328", "bodyText": "From a user perspective, it makes sense that a section about discovery also mentions what to do when discovery doesn't work.\n\nBut it does not make much sense to have such an explanation 200 times in 200 different add-ons. The suggestion here is simply \"if discovery does not work, create the thing manually\". Yeah, that applies in any case and is not specific to this binding. Therefore it should be part of the general tutorial and not part of each and every binding documentation.", "author": "kaikreuzer", "createdAt": "2020-12-19T23:03:58Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUzNjQyMTE1Nw=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDU0NjI5NjY5MA==", "url": "https://github.com/openhab/openhab-addons/pull/9197#discussion_r546296690", "bodyText": "I see your point. Your aim is to keep the documentation as compact as possible. But can I ask you: what is the problem with giving users the same information on multiple pages (as long as it is relevant on that page, of course)?\nNobody reads the documentation for each of the 200 add-ons and gets annoyed, like: \"Why do they keep mentioning this?\" I believe the typical way these pages are used is that you are unsure about how a particular addon works and are looking for information about how to proceed. That's why I thought it makes sense to provide that information right there where people are looking for it.\nI realize that your point may also be that users should read the general tutorial before reading the documentation, and for those users who learn a new system in abstract terms before applying that knowledge in practice, that will work fine. But I think there are many users who find it easier to understand how a new system works by trying out how specific things work and building a more abstract picture from that. So to accommodate those users, I would think it makes sense for the documentation to also support that learning path. Perhaps their learning could be enhanced by adding yet another bit of information: \"As is the case with all add-ons, if auto-discovery fails, the server can be added manually via the Admin UI or by creating a .things file as described below.\"", "author": "tophee", "createdAt": "2020-12-19T23:31:33Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUzNjQyMTE1Nw=="}], "type": "inlineReview"}, {"oid": "c0b48e7e0fb56e0fb136d381a605b00d86abfa4e", "url": "https://github.com/openhab/openhab-addons/commit/c0b48e7e0fb56e0fb136d381a605b00d86abfa4e", "message": "Update bundles/org.openhab.binding.squeezebox/README.md\n\nCo-authored-by: Connor Petty <mistercpp2000@gmail.com>", "committedDate": "2020-12-19T20:07:30Z", "type": "commit"}]}