{"data": {"repository": {"pullRequest": {"id": "MDExOlB1bGxSZXF1ZXN0NDAxMTIyODUy", "number": 1302, "title": "Import teams from source exercise", "bodyText": "Checklist\n\n I tested all changes and all related features with different users (student, tutor, instructor, admin) on the test server https://artemistest.ase.in.tum.de.\n Server: I added multiple integration tests (Spring) related to the features\n Server: I added @PreAuthorize and check the course groups for all new REST Calls (security)\n Server: I implemented the changes with a good performance and prevented too many database calls\n Server: I documented the Java code using JavaDoc style.\n Client: I added multiple integration tests (Jest) related to the features\n Client: I added authorities to all new routes and check the course groups for displaying navigation elements (links, buttons)\n Client: I documented the TypeScript code using JSDoc style.\n Client: I added multiple screenshots/screencasts of my UI changes\n Client: I translated all the newly inserted strings into German and English\n\nMotivation and Context\nRight now, new teams have to be created from scratch for every exercise. This makes sense if every exercise in a course is conducted independently from each other and the teams don't have to be the same across exercises. However, a common use case will be that multiple exercises (or even all exercises in a course) form a cohesive group that is meant to be worked on as a whole by the same teams (although students could drop out or be added only at a later exercise as well).\nIn order to facilitate that use case, this PR adds the instructor-level functionality of importing teams from an existing exercise (also referred to as \"source exercise\") into a new exercise (also referred to as \"destination exercise\"). This functionality is available on the teams overview page for an exercise. It is accessible via a button with the label \"Import teams\" (right next to the \"Create team\" button).\nFeature Walkthrough\nClicking on the button opens the import dialog. First, a source exercise has to be selected from which the teams should be imported. Then the user is presented with all the teams present in the source exercise (also referred to as \"source teams\"). If the destination exercise is a newly created one and has no teams yet, everything is very easy and the user simply clicks on \"Import\".\nIf the destination exercise already has teams in it, the import process becomes a little more involved. The user can see which of the source teams conflict with the existing teams in the destination exercise (also referred to as \"destination teams\"). There are two invariants that must be met for a source team to be considered \"conflict-free\":\n\nThe short name of the source team does not exist yet in the destination exercise (since the team short name acts as an identifier and must be unique per exercise)\nThe students of the source team must not yet exist in one of the destination teams (since a student cannot be part of more than one team per exercise)\n\nThe instructor now has to choose a so-called \"Import strategy\". An import strategy defines the behavior of the import in terms of which source teams get imported and what happens to the existing teams. Right now, there are only two rather naive but still useful import strategies:\n\nPurge existing Before importing all of the teams from the source exercise, all existing teams of this exercise will be deleted with their participations.\nCreate only Only conflict-free source teams (shown in green) will be imported. Existing teams of this exercise will not be touched.\n\nThe first strategy is marked as \"dangerous\" and requires a delete confirmation modal with the user typing the name of th exercise. It is useful in situations where the existing teams of the exercise should be discarded, e.g. when a previous import should be completely overwritten due to the team assignment in the source exercise having changed after that import and wanting the destination exercise teams to reflect this new assignment as well. It will also be very useful on the test server.\nThe second strategy can be seen as a partial import. It can be useful in situations where an import has been performed previously and students already started working on the destination exercise but then a couple of new teams joined the source exercise late and should now also be copied to the destination exercise. The first strategy cannot be applied since teams in the destination exercise already have participations and we definitely don't want to lose those. The \"Create only\" strategy can be applied and will show the user which conflict-free teams from the source exercise can be added in to the destination teams without issues.\nThe source team conflict list in the dialog can also be useful to manually fix some of those conflicts before performing an import of the second strategy by modifying either the source or destination teams or both. The strategies are set up in such a way that it is easily possible to add additional ones if it becomes apparent that other import strategies would be expedient for instructors or admins to have at their disposal.\nChange Description\nServer-side:\n\nEase global unique constraint of shortName for teams (instead create unique together constraint for exerciseId and ShortName, i.e. short names must be unique per exercise). The reasoning behind this is that the short name should serve as a team identifier also across exercises. Sample use case: This allows to show the submissions of a team of all exercises in a course on the team's detail page.\nAdd copy constructor to Team that copies all attributes that should be transferred onto a clone. These are all except the id and the exerciseId (since cloning a team into the same exercise is not what we want and would also fail due to unique constraints).\nAdd new service method importTeamsFromSourceExerciseIntoDestinationExerciseUsingStrategy that imports the teams of a given exercise into another exercise using a specified strategy.\nApply Java Strategy Pattern for team import strategies (TeamImportStrategy is implemented by PurgeExistingStrategy and CreateOnlyStrategy)\nAdd new endpoint for teams import in TeamResource that calls the service method after authorization and plausibility checks: @PostMapping(\"/exercises/{destinationExerciseId}/teams/import-from-exercise/{sourceExerciseId}\")\nAdd changelog file that creates a database trigger used to enforce an important unique constraint across tables, namely that no student is allowed to belong to more than one team for the same exercise. Since the columns exercise_id and student_id are not part of the same database table, this cannot be enforced via a normal unique constraint, thus the trigger that is executed before inserts into the team_students table (which manages the ManyToMany relationship between teams and students). It will return a custom error stating all relevant conflict information and most importantly it will prevent the insert statement from being performed which would lead to an inconsistent database state violating the unique constraint that is assumed on the application-logic level.\n\nClient-side:\n\nNew component: TeamExerciseSearch (lets a user select an exercise from all exercises in a course; the current application in the scope of this PR is to let the user select a team-based exercise as a source exercise for the import)\nNew service method importTeamsFromSourceExercise that mirrors the endpoint on the server-side mentioned above\nNew components: TeamsImportButton and TeamsImportDialog (the latter is the main component of this PR and allows the instructor to perform the import of teams into his new exercise)\nAdd button \"Import teams\" onto the teams overview page for an exercise (next to the button \"Create Team\"; only visible to instructors and above)\nGeneralize the delete button directive a bit more to allow for a custom appearance and button label\nAdd translation strings + update mocks\n\nPerformance Evaluation\nParameters: source exercise with 1000 teams with 2 students each\n\nloading of teams from source exercise: 140ms request time (client-side rendering: ~2.5s)\nimporting of teams into destination exercise: 3.4s request time (client-side rendering: ~2.5s)\n\nThese times seem more than acceptable for such a large import action.\nSteps for Testing\nBasic scenario\n\nLog in to Artemis as an instructor (or admin)\nNavigate to Course Management\nCreate a team-based exercise (how?)\nCreate a couple of teams for the new exercise\nCreate another team-based exercise\nInstead of creating teams again, use the button \"Import teams\" on the teams overview page of the new exercise\nSelect the previously created exercise with teams as the \"source exercise\" for the import\nCheck that the source teams appear correctly with their students\nClick on the submit button \"Import\"\nVerify that the teams were successfully imported\n\nAdvanced scenario\n\nExecute steps 1-5 from the basic scenario above\nCreate a few teams for the second exercise. Different variants are conceivable:\n2.1. Teams with different short names and students than in the source exercise that will be selected\n2.2. Teams with overlapping short names but different students than in the source exercise that will be selected\n2.3. Teams with different short names but overlapping students compared to the source exercise that will be selected\n2.3. Teams with both overlapping short names and overlapping students compared to the source exercise that will be selected\nThen click the button \"Import teams\" on the teams overview page of the second exercise\nSelect the first exercise with teams as the \"source exercise\" for the import\nCheck that the source teams appear correctly with their students\nVerify that the conflicts presented match your expectations based on how you set up the teams in the destination exercise\nSelect the different import strategies and verify that the preview numbers in the dialog footer are correct\nClick on the submit button \"Import\"\nVerify that the teams were imported correctly according to the chosen import strategy\n\nScreenshots\nDialog after clicking on the button \"Import teams\":\n\nIf a source exercise is selected that does not have teams, a warning is shown and the user can only chose a different source exercise:\n\nIf a source exercise is selected, all teams from that exercise are shown for confirmation. Since our current exercise has no teams yet in this screenshot specifically (see background behind the modal), there are no conflicts and no import strategy has to be chosen since all teams can be imported without any issues:\n\nNow we are in an exercise that already has three teams (see in the background behind the modal). If we now select a source exercise, we can see that there are conflicts between the two sets of teams. The legend explains these conflicts (it has reduced opacity to not grab too much attention and transitions to full opacity when the user moves his mouse over it).\n\nSource exercise select dropdown + mouse hover on legend (for reference):\n\nAn import strategy has been chosen. The modal footer gives a preview in terms of numbers for teams to be deleted and for total teams after the import:\n\nSince the \"Purge existing\" strategy has been chosen, an extra confirmation is required:\n\nIf the \"Create only\" strategy is chosen, different relevant preview numbers are presented:\n\nScreenshot from performance testing with around 1000 teams:", "createdAt": "2020-04-08T23:05:29Z", "url": "https://github.com/ls1intum/Artemis/pull/1302", "merged": true, "mergeCommit": {"oid": "12f8bbfa8c086f9aadc73d31c14e6a8d84960559"}, "closed": true, "closedAt": "2020-04-16T11:19:46Z", "author": {"login": "madwau"}, "timelineItems": {"totalCount": 43, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpPPAAABcVVCpDgH2gAyNDAxMTIyODUyOmUwMTBkYzljYjYyNGY3N2U5NGQzZDM1ZTQzOTNiNmYzM2I2ZTM2YjQ=", "endCursor": "Y3Vyc29yOnYyOpPPAAABcYKt5lgFqTM5NDUyOTA0Mg==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"__typename": "PullRequestCommit", "commit": {"oid": "e010dc9cb624f77e94d3d35e4393b6f33b6e36b4", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/e010dc9cb624f77e94d3d35e4393b6f33b6e36b4", "committedDate": "2020-04-07T15:29:23Z", "message": "Ease unique conditions for team short name (from globally unique to unique per exercise)"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "1aefbe1b9c3c6bbbb6fe79862a817f6f02f8a0da", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/1aefbe1b9c3c6bbbb6fe79862a817f6f02f8a0da", "committedDate": "2020-04-07T17:06:32Z", "message": "Foundation for client side of importing teams from source exercise into destination exercise"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "c687f3e6c990d036a6bb124f573227ccaa537bf3", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/c687f3e6c990d036a6bb124f573227ccaa537bf3", "committedDate": "2020-04-07T18:19:58Z", "message": "Don't offer current exercise as source exercise"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "196e4ad56eb7e4b8a6f75f88cfeb0634c4d9536c", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/196e4ad56eb7e4b8a6f75f88cfeb0634c4d9536c", "committedDate": "2020-04-07T20:17:29Z", "message": "Polish client"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "707fe6f1b19f0aa7a8b584385c82bf1b6dcb8aaa", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/707fe6f1b19f0aa7a8b584385c82bf1b6dcb8aaa", "committedDate": "2020-04-07T20:18:26Z", "message": "Merge remote-tracking branch 'origin/develop' into feature/import-teams-from-exercise"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "7b96e367b3bcff73ab93f7d87663e4673fe2a6dc", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/7b96e367b3bcff73ab93f7d87663e4673fe2a6dc", "committedDate": "2020-04-07T20:29:28Z", "message": "Polish client"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "a9d7a6185db9000ab3b06782a36e9bbc21ddfc94", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/a9d7a6185db9000ab3b06782a36e9bbc21ddfc94", "committedDate": "2020-04-07T21:19:17Z", "message": "Basic copy mechanism"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "5d1dd9e022abbb24241c0eed2bf68d469faed938", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/5d1dd9e022abbb24241c0eed2bf68d469faed938", "committedDate": "2020-04-07T21:37:07Z", "message": "Return all teams of destination exercise"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "be7c08778ef741ea88076c30baa8a5b790c58277", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/be7c08778ef741ea88076c30baa8a5b790c58277", "committedDate": "2020-04-08T09:56:02Z", "message": "Styling"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "d92e3c41b071c7f5ebfc6f0b24f426c984fcd5a3", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/d92e3c41b071c7f5ebfc6f0b24f426c984fcd5a3", "committedDate": "2020-04-08T15:55:55Z", "message": "Conflict handling in client"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "2520b7329087dcdbcee2c499a52ac78de80baa97", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/2520b7329087dcdbcee2c499a52ac78de80baa97", "committedDate": "2020-04-08T17:11:13Z", "message": "Delete confirmation modal"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "a969b8f54a1b254f63b183b4da2af08f6467af74", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/a969b8f54a1b254f63b183b4da2af08f6467af74", "committedDate": "2020-04-08T17:35:40Z", "message": "Finish client side for now"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "741642d39b1537da141091fb3de6587fc918a8bf", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/741642d39b1537da141091fb3de6587fc918a8bf", "committedDate": "2020-04-08T18:57:26Z", "message": "Team import server side"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "6f699c43a1039d9e145d5aaf05362e60724a927c", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/6f699c43a1039d9e145d5aaf05362e60724a927c", "committedDate": "2020-04-08T19:09:09Z", "message": "Adapt client to import strategy request body"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "ae22421afd654e4c66ccd579ef5184e9877533bb", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/ae22421afd654e4c66ccd579ef5184e9877533bb", "committedDate": "2020-04-08T19:19:07Z", "message": "Change dialog title"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "56f38dd045fdd56a5df008f151c5345f5143c105", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/56f38dd045fdd56a5df008f151c5345f5143c105", "committedDate": "2020-04-08T19:58:31Z", "message": "Pass over import strategy correctly"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "f6d9ae1b57d8e61deda3477802b8076fd2399a6b", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/f6d9ae1b57d8e61deda3477802b8076fd2399a6b", "committedDate": "2020-04-08T21:56:06Z", "message": "Database trigger that makes sure that no student is part of more than one team per exercise"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "2111f2a318d7070993c66615c8bd4d36b5e212c5", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/2111f2a318d7070993c66615c8bd4d36b5e212c5", "committedDate": "2020-04-08T23:41:06Z", "message": "Merge branch 'develop' into feature/import-teams-from-exercise"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "a481636ede4e6724a08b21a1c2c75736b0babf0c", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/a481636ede4e6724a08b21a1c2c75736b0babf0c", "committedDate": "2020-04-12T10:33:05Z", "message": "Merge branch 'develop' into feature/import-teams-from-exercise"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "d899fc8f166e76a1cb21a315404c12b6864c36d0", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/d899fc8f166e76a1cb21a315404c12b6864c36d0", "committedDate": "2020-04-12T12:31:51Z", "message": "Legend"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "17827f8c9d8a595222b0a2f5af4afe43882a304f", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/17827f8c9d8a595222b0a2f5af4afe43882a304f", "committedDate": "2020-04-12T13:19:23Z", "message": "Intro text"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "4d2af9feb2f04602cd33821c0721a78ec669e5c8", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/4d2af9feb2f04602cd33821c0721a78ec669e5c8", "committedDate": "2020-04-12T13:29:32Z", "message": "More explicit into text"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "8a7964950ac6283c22d10906a595589d3763762a", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/8a7964950ac6283c22d10906a595589d3763762a", "committedDate": "2020-04-12T13:47:24Z", "message": "Fix build"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "b50e883a14410bbb19a64c6cb34fd1b114724a3e", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/b50e883a14410bbb19a64c6cb34fd1b114724a3e", "committedDate": "2020-04-12T15:30:21Z", "message": "Add client docs"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "09f6626c20117500fe4b8055cc7bfe006eda31a0", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/09f6626c20117500fe4b8055cc7bfe006eda31a0", "committedDate": "2020-04-12T15:38:53Z", "message": "Add server docs"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "b4f28ddee8fe7c09629105fa4a216b5ac3ab6982", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/b4f28ddee8fe7c09629105fa4a216b5ac3ab6982", "committedDate": "2020-04-12T17:24:49Z", "message": "Integration Test"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "cee60404b9e205ecad1e91ddbc0a004c4baa61b4", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/cee60404b9e205ecad1e91ddbc0a004c4baa61b4", "committedDate": "2020-04-12T17:54:03Z", "message": "Integration Test"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "1812aed1a51f0201de584ef9c181515e6a532c63", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/1812aed1a51f0201de584ef9c181515e6a532c63", "committedDate": "2020-04-12T18:32:23Z", "message": "Merge branch 'develop' into feature/import-teams-from-exercise"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "224e776ff4b8e2036cb93d4d5992ac952957899a", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/224e776ff4b8e2036cb93d4d5992ac952957899a", "committedDate": "2020-04-12T18:46:08Z", "message": "Loading state display"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "613165595e779b0912fdd66804e1a8f19d97bd39", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/613165595e779b0912fdd66804e1a8f19d97bd39", "committedDate": "2020-04-12T19:32:39Z", "message": "Handling when there are no other team-based exercises in the course"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzkyMDMzNzgw", "url": "https://github.com/ls1intum/Artemis/pull/1302#pullrequestreview-392033780", "createdAt": "2020-04-13T08:55:30Z", "commit": {"oid": "613165595e779b0912fdd66804e1a8f19d97bd39"}, "state": "COMMENTED", "comments": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wNC0xM1QwODo1NTozMFrOGEg2tA==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wNC0xM1QwODo1NTozMFrOGEg2tA==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQwNzM4NTc4MA==", "bodyText": "It seems like you forgot a translation here:\n\n  \n    \n      \n        Suggested change\n        \n          \n    \n\n        \n      \n    \n    \n      \n          \n            \n                        \"importError\": \"Import failed. Please try again or contact an administrator for assistance.\"\n          \n          \n            \n                        \"importError\": \"Import fehlgeschlagen. Bitte versuche es nochmal oder kontaktiere einen Administrator für Hilfe.\"", "url": "https://github.com/ls1intum/Artemis/pull/1302#discussion_r407385780", "createdAt": "2020-04-13T08:55:30Z", "author": {"login": "filip-gregurevic"}, "path": "src/main/webapp/i18n/de/team.json", "diffHunk": "@@ -68,9 +71,78 @@\n                 \"label\": \"Löschen\",\n                 \"error\": \"Das Team konnte nicht entfernt werden. Bitte versuche es nochmal.\"\n             },\n-            \"errors\": {\n-                \"studentAlreadyAssignedToTeam\": \"Student mit Login {{ studentLogin }} ist bereits in Team mit Id {{ teamId }.\"\n-            }\n+            \"importTeams\": {\n+                \"buttonLabel\": \"Importiere Teams\",\n+                \"dialogTitle\": \"Importiere Teams nach:\",\n+                \"introText\": \"Dieser Dialog kann dazu verwendet werden, Teams einer anderen Übung in diese Übung hinein zu importieren.\",\n+                \"error\": \"Teams konnten nicht importiert werden. Bitte versuche es nochmal.\"\n+            },\n+            \"sourceExercise\": {\n+                \"label\": \"Quell-Übung\",\n+                \"tooltip\": \"Die Teams der ausgewählten Quell-Übung werden in diese Übung kopiert.\"\n+            },\n+            \"selectExerciseForImport\": \"Übung auswählen (nach Titel suchen)\",\n+            \"exerciseSearch\": {\n+                \"failed\": \"Suche fehlgeschlagen. Bitte nochmal versuchen.\",\n+                \"noResults\": \"Es gibt in diesem Kurs keine anderen Team-Übungen.\",\n+                \"noResultsForSearchTerm\": \"Es wurde keine andere Team-Übung im Kurs gefunden für die Suche:\"\n+            },\n+            \"sourceTeams\": {\n+                \"label\": \"Quell-Teams\",\n+                \"tooltip\": \"Diese Teams werden in die aktuelle Übung kopiert.\",\n+                \"legend\": {\n+                    \"label\": \"Legende\",\n+                    \"tooltip\": \"Die Legende zeigt die drei möglichen Konflikt-Zustände an, die ein Quell-Team haben kann.\",\n+                    \"teamShortName\": \"team\",\n+                    \"items\": {\n+                        \"conflictFreeTeam\": {\n+                            \"label\": \"Konfliktfreies Team\",\n+                            \"tooltip\": \"Dieses Team kann ohne Probleme importiert werden.\"\n+                        },\n+                        \"teamShortNameConflict\": {\n+                            \"label\": \"Team-Kurznamen Konflikt\",\n+                            \"tooltip\": \"Ein Team mit dem gleichen Kurznamen existiert bereits in dieser Übung.\"\n+                        },\n+                        \"studentConflict\": {\n+                            \"label\": \"Studenten Konflikt\",\n+                            \"tooltip\": \"Der rot markierte Student ist bereits in einem Team dieser Übung.\"\n+                        }\n+                    }\n+                }\n+            },\n+            \"loadSourceTeams\": {\n+                \"failed\": \"Teams konnten nicht geladen werden. Bitte versuche es nochmal.\"\n+            },\n+            \"noTeamsInSourceExercise\": \"Die Quell-Übung hat keine Teams.\",\n+            \"importStrategy\": {\n+                \"label\": \"Import-Strategie\",\n+                \"tooltip\": \"Die Import-Strategie bestimmt, welche Quell-Teams importiert werden und was mit den existierenden Teams in dieser Übung geschieht.\",\n+                \"options\": {\n+                    \"purgeExisting\": {\n+                        \"label\": \"Bestehende Teams löschen\",\n+                        \"badge\": \"kritisch\",\n+                        \"explanation\": \"Bevor alle Teams der Quell-Übung oben importiert werden, werden alle existierenden Teams dieser Übung inklusive ihrer Teilnahmen gelöscht.\"\n+                    },\n+                    \"createOnly\": {\n+                        \"label\": \"Nur Teams hinzufügen\",\n+                        \"badge\": \"sicher\",\n+                        \"explanation\": \"Nur konfliktfreie Quell-Teams (oben in grün angezeigt) werden importiert. Bereits bestehende Teams in dieser Übung werden nicht angefasst.\"\n+                    }\n+                }\n+            },\n+            \"importPreview\": {\n+                \"noTeamsToImport\": \"Keine Teams zum Importieren\",\n+                \"noConflictFreeTeamsToImport\": \"Keine konfliktfreien Teams zum Importieren\",\n+                \"teamsToBeDeleted\": \"Teams zum Löschen:\",\n+                \"teamsToBeImported\": \"Teams zum Importieren:\",\n+                \"outOf\": \"(von {{ number }})\",\n+                \"totalTeamsAfterImport\": \"Teams insgesamt nach Import:\"\n+            },\n+            \"purgeConfirmationDialog\": {\n+                \"question\": \"Sollen alle Teams der Übung <strong>{{ title }}</strong> und ihre Teilnahmen an der Aufgabe wirklich dauerhaft gelöscht werden? Diese Aktion kann NICHT rückgängig gemacht werden!\",\n+                \"typeNameToConfirm\": \"Bitte gib den Titel der Übung zur Bestätigung ein.\"\n+            },\n+            \"importError\": \"Import failed. Please try again or contact an administrator for assistance.\"", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "613165595e779b0912fdd66804e1a8f19d97bd39"}, "originalPosition": 88}]}}, {"__typename": "PullRequestCommit", "commit": {"oid": "1633447ba9bc81ec38772fb4d0b17841b62aeb86", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/1633447ba9bc81ec38772fb4d0b17841b62aeb86", "committedDate": "2020-04-13T09:32:47Z", "message": "Missing translation\n\nCo-Authored-By: Filip Gregurevic <51987021+filip-gregurevic@users.noreply.github.com>"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzkyMDY4NTU5", "url": "https://github.com/ls1intum/Artemis/pull/1302#pullrequestreview-392068559", "createdAt": "2020-04-13T10:20:26Z", "commit": {"oid": "1633447ba9bc81ec38772fb4d0b17841b62aeb86"}, "state": "DISMISSED", "comments": {"totalCount": 0, "pageInfo": {"startCursor": null, "endCursor": null, "hasNextPage": false, "hasPreviousPage": false}, "nodes": []}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzkyMTEwMTYx", "url": "https://github.com/ls1intum/Artemis/pull/1302#pullrequestreview-392110161", "createdAt": "2020-04-13T12:16:31Z", "commit": {"oid": "1633447ba9bc81ec38772fb4d0b17841b62aeb86"}, "state": "DISMISSED", "comments": {"totalCount": 0, "pageInfo": {"startCursor": null, "endCursor": null, "hasNextPage": false, "hasPreviousPage": false}, "nodes": []}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzkyMTQ0Mjkw", "url": "https://github.com/ls1intum/Artemis/pull/1302#pullrequestreview-392144290", "createdAt": "2020-04-13T13:30:30Z", "commit": {"oid": "1633447ba9bc81ec38772fb4d0b17841b62aeb86"}, "state": "DISMISSED", "comments": {"totalCount": 3, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wNC0xM1QxMzozMDozMVrOGEmh9w==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wNC0xM1QxMzo0NDowMlrOGEm4mg==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQwNzQ3ODc3NQ==", "bodyText": "Small typo\n\n  \n    \n      \n        Suggested change\n        \n          \n    \n\n        \n      \n    \n    \n      \n          \n            \n                 * Imports all team of the source exercise into the destination exercise\n          \n          \n            \n                 * Imports all teams of the source exercise into the destination exercise", "url": "https://github.com/ls1intum/Artemis/pull/1302#discussion_r407478775", "createdAt": "2020-04-13T13:30:31Z", "author": {"login": "sleiss"}, "path": "src/main/java/de/tum/in/www1/artemis/service/team/strategies/PurgeExistingStrategy.java", "diffHunk": "@@ -0,0 +1,42 @@\n+package de.tum.in.www1.artemis.service.team.strategies;\n+\n+import java.util.List;\n+\n+import de.tum.in.www1.artemis.domain.Exercise;\n+import de.tum.in.www1.artemis.domain.Team;\n+import de.tum.in.www1.artemis.repository.TeamRepository;\n+import de.tum.in.www1.artemis.service.ParticipationService;\n+import de.tum.in.www1.artemis.service.team.TeamImportStrategy;\n+\n+public class PurgeExistingStrategy extends TeamImportStrategy {\n+\n+    private final ParticipationService participationService;\n+\n+    public PurgeExistingStrategy(TeamRepository teamRepository, ParticipationService participationService) {\n+        super(teamRepository);\n+\n+        this.participationService = participationService;\n+    }\n+\n+    /**\n+     * Imports all team of the source exercise into the destination exercise", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "1633447ba9bc81ec38772fb4d0b17841b62aeb86"}, "originalPosition": 22}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQwNzQ3OTc3MQ==", "bodyText": "There is no check in place here, that the TA/Instructor is TA/Instructor of that given course, right?\nE.g.\n        if (!authCheckService.isAtLeastInstructorForExercise(destinationExercise, user)) {\n            return forbidden();\n        }", "url": "https://github.com/ls1intum/Artemis/pull/1302#discussion_r407479771", "createdAt": "2020-04-13T13:32:54Z", "author": {"login": "sleiss"}, "path": "src/main/java/de/tum/in/www1/artemis/web/rest/TeamResource.java", "diffHunk": "@@ -238,16 +239,17 @@ public TeamResource(TeamRepository teamRepository, TeamService teamService, Cour\n     }\n \n     /**\n-     * GET /teams?shortName={shortName} : get boolean flag whether team with shortName exists\n+     * GET /exercises/{exerciseId}/teams/exists?shortName={shortName} : get boolean flag whether team with shortName exists for exercise\n      *\n+     * @param exerciseId the id of the exercise for which to check teams\n      * @param shortName the shortName of the team to check for existence\n      * @return Response with status 200 (OK) and boolean flag in the body\n      */\n-    @GetMapping(\"/teams\") // this check is independent of the exercise (a team's shortName serves as a globally unique identifier)\n+    @GetMapping(\"/exercises/{exerciseId}/teams/exists\")\n     @PreAuthorize(\"hasAnyRole('TA', 'INSTRUCTOR', 'ADMIN')\")\n-    public ResponseEntity<Boolean> existsTeamByShortName(@RequestParam(\"shortName\") String shortName) {\n-        log.debug(\"REST request to check Team existence by shortName : {}\", shortName);\n-        return ResponseEntity.ok().body(teamRepository.findOneByShortName(shortName).isPresent());\n+    public ResponseEntity<Boolean> existsTeamByShortName(@PathVariable long exerciseId, @RequestParam(\"shortName\") String shortName) {", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "1633447ba9bc81ec38772fb4d0b17841b62aeb86"}, "originalPosition": 25}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQwNzQ4NDU3MA==", "bodyText": "I don't know if its necessary, but maybe we want to add that the source exercise has to be in the same course to prevent questions.", "url": "https://github.com/ls1intum/Artemis/pull/1302#discussion_r407484570", "createdAt": "2020-04-13T13:44:02Z", "author": {"login": "sleiss"}, "path": "src/main/webapp/i18n/en/team.json", "diffHunk": "@@ -68,9 +71,78 @@\n                 \"label\": \"Delete\",\n                 \"error\": \"Could not remove team. Please try again.\"\n             },\n-            \"errors\": {\n-                \"studentAlreadyAssignedToTeam\": \"Student with login {{ studentLogin }} is already assigned to team with id {{ teamId }.\"\n-            }\n+            \"importTeams\": {\n+                \"buttonLabel\": \"Import teams\",\n+                \"dialogTitle\": \"Import teams into:\",\n+                \"introText\": \"This dialog can be used to import teams from another exercise into this exercise.\",", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "1633447ba9bc81ec38772fb4d0b17841b62aeb86"}, "originalPosition": 20}]}}, {"__typename": "PullRequestCommit", "commit": {"oid": "fb6b7ff1a03e7c468a5d17f94364acf1d3247cb3", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/fb6b7ff1a03e7c468a5d17f94364acf1d3247cb3", "committedDate": "2020-04-13T15:03:36Z", "message": "Typo\n\nCo-Authored-By: Simon Leiß <5084100+sleiss@users.noreply.github.com>"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "a9d1338f3312b6715b3ab0b523559823d3ff45b0", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/a9d1338f3312b6715b3ab0b523559823d3ff45b0", "committedDate": "2020-04-13T15:15:50Z", "message": "Add auth check"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "1f57e9be5e1992f4607613e663e9296ac8fec0c9", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/1f57e9be5e1992f4607613e663e9296ac8fec0c9", "committedDate": "2020-04-13T15:18:21Z", "message": "Add \"of this course\""}}, {"__typename": "PullRequestCommit", "commit": {"oid": "eaa087bda9fdffe46da5f72a7e7c0c76f837df8d", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/eaa087bda9fdffe46da5f72a7e7c0c76f837df8d", "committedDate": "2020-04-13T15:54:17Z", "message": "Merge remote-tracking branch 'origin/develop' into feature/import-teams-from-exercise\n\n# Conflicts:\n#\tsrc/main/resources/config/liquibase/master.xml"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzkzMjQxNjE2", "url": "https://github.com/ls1intum/Artemis/pull/1302#pullrequestreview-393241616", "createdAt": "2020-04-14T19:45:28Z", "commit": {"oid": "eaa087bda9fdffe46da5f72a7e7c0c76f837df8d"}, "state": "DISMISSED", "comments": {"totalCount": 0, "pageInfo": {"startCursor": null, "endCursor": null, "hasNextPage": false, "hasPreviousPage": false}, "nodes": []}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzkzNjg1MjYy", "url": "https://github.com/ls1intum/Artemis/pull/1302#pullrequestreview-393685262", "createdAt": "2020-04-15T11:26:51Z", "commit": {"oid": "eaa087bda9fdffe46da5f72a7e7c0c76f837df8d"}, "state": "DISMISSED", "comments": {"totalCount": 0, "pageInfo": {"startCursor": null, "endCursor": null, "hasNextPage": false, "hasPreviousPage": false}, "nodes": []}}, {"__typename": "PullRequestCommit", "commit": {"oid": "2629a4d7300f9ec4647adee06445fbbc36ce1d30", "author": {"user": {"login": "madwau", "name": "Martin Wauligmann"}}, "url": "https://github.com/ls1intum/Artemis/commit/2629a4d7300f9ec4647adee06445fbbc36ce1d30", "committedDate": "2020-04-16T09:10:17Z", "message": "Merge remote-tracking branch 'origin/develop' into feature/import-teams-from-exercise\n\n# Conflicts:\n#\tsrc/main/webapp/app/exercises/shared/team/team.module.ts"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3Mzk0NTI5MDQy", "url": "https://github.com/ls1intum/Artemis/pull/1302#pullrequestreview-394529042", "createdAt": "2020-04-16T11:09:27Z", "commit": {"oid": "eaa087bda9fdffe46da5f72a7e7c0c76f837df8d"}, "state": "APPROVED", "comments": {"totalCount": 0, "pageInfo": {"startCursor": null, "endCursor": null, "hasNextPage": false, "hasPreviousPage": false}, "nodes": []}}]}}}, "rateLimit": {"limit": 5000, "remaining": 2891, "cost": 1, "resetAt": "2021-10-28T19:08:13Z"}}}