{"pr_number": 1862, "pr_title": "Added missing information to about this release page", "pr_createdAt": "2020-09-08T12:11:55Z", "pr_url": "https://github.com/wso2/docs-apim/pull/1862", "timeline": [{"oid": "a0a89bcfa975e2e576a6365a4a909959e6cbb39c", "url": "https://github.com/wso2/docs-apim/commit/a0a89bcfa975e2e576a6365a4a909959e6cbb39c", "message": "added missing information from the about this release page", "committedDate": "2020-09-08T12:10:34Z", "type": "commit"}, {"oid": "88aaf30ed9d391cca1681493564e0106e10b91c7", "url": "https://github.com/wso2/docs-apim/commit/88aaf30ed9d391cca1681493564e0106e10b91c7", "message": "Merge branch 'master' of https://github.com/wso2/docs-apim", "committedDate": "2020-09-08T12:11:11Z", "type": "commit"}, {"oid": "e4e959cc328311ee7e6e66cce9c19f46aed843eb", "url": "https://github.com/wso2/docs-apim/commit/e4e959cc328311ee7e6e66cce9c19f46aed843eb", "message": "Formatted", "committedDate": "2020-09-08T13:37:41Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ4NDg4NTU3Mg==", "url": "https://github.com/wso2/docs-apim/pull/1862#discussion_r484885572", "bodyText": "Operational users --> DevOps", "author": "jaadds", "createdAt": "2020-09-08T12:43:45Z", "path": "en/docs/getting-started/about-this-release.md", "diffHunk": "@@ -18,76 +25,81 @@ The **WSO2 API Manager 3.2.0** is the **latest** **WSO2 API Manager release*\n \n ### WSO2 API-M related new features\n \n-- **[API Traffic Manager]({{base_path}}/getting-started/overview/#traffic-manager)**\n-\n-     In addition to rate limiting, the Traffic Manager also works as an event hub for broadcasting controller events such as throttling events, block conditions, revoke token retrieval events, API events, API policy events, application events, application policy events, application keys events, subscription events, and subscription policy events.\n+- **[Multiple Third-party Key Manager support]({{base_path}}/administer/key-managers/overview/)**\n \n-- **[Third-party Key Manager support]({{base_path}}/administer/key-managers/overview/)**\n+    Until API Manager 3.1.0, the only possible way to extend the key management functionality was to configure WSO2 Identity Server. But with this new feature, WSO2 API Manager supports multiple third-party key managers such as Okta and Keycloak. This offers more flexibility when integrating with third-party identity management systems. All tokens and keys will be managed by the respective third-party key manager.\n \n-     WSO2 API Manager provides an admin functionality for admins or tenant admins to configure different authorization servers as Key Managers. This brings the capability of supporting multiple Key Managers for a given API.\n+- **[Inbuilt workflow support]({{base_path}}/learn/consume-api/manage-application/advanced-topics/adding-an-application-creation-workflow/)**\n \n-- **[Approval Workflow Executor to API Manager]({{base_path}}/learn/consume-api/manage-application/advanced-topics/adding-an-application-creation-workflow/)**\n+     API Manager 3.2.0 supports in-built workflow approvals. It is specifically designed to facilitate a simple approval/rejection process without integrating with a business process server. The Approval Workflow Executor can be enabled for application creation, subscription creation, application key generation, user self sign up, and API state change.\n \n-     The Approval Workflow Executor can be enabled for application creation, subscription creation, application key generation, user self sign up, and API state change.\n+- **[Test console for API Publisher]({{base_path}}/learn/design-api/create-api/test-a-rest-api/)**\n \n-- **[API Publisher Test Console]({{base_path}}/learn/design-api/create-api/test-a-rest-api/)**\n+     The new test Console in the API Publisher allows you to try out APIs from the API Publisher. API creators and publishers can verify functions and behaviors and fix issues  before publishing them to the Gateway and making it available for subscribers.\n \n-     The new Test Console in the API Publisher allows you to try out APIs from the Publisher itself and verify functions and behaviors before publishing them to the Gateway for subscribers.\n+- **[Query complexity analysis for GraphQL APIs]({{base_path}}/learn/rate-limiting/graphql-api/query-complexity-limitation/#adding-a-new-subscription-policy-with-graphql-max-complexity-value)**\n \n-- **[GraphQL query complexity analysis]({{base_path}}/learn/rate-limiting/graphql-api/query-complexity-limitation/#adding-a-new-subscription-policy-with-graphql-max-complexity-value)**\n+    WSO2 API Manager introduces the Static Query Analyser to which can be used to protect the backend endpoint from GraphQL queries that are more complex than a specified depth limit. Since GraphQL APIs offer the flexibility to fetch data using expensive queries, users might send requests with complex queries. Sometimes, this will create a significant workload for the backend and make it vulnerable to DOS attacks (in the worst case). With this feature, the API Manager server will analyze the complexity of the query before sending it to the backend and will make sure that the backend is safe from complex queries.\n \n-     You can request more data with increased flexibility using GraphQL queries. WSO2 API Manager introduces the Static Query Analyser to handle complex queries. \n+    \n \n-- **OAuth 2.0 endpoint security**\n+- **[Support for exposing OAuth 2.0 secure endpoints]({{base_path}}/learn/design-api/endpoints/endpoint-security/oauth-2.0/)**\n \n-     APIs created in WSO2 API Manager can directly access OAuth 2.0-protected endpoints without any extension to WSO2 API Manager.\n+     WSO2 API Manager 3.2.0 supports OAuth 2.0 Endpoint Security out-of-the-box. An API can be created to access a backend protected using OAuth 2.0 security standards. The required parameters can be specified via the UI.\n \n-- **Horizontal pod auto-scaling with custom-metrics in the K8s API-Operator**\n+- **Horizontal Pod Auto-Scaling with Custom-Metrics in the Kubernetes API-Operator**\n \n      You can now auto-scale backend or managed API horizontally based on custom metrics. For more information, see the [sample scenario (v1.2.0)](https://github.com/wso2/k8s-api-operator/tree/master/scenarios/scenario-20) with detailed configurations in the GitHub page of the K8s API-Operator.\n \n - **[Private Jet mode for Microgateways]({{base_path}}/learn/kubernetes-operators/k8s-api-operator/enabling-privatejet-mode-to-deploy-apis/)**\n \n-     WSO2 API Manager now provides cloud-native API management, where users can expose microservices as managed APIs in cloud environments with the support of the K8s API-Operator.\n+     WSO2 API Manager now provides cloud-native API management, where users can expose microservices as secure managed APIs in cloud environments with the support of the K8s API-Operator. \n \n - **[Gateway Runtime Artifact Synchronizer]({{base_path}}/install-and-setup/setup/distributed-deployment/synchronizing-artifacts-in-a-gateway-cluster/)**\n \n-     This feature allows you to sync nodes seamlessly in a Multi-Gateway setup using NFS with an extension point that can be configured to store these Synapse artifacts. \n+     This feature allows you to sync nodes seamlessly in a Multi-Gateway setup using NFS with an extension point that can be configured to store these Synapse artifacts in a pre-configured storage location. \n \n - **[Git integration support for API Controller]({{base_path}}/learn/api-controller/ci-cd-with-wso2-api-management/)**\n \n      From API Manager 3.2 onwards, the API Controller can operate on top of a Git repository and identify all the APIs/API Products and application projects that are committed to it. It provides a single command to detect and deploy all the projects to the given environment.\n \n - **Support for API products from API Controller**\n \n-     WSO2 API Manager enables users to utilize not only HTTP/REST endpoints but also HTTP/SOAP endpoints with endpoint routing policies such as load balancing and failover. In addition, this incorporates support for dynamic endpoints and AWS Lambda endpoints as well.\n+     The API Controller now supports handling API products in addition to APIs. With this new feature, a CI/CD pipeline can be implemented using API products (a package of APIs or selected resources from multiple APIs).\n+ \n+- **Support for Different Endpoint Types from API Controller**   \n+    The API controller supports a wide range of endpoint types in addition to HTTP/REST endpoints. This feature, gives the API controller the ability to not only support HTTP/SOAP endpoints but to also support load balancing, failover, dynamic endpoints, and AWS lambda endpoints.\n+   \n \n-- **API lifecycle status change support**\n+- **API Lifecycle Status Change Support from API Controller**\n \n      API lifecycle status change support in WSO2 API Controller 3.2 provides users the ability to modify the lifecycle status of an API easily without accessing the Publisher UI. \n \n-- **API/application delete support for controller**\n+- **API/Application delete support using the API Controller**\n \n-     WSO2 API Controller 3.2 provides the ability to delete an API/application using a single command, allowing users to easily remove an unwanted API or application in an environment without signing in to the Publisher or Developer Portal.\n+     WSO2 API Controller 3.2 provides the ability to delete an API/application using a single command, allowing users to easily remove an unwanted API or an application in an environment without signing in to the Publisher or Developer Portal.\n \n-- **[API key authentication support for API Operator]({{base_path}}/learn/api-security/api-authentication/secure-apis-using-api-keys/#api-key-restriction-for-ip-address-and-http-referer)**\n+- **[API Key Authentication support for API Operator]({{base_path}}/learn/api-security/api-authentication/secure-apis-using-api-keys/#api-key-restriction-for-ip-address-and-http-referer)**\n \n      API key authentication support in API Operator provides a simple authentication scheme that accepts a valid self-contained JWT token issued for accessing APIs.\n \n-- **[API key restriction for IP and referrer]({{base_path}}/learn/api-security/api-authentication/secure-apis-using-api-keys/#api-key-restriction-for-ip-address-and-http-referer)**\n+- **[APIKey Restriction for IP and Referrer]({{base_path}}/learn/api-security/api-authentication/secure-apis-using-api-keys/#api-key-restriction-for-ip-address-and-http-referer)**\n \n      Ability to define authorized parties when generating a token using an IP address restriction or a HTTP referer restriction.\n \n ### WSO2 API-M Analytics related new features\n \n-- **Monitoring Dashboard**\n+- **Monitoring dashboard for operational statistics**\n \n       Having an idea about the overall health status of APIs and services is essential for the proper functioning of an API-driven business. The Monitoring Dashboard helps to achieve this objective by showing contextual information on APIs such as latency, throughput, errors, and traffic volume. Operational and management users can use this dashboard to identify operational errors, narrow down the root cause, or to identify common traffic trends. The overview page provides a holistic view by aggregating different views on APIs, and by using the drill-downs user can get a detailed picture of different perspectives. ", "originalCommit": "88aaf30ed9d391cca1681493564e0106e10b91c7", "replyToReviewId": null, "replies": null, "type": "inlineReview"}]}