{"pr_number": 1296, "pr_title": "fix for https://github.com/wso2/docs-apim/issues/1229", "pr_createdAt": "2020-06-04T15:59:12Z", "pr_url": "https://github.com/wso2/docs-apim/pull/1296", "timeline": [{"oid": "4784462dc4635d331b006ee22e24b53cac85ed15", "url": "https://github.com/wso2/docs-apim/commit/4784462dc4635d331b006ee22e24b53cac85ed15", "message": "fix for https://github.com/wso2/docs-apim/issues/1229", "committedDate": "2020-06-04T15:53:13Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQzNTQxMzY3MA==", "url": "https://github.com/wso2/docs-apim/pull/1296#discussion_r435413670", "bodyText": "New react based UI's doesn't have Regenerate button.", "author": "TanyaM", "createdAt": "2020-06-04T17:06:01Z", "path": "en/docs/learn/consume-api/manage-application/sharing-applications/sharing-applications.md", "diffHunk": "@@ -1,8 +1,17 @@\n # Sharing Applications\n \n-WSO2 API Manager provides the facility for users to share their applications and subscriptions with a specific logical group/groups such as an organization. As a result of application sharing, users can view and modify applications and subscriptions belonging to other users in the same group or a different group.\n+WSO2 API Manager provides the facility for users to share their applications and subscriptions with a specific logical group or groups such as an organization. As a result of application sharing, users in the group can view such shared applications.\n \n-WSO2 API Manager considers the organization name you enter when signing up to the Developer Portal as the group ID. All the users that have the same organization name belong to the same group. Therefore, such users that belong to a single group can view each others' subscriptions and applications provided that you have [enabled group sharing](#enabling-application-sharing). WSO2 API Manager also provides the flexibility to change this default authentication implementation.\n+WSO2 API Manager considers the organization name you enter when signing up to the API Store as the group ID. All the users specifying the same organization name belong to the same group. Therefore, such users that belong to a single group can view each others' subscriptions and applications provided that you have [enabled group sharing](#enabling-application-sharing).\n+\n+Only the application owner is capable of editing and deleting the application in the shared group.\n+\n+!!! Note\n+    If there is a requirement to edit or delete an application using a different user (for example, due to a reason such as where the application owner has already left the organization etc.), you can achieve this by [transferring the ownership of the application to that user who will be the new application owner]({{base_path}}/learn/consume-api/manage-application/advanced-topics/changing-the-owner-of-an-application/).\n+\n+Furthermore, only the application owner is allowed to generate keys for a specific shared application. However, the shared users can generate access tokens; therefore, the shared users will see the **Regenerate** button which is used to regenerate the access tokens, but not the **Application** Keys button.", "originalCommit": "4784462dc4635d331b006ee22e24b53cac85ed15", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQzNjYzMjIyNA==", "url": "https://github.com/wso2/docs-apim/pull/1296#discussion_r436632224", "bodyText": "Updated in 60b18be", "author": "Mariangela", "createdAt": "2020-06-08T11:39:37Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQzNTQxMzY3MA=="}], "type": "inlineReview"}, {"oid": "60b18be547ae2fb692ed5af180237b347e402f1e", "url": "https://github.com/wso2/docs-apim/commit/60b18be547ae2fb692ed5af180237b347e402f1e", "message": "Updated based on review comments", "committedDate": "2020-06-08T11:33:32Z", "type": "commit"}]}