{"pr_number": 2151, "pr_title": "Include dashboard access information to doc", "pr_createdAt": "2020-10-27T17:26:55Z", "pr_url": "https://github.com/wso2/docs-apim/pull/2151", "timeline": [{"oid": "76374a2706b0d1448b333eb8cd6e63b5ed7b3df5", "url": "https://github.com/wso2/docs-apim/commit/76374a2706b0d1448b333eb8cd6e63b5ed7b3df5", "message": "Include dashboard access information to doc", "committedDate": "2020-10-27T17:25:27Z", "type": "commit"}, {"oid": "65b735c06af6da872f3332080e54eb9d85e8dee2", "url": "https://github.com/wso2/docs-apim/commit/65b735c06af6da872f3332080e54eb9d85e8dee2", "message": "Reviewed and updated full doc", "committedDate": "2020-10-27T19:04:45Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMzEyOTEzMQ==", "url": "https://github.com/wso2/docs-apim/pull/2151#discussion_r513129131", "bodyText": "This needs to be changed as \"Reports\"", "author": "TanyaM", "createdAt": "2020-10-28T01:39:47Z", "path": "en/docs/learn/analytics/overview-of-api-analytics.md", "diffHunk": "@@ -1,20 +1,217 @@\n # Overview of API Analytics\n \n-APIs are widely used in Business Integrations and are becoming a key part of driving an Organization's Business strategy. Ensuring the proper functioning of the APIs, getting feedback on the performance and deriving business insights from APIs are becoming equally important. WSO2 API Manager Analytics does this by integrating with WSO2 API Manager to provide statistics, reports, and graphs on the APIs deployed in WSO2 API Manager. It further allows configuring Alerts to notify about unusual behaviours and error conditions in near real-time.\n+APIs are widely used in Business Integrations and are becoming a key part of driving an Organization's Business strategy. Ensuring the proper functioning of the APIs, getting feedback on the performance and deriving business insights from APIs are becoming equally important. WSO2 API Manager Analytics does this by integrating with WSO2 API Manager to provide statistics, reports, and graphs on the APIs deployed in WSO2 API Manager. It further allows configuring Alerts to notify about unusual behaviors and error conditions in near real-time.\n \n-In order to make the data easily available, WSO2 API Manager Analytics offers different Dashboards that show different views of the APIs to different user groups. Application Developers, API Publishers, DevOps and Program Managers can use these Dashboards to learn about different perspectives of the underlying API ecosystem. The following image shows the default Dashboards available in WSO2 API Manager Analytics.\n+In order to make the data easily available, WSO2 API Manager Analytics offers different Dashboards that show different views of the APIs to different user groups. Application Developers, API Publishers, DevOps, and Program Managers can use these Dashboards to learn about different perspectives of the underlying API ecosystem.\n \n-[![APIM Analytics dashboard dropdown]({{base_path}}/assets/img/learn/analytics-dashboard-listing.png)]({{base_path}}/assets/img/learn/analytics-dashboard-listing.png)\n+## Accessing the statistical dashboards\n \n-**Business Analytics** - Provides long-term historical trends about API Latency, Traffic Volume, Errors, and other statistics like most used APIs, API Subscribing frequency, and Developer Sign-Ups over time that shows different aspects of the API adoption. This is targeted for Program Managers who need to see a holistic view of the APIs, Developers, and Application and shows data about all APIs without any restriction. The internal/analytics role is needed to view this Dashboard.\n+Follow the instructions below to access the statistical dashboards.\n \n-**Application Analytics** - Provided for Application Developers to view the statistics related to their Applications. A user needs to have the internal/subscriber role to view this Dashboard. Please note that what’s shown in the Dashboard are statistics for Apps created by the viewer assuming a Developer role. This includes registered application users, top application users, API usage of an application, etc.\n+!!! info\n+    For instructions on how to set up Analytics, see [Configuring APIM Analytics]({{base_path}}/learn/analytics/configuring-apim-analytics)\n \n-**API Analytics** - Provided for the API creators to view the statistics related to their APIs. This provides the ability to compare and contrast the usage of different APIs created by the logged-in user. Further provides the performance and fault statistics of individual APIs. When an API is restricted to a Publisher it wouldn’t appear under this Dashboard. The internal/publisher role is needed to view this Dashboard.\n+1. Sign in to the Analytics Dashboard.\n \n-**Monitoring** - Provides a short-term historical view about Latency, Traffic Volume, and Errors of APIs with drill-downs to narrow down errors and isolate the cause of the issues. This dashboard is targeted for DevOps and SysAdmins who overlook the health and availability aspects of the APIs. Currently, the internal/analytics role is needed to view this Dashboard. But a different role can be assigned by editing role mappings as described in [Managing Analytics Dashboard Permissions]({{base_path}}/learn/analytics/managing-dashboard-permissions)\n+     `<protocol>://<host>:<port>/analytics-dashboard`\n \n-**Reports** - This can be used to accomplish the API monetization use cases. Currently, this is restricted to users with admin role only. Users can download a PDF report of the API usage statistics for the selected month. Later this report can be used for billing purposes. You can customize the format and structure of this Dashboard as described in [Monthly API Usage Report]({{base_path}}/learn/analytics/monthly-api-usage-report/#customizing-the-report)\n+     Example: \n+     \n+     [https://localhost:9643/analytics-dashboard](https://localhost:9643/analytics-dashboard)\n+     \n+     After you sign in, you will see the following dashboards listed.\n+     <ul>\n+     <li> <a href=\"#business-analytics-dashboard\">Business Analytics</a></li>\n+     <li><a href=\"#application-analytics-dashboard\">Application Analytics</a></li>\n+     <li> <a href=\"#api-analytics-dashboard\">API Analytics</a></li>\n+     <li> <a href=\"#monitoring-dashboard\">Monitoring</a></li>\n+     <li> <a href=\"#monthly-api-usage-report\">API-M Admin</a> </li>", "originalCommit": "65b735c06af6da872f3332080e54eb9d85e8dee2", "replyToReviewId": null, "replies": null, "type": "inlineReview"}]}