{"pr_number": 7362, "pr_title": "restrict builtin-users API endpoint by default", "pr_createdAt": "2020-10-27T19:37:52Z", "pr_url": "https://github.com/IQSS/dataverse/pull/7362", "timeline": [{"oid": "44b73e0e288a1bc018ce08bcc7ca81c25fbb7201", "url": "https://github.com/IQSS/dataverse/commit/44b73e0e288a1bc018ce08bcc7ca81c25fbb7201", "message": "restrict builtin-users API endpoint by default", "committedDate": "2020-10-27T19:32:27Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMjk4Njk5Mw==", "url": "https://github.com/IQSS/dataverse/pull/7362#discussion_r512986993", "bodyText": "Sigh. I guess this is true: \"Documentation for the \"admin\" endpoint is spread across...\"", "author": "pdurbin", "createdAt": "2020-10-27T19:50:48Z", "path": "doc/sphinx-guides/source/installation/config.rst", "diffHunk": "@@ -26,11 +26,11 @@ The default password for the \"dataverseAdmin\" superuser account is \"admin\", as m\n Blocking API Endpoints\n ++++++++++++++++++++++\n \n-The :doc:`/api/native-api` contains a useful but potentially dangerous API endpoint called \"admin\" that allows you to change system settings, make ordinary users into superusers, and more. The \"builtin-users\" endpoint lets people create a local/builtin user account if they know the key defined in :ref:`BuiltinUsers.KEY`. The endpoint \"test\" is not used but is where testing code maybe be added (see https://github.com/IQSS/dataverse/issues/4137 ).\n+The :doc:`/api/native-api` contains a useful but potentially dangerous API endpoint called \"admin\" that allows you to change system settings, make ordinary users into superusers, and more. The \"builtin-users\" endpoint lets admins create a local/builtin user account if they know the key defined in :ref:`BuiltinUsers.KEY`.\n \n-By default, most APIs can be operated on remotely and a number of endpoints do not require authentication. The endpoints \"admin\" and \"test\" are limited to localhost out of the box by the settings :ref:`:BlockedApiEndpoints` and :ref:`:BlockedApiPolicy`.\n+By default, most APIs can be operated on remotely and a number of endpoints do not require authentication. The endpoints \"admin\" and \"builtin-users\" are limited to localhost out of the box by the settings :ref:`:BlockedApiEndpoints` and :ref:`:BlockedApiPolicy`.\n \n-It is very important to keep the block in place for the \"admin\" endpoint (and at least consider blocking \"builtin-users\"). Please note that documentation for the \"admin\" endpoint is spread across the :doc:`/api/native-api` section of the API Guide and the :doc:`/admin/index`.\n+It is very important to keep the block in place for the \"admin\" endpoint, and to leave the \"builtin-users\" endpoint blocked unless you need to access it remotely. Documentation for the \"admin\" endpoint is spread across the :doc:`/api/native-api` section of the API Guide and the :doc:`/admin/index`.", "originalCommit": "44b73e0e288a1bc018ce08bcc7ca81c25fbb7201", "replyToReviewId": null, "replies": null, "type": "inlineReview"}]}