{"data": {"repository": {"pullRequest": {"id": "MDExOlB1bGxSZXF1ZXN0MzgwMzU0Nzc2", "number": 52828, "title": "EQL: Hook engine to Elasticsearch", "bodyText": "Add query execution and return actual results returned from\nElasticsearch inside the tests", "createdAt": "2020-02-26T15:39:07Z", "url": "https://github.com/elastic/elasticsearch/pull/52828", "merged": true, "mergeCommit": {"oid": "3e039282bf991af87604a6d4f8eada19d5e33842"}, "closed": true, "closedAt": "2020-02-27T09:16:27Z", "author": {"login": "costin"}, "timelineItems": {"totalCount": 10, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpPPAAABcIIX0aAH2gAyMzgwMzU0Nzc2OjgyN2NmMTM3MWQyYWFmZDJlYzc2ZmJhZGYwYjM3ZjU2ZTAxMDIxZTA=", "endCursor": "Y3Vyc29yOnYyOpPPAAABcIXubIAH2gAyMzgwMzU0Nzc2OjhlMzU0MDQzNDc3YWFiMTg2ODEwOWY4NjZiNDMwYTVmNWFiOTljNWY=", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"__typename": "PullRequestCommit", "commit": {"oid": "827cf1371d2aafd2ec76fbadf0b37f56e01021e0", "author": {"user": {"login": "costin", "name": "Costin Leau"}}, "url": "https://github.com/elastic/elasticsearch/commit/827cf1371d2aafd2ec76fbadf0b37f56e01021e0", "committedDate": "2020-02-26T15:22:44Z", "message": "EQL: Hook engine to Elasticsearch\n\nAdd query execution and return actual results returned from\nElasticsearch inside the tests"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "e96f91ab4b54e46a760332b3dcf9c20600ceb5e5", "author": {"user": {"login": "costin", "name": "Costin Leau"}}, "url": "https://github.com/elastic/elasticsearch/commit/e96f91ab4b54e46a760332b3dcf9c20600ceb5e5", "committedDate": "2020-02-26T16:11:04Z", "message": "Update EQL doc sample"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzY1MDQ4MzQ4", "url": "https://github.com/elastic/elasticsearch/pull/52828#pullrequestreview-365048348", "createdAt": "2020-02-26T16:26:56Z", "commit": {"oid": "827cf1371d2aafd2ec76fbadf0b37f56e01021e0"}, "state": "APPROVED", "comments": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMi0yNlQxNjoyNjo1NlrOFuyq7A==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMi0yNlQxNjoyNjo1NlrOFuyq7A==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NDYwOTAwNA==", "bodyText": "nit: can remove the comment above", "url": "https://github.com/elastic/elasticsearch/pull/52828#discussion_r384609004", "createdAt": "2020-02-26T16:26:56Z", "author": {"login": "aleksmaus"}, "path": "x-pack/plugin/eql/src/main/java/org/elasticsearch/xpack/eql/plugin/TransportEqlSearchAction.java", "diffHunk": "@@ -68,23 +66,17 @@ public static void operation(PlanExecutor planExecutor, EqlSearchRequest request\n             .fieldTimestamp(request.timestampField())\n             .implicitJoinKey(request.implicitJoinKeyField());\n \n-        Configuration cfg = new Configuration(request.indices(), zoneId, username, clusterName, filter, timeout, includeFrozen, clientId);\n-        //planExecutor.eql(cfg, request.rule(), params, wrap(r -> listener.onResponse(createResponse(r)), listener::onFailure));\n-        listener.onResponse(createResponse(null));\n+        Configuration cfg = new Configuration(request.indices(), zoneId, username, clusterName, filter, timeout, request.fetchSize(),\n+                includeFrozen, clientId);\n+        planExecutor.eql(cfg, request.rule(), params, wrap(r -> listener.onResponse(createResponse(r)), listener::onFailure));\n     }\n \n     static EqlSearchResponse createResponse(Results results) {\n-        // Stubbed search response\n-        // TODO: implement actual search response processing once the parser/executor is in place\n         // Updated for stubbed response to: process where serial_event_id = 1", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "827cf1371d2aafd2ec76fbadf0b37f56e01021e0"}, "originalPosition": 42}]}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzY1MDg5NjM1", "url": "https://github.com/elastic/elasticsearch/pull/52828#pullrequestreview-365089635", "createdAt": "2020-02-26T17:18:05Z", "commit": {"oid": "e96f91ab4b54e46a760332b3dcf9c20600ceb5e5"}, "state": "COMMENTED", "comments": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMi0yNlQxNzoxODowNVrOFu0r9A==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMi0yNlQxNzoxODowNVrOFu0r9A==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NDY0MjAzNg==", "bodyText": "Github wont' let me comment on the snippet above, but it should be updated to something like:\n[source,console]\n----\nGET sec_logs/_eql/search\n{\n \"event_type_field\": \"event.category\",\n \"rule\": \"\"\"\n    process where process.name == \"cmd.exe\"\n  \"\"\"\n}\n----\n\nI would leave event.category as the event_type_field as it conforms to ECS.", "url": "https://github.com/elastic/elasticsearch/pull/52828#discussion_r384642036", "createdAt": "2020-02-26T17:18:05Z", "author": {"login": "jrodewig"}, "path": "docs/reference/eql/search.asciidoc", "diffHunk": "@@ -42,5 +42,5 @@ GET sec_logs/_eql/search\n // TEST[continued]", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "e96f91ab4b54e46a760332b3dcf9c20600ceb5e5"}, "originalPosition": 24}]}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzY1MDkwMDE1", "url": "https://github.com/elastic/elasticsearch/pull/52828#pullrequestreview-365090015", "createdAt": "2020-02-26T17:18:39Z", "commit": {"oid": "e96f91ab4b54e46a760332b3dcf9c20600ceb5e5"}, "state": "COMMENTED", "comments": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMi0yNlQxNzoxODo0MFrOFu0tNA==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMi0yNlQxNzoxODo0MFrOFu0tNA==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NDY0MjM1Ng==", "bodyText": "I would leave this as-is and just update the EQL search snippet below.", "url": "https://github.com/elastic/elasticsearch/pull/52828#discussion_r384642356", "createdAt": "2020-02-26T17:18:40Z", "author": {"login": "jrodewig"}, "path": "docs/reference/eql/search.asciidoc", "diffHunk": "@@ -17,18 +17,18 @@ The following <<docs-bulk,bulk API>> request adds some example log data to the\n ----\n PUT sec_logs/_bulk?refresh\n {\"index\":{\"_index\" : \"sec_logs\"}}\n-{ \"@timestamp\": \"2020-12-07T11:06:07.000Z\", \"agent\": { \"id\": \"8a4f500d\" }, \"event\": { \"category\": \"process\" }, \"process\": { \"name\": \"cmd.exe\", \"path\": \"C:\\\\Windows\\\\System32\\\\cmd.exe\" } }\n+{ \"@timestamp\": \"2020-12-07T11:06:07.000Z\", \"agent\": { \"id\": \"8a4f500d\" }, \"event_type\": \"process\" , \"process\": { \"name\": \"cmd.exe\", \"path\": \"C:\\\\Windows\\\\System32\\\\cmd.exe\" } }\n {\"index\":{\"_index\" : \"sec_logs\"}}\n-{ \"@timestamp\": \"2020-12-07T11:07:08.000Z\", \"agent\": { \"id\": \"8a4f500d\" }, \"event\": { \"category\": \"image_load\" }, \"file\": { \"name\": \"cmd.exe\", \"path\": \"C:\\\\Windows\\\\System32\\\\cmd.exe\" }, \"process\": { \"name\": \"cmd.exe\", \"path\": \"C:\\\\Windows\\\\System32\\\\cmd.exe\" } }\n+{ \"@timestamp\": \"2020-12-07T11:07:08.000Z\", \"agent\": { \"id\": \"8a4f500d\" }, \"event_type\": \"image_load\" , \"file\": { \"name\": \"cmd.exe\", \"path\": \"C:\\\\Windows\\\\System32\\\\cmd.exe\" }, \"process\": { \"name\": \"cmd.exe\", \"path\": \"C:\\\\Windows\\\\System32\\\\cmd.exe\" } }\n {\"index\":{\"_index\" : \"sec_logs\"}}\n-{ \"@timestamp\": \"2020-12-07T11:07:09.000Z\", \"agent\": { \"id\": \"8a4f500d\" }, \"event\": { \"category\": \"process\" }, \"process\": { \"name\": \"regsvr32.exe\", \"path\": \"C:\\\\Windows\\\\System32\\\\regsvr32.exe\" } }\n+{ \"@timestamp\": \"2020-12-07T11:07:09.000Z\", \"agent\": { \"id\": \"8a4f500d\" }, \"event_type\": \"process\" , \"process\": { \"name\": \"regsvr32.exe\", \"path\": \"C:\\\\Windows\\\\System32\\\\regsvr32.exe\" } }", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "e96f91ab4b54e46a760332b3dcf9c20600ceb5e5"}, "originalPosition": 11}]}}, {"__typename": "PullRequestCommit", "commit": {"oid": "478437b36bd5a80b99afdddb2263465b1f033236", "author": {"user": {"login": "costin", "name": "Costin Leau"}}, "url": "https://github.com/elastic/elasticsearch/commit/478437b36bd5a80b99afdddb2263465b1f033236", "committedDate": "2020-02-26T17:30:14Z", "message": "Adjust EQL rest client test"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "587a80ae866c5fffba88f3d862230d1f149d7296", "author": {"user": {"login": "costin", "name": "Costin Leau"}}, "url": "https://github.com/elastic/elasticsearch/commit/587a80ae866c5fffba88f3d862230d1f149d7296", "committedDate": "2020-02-26T17:35:53Z", "message": "Update docs"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzY1MTE1ODU3", "url": "https://github.com/elastic/elasticsearch/pull/52828#pullrequestreview-365115857", "createdAt": "2020-02-26T17:55:48Z", "commit": {"oid": "587a80ae866c5fffba88f3d862230d1f149d7296"}, "state": "APPROVED", "comments": {"totalCount": 0, "pageInfo": {"startCursor": null, "endCursor": null, "hasNextPage": false, "hasPreviousPage": false}, "nodes": []}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzY1MjQwNjA1", "url": "https://github.com/elastic/elasticsearch/pull/52828#pullrequestreview-365240605", "createdAt": "2020-02-26T21:04:41Z", "commit": {"oid": "587a80ae866c5fffba88f3d862230d1f149d7296"}, "state": "APPROVED", "comments": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMi0yNlQyMTowNDo0MVrOFu8Juw==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMi0yNlQyMTowNDo0MVrOFu8Juw==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NDc2NDM0Nw==", "bodyText": "Is time the amount of time it took to return the results (judging by the execTime() method) ? If so, wouldn't be more descriptive to have this named took or duration or execTime?", "url": "https://github.com/elastic/elasticsearch/pull/52828#discussion_r384764347", "createdAt": "2020-02-26T21:04:41Z", "author": {"login": "astefan"}, "path": "x-pack/plugin/eql/src/main/java/org/elasticsearch/xpack/eql/session/Results.java", "diffHunk": "@@ -8,28 +8,76 @@\n \n import org.apache.lucene.search.TotalHits;\n import org.apache.lucene.search.TotalHits.Relation;\n+import org.elasticsearch.common.unit.TimeValue;\n+import org.elasticsearch.search.SearchHit;\n+import org.elasticsearch.xpack.eql.action.EqlSearchResponse.Count;\n+import org.elasticsearch.xpack.eql.action.EqlSearchResponse.Sequence;\n \n import java.util.List;\n \n import static java.util.Collections.emptyList;\n \n public class Results {\n \n-    public static final Results EMPTY = new Results(new TotalHits(0, Relation.EQUAL_TO), emptyList());\n+    private enum Type {\n+        SEARCH_HIT,\n+        SEQUENCE,\n+        COUNT;\n+    }\n+    \n+    public static final Results EMPTY = new Results(new TotalHits(0, Relation.EQUAL_TO), TimeValue.MINUS_ONE, false, emptyList());\n \n     private final TotalHits totalHits;\n-    private final List<Object> results;\n+    private final List<?> results;\n+    private final boolean timedOut;\n+    private final TimeValue time;", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "587a80ae866c5fffba88f3d862230d1f149d7296"}, "originalPosition": 28}]}}, {"__typename": "PullRequestCommit", "commit": {"oid": "8e354043477aab1868109f866b430a5f5ab99c5f", "author": {"user": {"login": "costin", "name": "Costin Leau"}}, "url": "https://github.com/elastic/elasticsearch/commit/8e354043477aab1868109f866b430a5f5ab99c5f", "committedDate": "2020-02-27T09:16:00Z", "message": "Minor renaming"}}]}}}, "rateLimit": {"limit": 5000, "remaining": 1975, "cost": 1, "resetAt": "2021-10-28T18:54:27Z"}}}