{"data": {"repository": {"pullRequest": {"id": "MDExOlB1bGxSZXF1ZXN0MzkxNTI3NDc4", "number": 53867, "title": "[DOCS] EQL: Document `substring` function", "bodyText": "Adds documentation for the EQL substring function.\nSupporting changes:\n\nCreates a new \"EQL function reference\" page\nUpdates the title of the \"EQL syntax reference\" page for consistency\nAdds a brief \"Functions\" section to the EQL syntax docs\nUpdates EQL limitations docs to state that only array functions are\nunsupported", "createdAt": "2020-03-20T13:19:04Z", "url": "https://github.com/elastic/elasticsearch/pull/53867", "merged": true, "mergeCommit": {"oid": "f91d8ee3e7886886be6bca69741629d672b3ddb2"}, "closed": true, "closedAt": "2020-03-25T16:07:21Z", "author": {"login": "jrodewig"}, "timelineItems": {"totalCount": 11, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpPPAAABcPgBbUAH2gAyMzkxNTI3NDc4OjQ5YmNlMzNjM2RkZmYyNmYwZjQ4MDI3MTRiMmZhMDU3MTYwODU5ZmQ=", "endCursor": "Y3Vyc29yOnYyOpPPAAABcRJgEVAH2gAyMzkxNTI3NDc4OjExNTUyNzJiNjBhNjA1NzlmYTFjODViMmU0ZTNkZjc5NGZiYTZhNzk=", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"__typename": "PullRequestCommit", "commit": {"oid": "49bce33c3ddff26f0f4802714b2fa057160859fd", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/49bce33c3ddff26f0f4802714b2fa057160859fd", "committedDate": "2020-03-20T12:53:28Z", "message": "[DOCS] Document EQL `substring` function\n\nAdds documentation for the EQL `substring` function.\n\nSupporting changes:\n\n* Creates a new \"EQL function reference\" page\n* Updates the title of the \"EQL syntax reference\" page for consistency\n* Adds a brief \"Functions\" section to the EQL syntax docs\n* Updates EQL limitations docs to state that only array functions are\n  unsupported"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3Mzc4NDg5NTYz", "url": "https://github.com/elastic/elasticsearch/pull/53867#pullrequestreview-378489563", "createdAt": "2020-03-20T13:39:21Z", "commit": {"oid": "49bce33c3ddff26f0f4802714b2fa057160859fd"}, "state": "COMMENTED", "comments": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yMFQxMzozOToyMVrOF5UDSg==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yMFQxMzozOToyMVrOF5UDSg==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM5NTY0MTY3NA==", "bodyText": "@costin\nThese examples are a modified version of those from the original EQL substring docs.\nHowever, they're not all working as expected in ES.\nI included my testing approach below. Let me know if this behavior is expected. If so, I can update the docs.\nIndex setup\nMap process.name as a keyword field so it doesn't get analyzed.\nPUT my_index\n{\n  \"mappings\": {\n    \"properties\": {\n      \"process\": {\n        \"properties\": {\n          \"name\": {\n            \"type\": \"keyword\"\n          }\n        }\n      }\n    }\n  }\n}\n\nIndex a doc containing quick brown fox in the process.name field.\nPUT my_index/_doc/1\n{\n  \"@timestamp\": \"2020-12-06T11:04:05.000Z\",\n  \"event\": {\n    \"category\": \"process\"\n  },\n  \"process\": {\n    \"name\": \"quick brown fox\"\n  }\n}\n\nStarting position of 0 returns results\nA starting position of 0 returns results as expected.\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, 0, 5) == \"quick\"\n  \"\"\"\n}\n\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, 0, 7) == \"quick b\"\n  \"\"\"\n}\n\nResponse:\n{\n  \"took\" : 2,\n  \"timed_out\" : false,\n  \"hits\" : {\n    \"total\" : {\n      \"value\" : 1,\n      \"relation\" : \"eq\"\n    },\n    \"events\" : [\n      {\n        \"_index\" : \"my_index\",\n        \"_id\" : \"1\",\n        \"_score\" : null,\n        \"_source\" : {\n          \"@timestamp\" : \"2020-12-06T11:04:05.000Z\",\n          \"event\" : {\n            \"category\" : \"process\"\n          },\n          \"process\" : {\n            \"name\" : \"quick brown fox\"\n          }\n        },\n        \"sort\" : [\n          1607252645000\n        ]\n      }\n    ]\n  }\n}\n\nNon-zero, positive offsets return no results\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, 6, 11) == \"brown\"\n  \"\"\"\n}\n\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, 6) == \"b\"\n  \"\"\"\n}\n\nResponse:\n{\n  \"took\" : 1,\n  \"timed_out\" : false,\n  \"hits\" : {\n    \"total\" : {\n      \"value\" : 0,\n      \"relation\" : \"eq\"\n    },\n    \"events\" : [ ]\n  }\n}\n\nA negative starting position with no end position returns no results\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, -3) == \"f\"\n  \"\"\"\n}\n\nResponse:\n{\n  \"took\" : 1,\n  \"timed_out\" : false,\n  \"hits\" : {\n    \"total\" : {\n      \"value\" : 0,\n      \"relation\" : \"eq\"\n    },\n    \"events\" : [ ]\n  }\n}\n\nA negative end position returns an error\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, -3, -1) == \"fo\"\n  \"\"\"\n}\n\nError:\n{\n  \"error\" : {\n    \"root_cause\" : [\n      {\n        \"type\" : \"sql_illegal_argument_exception\",\n        \"reason\" : \"A positive number is required for [length]; received [-1]\"\n      }\n    ],\n    \"type\" : \"search_phase_execution_exception\",\n    \"reason\" : \"all shards failed\",\n    \"phase\" : \"query\",\n    \"grouped\" : true,\n    \"failed_shards\" : [\n      {\n        \"shard\" : 0,\n        \"index\" : \"my_index\",\n        \"node\" : \"UYH0jOvXSN-ot5Vu6ml-_w\",\n        \"reason\" : {\n          \"type\" : \"script_exception\",\n          \"reason\" : \"runtime error\",\n          \"script_stack\" : [\n            \"org.elasticsearch.xpack.sql.expression.function.scalar.string.SubstringFunctionProcessor.doProcess(SubstringFunctionProcessor.java:63)\",\n            \"org.elasticsearch.xpack.sql.expression.function.scalar.whitelist.InternalSqlScriptUtils.substring(InternalSqlScriptUtils.java:418)\",\n            \"InternalSqlScriptUtils.nullSafeFilter(InternalSqlScriptUtils.eq(InternalSqlScriptUtils.substring(InternalSqlScriptUtils.docValue(doc,params.v0),params.v1,params.v2),params.v3))\",\n            \"                                                                                                                                                                ^---- HERE\"\n          ],\n          \"script\" : \"InternalSqlScriptUtils.nullSafeFilter(InternalSqlScriptUtils.eq(InternalSqlScriptUtils.substring(InternalSqlScriptUtils.docValue(doc,params.v0),params.v1,params.v2),params.v3))\",\n          \"lang\" : \"painless\",\n          \"position\" : {\n            \"offset\" : 160,\n            \"start\" : 0,\n            \"end\" : 176\n          },\n          \"caused_by\" : {\n            \"type\" : \"sql_illegal_argument_exception\",\n            \"reason\" : \"A positive number is required for [length]; received [-1]\"\n          }\n        }\n      }\n    ],\n    \"caused_by\" : {\n      \"type\" : \"sql_illegal_argument_exception\",\n      \"reason\" : \"A positive number is required for [length]; received [-1]\"\n    }\n  },\n  \"status\" : 400\n}", "url": "https://github.com/elastic/elasticsearch/pull/53867#discussion_r395641674", "createdAt": "2020-03-20T13:39:21Z", "author": {"login": "jrodewig"}, "path": "docs/reference/eql/functions.asciidoc", "diffHunk": "@@ -0,0 +1,60 @@\n+[[eql-function-ref]]\n+== EQL function reference\n+++++\n+<titleabbrev>Function reference</titleabbrev>\n+++++\n+\n+experimental::[]\n+\n+{es} supports the following EQL functions:\n+\n+* <<eql-substring-fn>>\n+\n+[discrete]\n+[[eql-substring-fn]]\n+=== `substring`\n+Extracts a substring from a source string at provided start and end positions.\n+\n+If no end position is provided, the function extracts only the character in the\n+start position.\n+\n+[%collapsible]\n+====\n+*Example*\n+[source,eql]\n+----\n+substring(\"quick brown fox\", 0, 5)      // returns \"quick\"\n+substring(\"quick brown fox\", 6, 11)     // returns \"brown\"\n+substring(\"quick brown fox\", 6)         // returns \"b\"\n+substring(\"quick brown fox\", -3, -1)    // returns \"fo\"\n+substring(\"quick brown fox\", -3)        // returns \"f\"\n+----", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "49bce33c3ddff26f0f4802714b2fa057160859fd"}, "originalPosition": 31}]}}, {"__typename": "PullRequestCommit", "commit": {"oid": "5778e9878fd78564b65fb9d6e9ec9dcb7751a9cb", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/5778e9878fd78564b65fb9d6e9ec9dcb7751a9cb", "committedDate": "2020-03-23T12:42:39Z", "message": "Arguments -> parameters"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "79dd639acabdf9b1e5e9d17a837aa21f88dd654b", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/79dd639acabdf9b1e5e9d17a837aa21f88dd654b", "committedDate": "2020-03-24T13:14:55Z", "message": "Better sample data"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "8c21e5a175efed6dd72e02c70e077fca9c5a5b27", "author": {"user": {"login": "elasticmachine", "name": "Elastic Machine"}}, "url": "https://github.com/elastic/elasticsearch/commit/8c21e5a175efed6dd72e02c70e077fca9c5a5b27", "committedDate": "2020-03-25T13:44:43Z", "message": "Merge branch 'master' into docs__eql-substring-fn"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "f9f30baf9de3c25f14104bd963d5b4d4b6753db5", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/f9f30baf9de3c25f14104bd963d5b4d4b6753db5", "committedDate": "2020-03-25T14:23:30Z", "message": "Update for #53935"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzgxMjY4NTE3", "url": "https://github.com/elastic/elasticsearch/pull/53867#pullrequestreview-381268517", "createdAt": "2020-03-25T15:34:24Z", "commit": {"oid": "f9f30baf9de3c25f14104bd963d5b4d4b6753db5"}, "state": "APPROVED", "comments": {"totalCount": 2, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yNVQxNTozNDoyNVrOF7g_YQ==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yNVQxNTozNToxOFrOF7hCLQ==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM5Nzk1MDgxNw==", "bodyText": "Separate question should fn be a prefix instead of a suffix to make it easy to categorize, e.g. eql-fn-substring", "url": "https://github.com/elastic/elasticsearch/pull/53867#discussion_r397950817", "createdAt": "2020-03-25T15:34:25Z", "author": {"login": "costin"}, "path": "docs/reference/eql/functions.asciidoc", "diffHunk": "@@ -0,0 +1,60 @@\n+[[eql-function-ref]]\n+== EQL function reference\n+++++\n+<titleabbrev>Function reference</titleabbrev>\n+++++\n+\n+experimental::[]\n+\n+{es} supports the following EQL functions:\n+\n+* <<eql-substring-fn>>", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "f9f30baf9de3c25f14104bd963d5b4d4b6753db5"}, "originalPosition": 11}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM5Nzk1MTUzMw==", "bodyText": "I would add that if the start is higher than the length of the string or end, an empty string is returned.", "url": "https://github.com/elastic/elasticsearch/pull/53867#discussion_r397951533", "createdAt": "2020-03-25T15:35:18Z", "author": {"login": "costin"}, "path": "docs/reference/eql/functions.asciidoc", "diffHunk": "@@ -0,0 +1,60 @@\n+[[eql-function-ref]]\n+== EQL function reference\n+++++\n+<titleabbrev>Function reference</titleabbrev>\n+++++\n+\n+experimental::[]\n+\n+{es} supports the following EQL functions:\n+\n+* <<eql-substring-fn>>\n+\n+[discrete]\n+[[eql-substring-fn]]\n+=== `substring`\n+\n+Extracts a substring from a source string at provided start and end positions.\n+\n+If no end position is provided, the function extracts the remaining string.\n+\n+[%collapsible]\n+====\n+*Example*\n+[source,eql]\n+----\n+substring(\"start regsvr32.exe\", 6)        // returns \"regsvr32.exe\"\n+substring(\"start regsvr32.exe\", 0, 5)     // returns \"start\"\n+substring(\"start regsvr32.exe\", 6, 14)    // returns \"regsvr32\"\n+substring(\"start regsvr32.exe\", -4)       // returns \".exe\"\n+substring(\"start regsvr32.exe\", -4, -1)   // returns \".ex\"\n+----\n+\n+*Syntax*\n+\n+[source,txt]\n+----\n+substring(<source>, <start_pos>[, <end_pos>])\n+----\n+\n+*Parameters*\n+\n+`<source>`::\n+(Required, string)\n+Source string.\n+\n+`<start_pos>`::\n+(Required, integer)\n+Starting position for extraction.\n++\n+Positions are zero-indexed. Negative offsets are supported.\n+\n+`<end_pos>`::\n+(Optional, integer)\n+End position for extraction. If this position is not provided, the function\n+returns the remaining string.\n++\n+Positions are zero-indexed. Negative offsets are supported.", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "f9f30baf9de3c25f14104bd963d5b4d4b6753db5"}, "originalPosition": 57}]}}, {"__typename": "PullRequestCommit", "commit": {"oid": "f03b9e1160792745d10d758dbdd3757ff573f196", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/f03b9e1160792745d10d758dbdd3757ff573f196", "committedDate": "2020-03-25T15:38:58Z", "message": "Move to prefix"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3MzgxMjczODc3", "url": "https://github.com/elastic/elasticsearch/pull/53867#pullrequestreview-381273877", "createdAt": "2020-03-25T15:39:42Z", "commit": {"oid": "f9f30baf9de3c25f14104bd963d5b4d4b6753db5"}, "state": "APPROVED", "comments": {"totalCount": 0, "pageInfo": {"startCursor": null, "endCursor": null, "hasNextPage": false, "hasPreviousPage": false}, "nodes": []}}, {"__typename": "PullRequestCommit", "commit": {"oid": "9d3810949081529eb868f70a15e2659d35b96352", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/9d3810949081529eb868f70a15e2659d35b96352", "committedDate": "2020-03-25T15:43:12Z", "message": "Add note for empty strings"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "1155272b60a60579fa1c85b2e4e3df794fba6a79", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/1155272b60a60579fa1c85b2e4e3df794fba6a79", "committedDate": "2020-03-25T15:46:58Z", "message": "Note that <end_pos> is exclusive"}}]}}}, "rateLimit": {"limit": 5000, "remaining": 1899, "cost": 1, "resetAt": "2021-10-28T18:54:27Z"}}}