{"data": {"repository": {"pullRequest": {"id": "MDExOlB1bGxSZXF1ZXN0NTMyNjgxMjQ5", "number": 65898, "title": "[DOCS] EQL: Add diagrams for sequence matching", "bodyText": "Adds diagrams for state machines used during EQL sequence matching.\nCloses #65888\nPreview\nhttps://elasticsearch_65898.docs-preview.app.elstc.co/guide/en/elasticsearch/reference/master/eql-syntax.html#eql-how-sequence-queries-handle-matches (Expand the example)", "createdAt": "2020-12-04T17:35:55Z", "url": "https://github.com/elastic/elasticsearch/pull/65898", "merged": true, "mergeCommit": {"oid": "6a09df8520aef2800004a5edbdc918f2acf093d1"}, "closed": true, "closedAt": "2020-12-07T12:55:39Z", "author": {"login": "jrodewig"}, "timelineItems": {"totalCount": 10, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpPPAAABdi7dOjgBqjQwNzM3OTUxOTk=", "endCursor": "Y3Vyc29yOnYyOpPPAAABdjyLUWAFqTU0NTk2OTA0MQ==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"__typename": "HeadRefForcePushedEvent", "beforeCommit": {"oid": "337fb13c667afe163b6b96348d21adfe47f786c0", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/337fb13c667afe163b6b96348d21adfe47f786c0", "committedDate": "2020-12-04T17:32:29Z", "message": "[DOCS] EQL: Add diagrams for sequence matching"}, "afterCommit": {"oid": "fd9fff6314ed5798341953e19aafff67c9023947", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/fd9fff6314ed5798341953e19aafff67c9023947", "committedDate": "2020-12-04T17:46:45Z", "message": "[DOCS] EQL: Add diagrams for sequence matching"}}, {"__typename": "HeadRefForcePushedEvent", "beforeCommit": {"oid": "fd9fff6314ed5798341953e19aafff67c9023947", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/fd9fff6314ed5798341953e19aafff67c9023947", "committedDate": "2020-12-04T17:46:45Z", "message": "[DOCS] EQL: Add diagrams for sequence matching"}, "afterCommit": {"oid": "88430aaae8aac845d5a16adab8630f5923b4333e", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/88430aaae8aac845d5a16adab8630f5923b4333e", "committedDate": "2020-12-04T17:47:36Z", "message": "[DOCS] EQL: Add diagrams for sequence matching"}}, {"__typename": "HeadRefForcePushedEvent", "beforeCommit": {"oid": "88430aaae8aac845d5a16adab8630f5923b4333e", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/88430aaae8aac845d5a16adab8630f5923b4333e", "committedDate": "2020-12-04T17:47:36Z", "message": "[DOCS] EQL: Add diagrams for sequence matching"}, "afterCommit": {"oid": "ad19a4d02c45ad60c692cae0b76cedd136e1c961", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/ad19a4d02c45ad60c692cae0b76cedd136e1c961", "committedDate": "2020-12-04T18:07:29Z", "message": "[DOCS] EQL: Add diagrams for sequence matching"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "140a7878a14cc349bdd90ac634e1c31553d9fbb4", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/140a7878a14cc349bdd90ac634e1c31553d9fbb4", "committedDate": "2020-12-04T18:08:32Z", "message": "[DOCS] EQL: Add diagrams for sequence matching"}}, {"__typename": "HeadRefForcePushedEvent", "beforeCommit": {"oid": "ad19a4d02c45ad60c692cae0b76cedd136e1c961", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/ad19a4d02c45ad60c692cae0b76cedd136e1c961", "committedDate": "2020-12-04T18:07:29Z", "message": "[DOCS] EQL: Add diagrams for sequence matching"}, "afterCommit": {"oid": "140a7878a14cc349bdd90ac634e1c31553d9fbb4", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/140a7878a14cc349bdd90ac634e1c31553d9fbb4", "committedDate": "2020-12-04T18:08:32Z", "message": "[DOCS] EQL: Add diagrams for sequence matching"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3NTQ1MTk2MjIx", "url": "https://github.com/elastic/elasticsearch/pull/65898#pullrequestreview-545196221", "createdAt": "2020-12-04T18:24:00Z", "commit": {"oid": "140a7878a14cc349bdd90ac634e1c31553d9fbb4"}, "state": "COMMENTED", "comments": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0xMi0wNFQxODoyNDowMFrOH_csjw==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0xMi0wNFQxODoyNDowMFrOH_csjw==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUzNjI5MjQ5NQ==", "bodyText": "I originally tried using SVG images here similar to the ones above, but they broke up the example too much.", "url": "https://github.com/elastic/elasticsearch/pull/65898#discussion_r536292495", "createdAt": "2020-12-04T18:24:00Z", "author": {"login": "jrodewig"}, "path": "docs/reference/eql/syntax.asciidoc", "diffHunk": "@@ -847,81 +847,165 @@ The query's event items correspond to the following states:\n * State B:  `[process where process.name == \"bash\"]`\n * Complete: `[process where process.name == \"cat\"]`\n \n+image::images/eql/sequence-state-machine.svg[align=\"center\"]\n+\n To find matching sequences, the query uses separate state machines for each\n-unique `user.name` value. Pending sequence matches move through each machine's\n-states as follows:\n+unique `user.name` value. Based on the data set, you can expect two state\n+machines: one for the `root` user and one for `elkbee`.\n+\n+image::images/eql/separate-state-machines.svg[align=\"center\"]\n+\n+Pending sequence matches move through each machine's states as follows:\n \n [source,txt]\n ----\n-{ \"index\" : { \"_id\" : \"1\" } }\n+{ \"index\" : { \"_id\": \"1\" } }\n { \"user\": { \"name\": \"root\" }, \"process\": { \"name\": \"attrib\" }, ...}\n // Creates sequence [1] in state A for the \"root\" user.\n //\n-// root: A=[1]\n-\n-{ \"index\" : { \"_id\" : \"2\" } }\n+// +-------------------------root-------------------------+\n+// |  +-----------+     +-----------+     +------------+  |\n+// |  |  State A  |     |  State B  |     |  Complete  |  |\n+// |  +-----------+     +-----------+     +------------+  |\n+// |  |    [1]    |     |           |     |            |  |\n+// |  +-----------+     +-----------+     +------------+  |\n+// +------------------------------------------------------+", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "140a7878a14cc349bdd90ac634e1c31553d9fbb4"}, "originalPosition": 71}]}}, {"__typename": "PullRequestCommit", "commit": {"oid": "145978ce6837851fb9b27cb94d5685e441df7a44", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/145978ce6837851fb9b27cb94d5685e441df7a44", "committedDate": "2020-12-04T18:28:21Z", "message": "wrap ascii diagram headings in quotes"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "61682cdf8254ac423feb25d20d00728695fc377b", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/61682cdf8254ac423feb25d20d00728695fc377b", "committedDate": "2020-12-04T18:29:29Z", "message": "Remove arrow"}}, {"__typename": "PullRequestCommit", "commit": {"oid": "12dde4ed4f1b3a19569e3336c8b2c51cf9c068a8", "author": {"user": {"login": "jrodewig", "name": "James Rodewig"}}, "url": "https://github.com/elastic/elasticsearch/commit/12dde4ed4f1b3a19569e3336c8b2c51cf9c068a8", "committedDate": "2020-12-04T20:17:54Z", "message": "Whitespace"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3NTQ1OTY5MDQx", "url": "https://github.com/elastic/elasticsearch/pull/65898#pullrequestreview-545969041", "createdAt": "2020-12-07T09:32:12Z", "commit": {"oid": "12dde4ed4f1b3a19569e3336c8b2c51cf9c068a8"}, "state": "COMMENTED", "comments": {"totalCount": 0, "pageInfo": {"startCursor": null, "endCursor": null, "hasNextPage": false, "hasPreviousPage": false}, "nodes": []}}]}}}, "rateLimit": {"limit": 5000, "remaining": 3998, "cost": 1, "resetAt": "2021-10-28T19:08:13Z"}}}