{"data": {"repository": {"pullRequest": {"id": "MDExOlB1bGxSZXF1ZXN0NDk1NTcwOTMy", "number": 63079, "reviewThreads": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOS0zMFQxNDo1NTo0MFrOEpEhbA==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOS0zMFQxNDo1NTo0MFrOEpEhbA==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDIzOlB1bGxSZXF1ZXN0UmV2aWV3VGhyZWFkMzExNTAxMTY0OnYy", "diffSide": "RIGHT", "path": "docs/reference/eql/syntax.asciidoc", "isResolved": true, "comments": {"totalCount": 4, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOS0zMFQxNDo1NTo0MFrOHahslw==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wOS0zMFQxNToxODozNFrOHaiyow==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU3NzExMQ==", "bodyText": "Underscores are also valid. Also, if a field name starts with a number (i.e. 10x, then it also needs to be wrapped in backticks)", "url": "https://github.com/elastic/elasticsearch/pull/63079#discussion_r497577111", "createdAt": "2020-09-30T14:55:40Z", "author": {"login": "rw-access"}, "path": "docs/reference/eql/syntax.asciidoc", "diffHunk": "@@ -54,6 +54,30 @@ For example, the following EQL query matches any documents with a\n any where network.protocol == \"http\"\n ----\n \n+[discrete]\n+[[eql-syntax-escape-identifiers]]\n+==== Escape an event category or field name\n+\n+Event categories or field names containing non-alphanumeric characters must be\n+escaped with enclosing backticks (+++`+++). Non-alphanumeric characters include\n+underscores (`_`), dots (`.`), hyphens (`-`), or spaces.", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "bbe121f563089caaaafee2af97b9967867578871"}, "originalPosition": 10}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU3OTQ3OA==", "bodyText": "Thanks! I haven't tested this yet so I'll confirm.", "url": "https://github.com/elastic/elasticsearch/pull/63079#discussion_r497579478", "createdAt": "2020-09-30T14:58:36Z", "author": {"login": "jrodewig"}, "path": "docs/reference/eql/syntax.asciidoc", "diffHunk": "@@ -54,6 +54,30 @@ For example, the following EQL query matches any documents with a\n any where network.protocol == \"http\"\n ----\n \n+[discrete]\n+[[eql-syntax-escape-identifiers]]\n+==== Escape an event category or field name\n+\n+Event categories or field names containing non-alphanumeric characters must be\n+escaped with enclosing backticks (+++`+++). Non-alphanumeric characters include\n+underscores (`_`), dots (`.`), hyphens (`-`), or spaces.", "state": "SUBMITTED", "replyTo": {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU3NzExMQ=="}, "originalCommit": {"oid": "bbe121f563089caaaafee2af97b9967867578871"}, "originalPosition": 10}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU4MDQxNg==", "bodyText": "and dots are still fine for fields, as long as they are in the middle and not at the ends. process.name is still valid", "url": "https://github.com/elastic/elasticsearch/pull/63079#discussion_r497580416", "createdAt": "2020-09-30T14:59:41Z", "author": {"login": "rw-access"}, "path": "docs/reference/eql/syntax.asciidoc", "diffHunk": "@@ -54,6 +54,30 @@ For example, the following EQL query matches any documents with a\n any where network.protocol == \"http\"\n ----\n \n+[discrete]\n+[[eql-syntax-escape-identifiers]]\n+==== Escape an event category or field name\n+\n+Event categories or field names containing non-alphanumeric characters must be\n+escaped with enclosing backticks (+++`+++). Non-alphanumeric characters include\n+underscores (`_`), dots (`.`), hyphens (`-`), or spaces.", "state": "SUBMITTED", "replyTo": {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU3NzExMQ=="}, "originalCommit": {"oid": "bbe121f563089caaaafee2af97b9967867578871"}, "originalPosition": 10}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU5NTA0Mw==", "bodyText": "Thanks for pointing this out @rw-access. Was able to confirm in my testing. I won't mention dots at all as ES doesn't allow the creation of fields starting or ending with a dot.", "url": "https://github.com/elastic/elasticsearch/pull/63079#discussion_r497595043", "createdAt": "2020-09-30T15:18:34Z", "author": {"login": "jrodewig"}, "path": "docs/reference/eql/syntax.asciidoc", "diffHunk": "@@ -54,6 +54,30 @@ For example, the following EQL query matches any documents with a\n any where network.protocol == \"http\"\n ----\n \n+[discrete]\n+[[eql-syntax-escape-identifiers]]\n+==== Escape an event category or field name\n+\n+Event categories or field names containing non-alphanumeric characters must be\n+escaped with enclosing backticks (+++`+++). Non-alphanumeric characters include\n+underscores (`_`), dots (`.`), hyphens (`-`), or spaces.", "state": "SUBMITTED", "replyTo": {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ5NzU3NzExMQ=="}, "originalCommit": {"oid": "bbe121f563089caaaafee2af97b9967867578871"}, "originalPosition": 10}]}}]}}}, "rateLimit": {"limit": 5000, "remaining": 3302, "cost": 1, "resetAt": "2021-11-12T13:16:51Z"}}}