{"data": {"repository": {"pullRequest": {"id": "MDExOlB1bGxSZXF1ZXN0MzgxNDM5MTI0", "number": 52953, "reviewThreads": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0wMlQwOTozNjoyOVrODkMqDg==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0wMlQwOTozNjoyOVrODkMqDg==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDIzOlB1bGxSZXF1ZXN0UmV2aWV3VGhyZWFkMjM5MjgyNzAyOnYy", "diffSide": "RIGHT", "path": "docs/reference/eql/search.asciidoc", "isResolved": false, "comments": {"totalCount": 2, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0wMlQwOTozNjoyOVrOFwYzAw==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0wMlQxNDozMDoxN1rOFwhgrA==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NjI4MjI0Mw==", "bodyText": "fyi #52971", "url": "https://github.com/elastic/elasticsearch/pull/52953#discussion_r386282243", "createdAt": "2020-03-02T09:36:29Z", "author": {"login": "astefan"}, "path": "docs/reference/eql/search.asciidoc", "diffHunk": "@@ -40,8 +41,120 @@ GET sec_logs/_eql/search\n   \"\"\"\n }\n ----\n-// TEST[continued]\n \n Because the `sec_log` index follows the ECS, you don't need to specify the\n-event type or timestamp fields. The request uses the `event.category` and\n-`@timestamp` fields by default.\n+timestamp fields. The request uses the `@timestamp` field by default.\n+\n+The API returns the following response containing the matching event:\n+\n+[source,console-result]\n+----\n+{\n+  \"took\": 3,\n+  \"timed_out\": false,\n+  \"hits\": {\n+    \"total\": {\n+      \"value\": 1,\n+      \"relation\": \"eq\"\n+    },\n+    \"events\": [\n+      {\n+        \"_index\": \"sec_logs\",\n+        \"_id\": \"1\",\n+        \"_score\": 0.9400072,\n+        \"_source\": {\n+          \"@timestamp\": \"2020-12-07T11:06:07.000Z\",\n+          \"agent\": {\n+            \"id\": \"8a4f500d\"\n+          },\n+          \"event\": {\n+            \"category\": \"process\"\n+          },\n+          \"process\": {\n+            \"name\": \"cmd.exe\",\n+            \"path\": \"C:\\\\Windows\\\\System32\\\\cmd.exe\"\n+          }\n+        }\n+      }\n+    ]\n+  }\n+}\n+----\n+// TESTRESPONSE[s/\"took\": 3/\"took\": $body.took/]\n+\n+[discrete]\n+[[eql-search-specify-event-type-field]]\n+=== Specify an event type field\n+\n+The EQL search API uses `event_type` as the required <<eql-required-fields,event\n+type field>> by default. You can use the `event_type_field` parameter to specify\n+another event type field.\n+\n+For example, the following request specifies `file.type` as the event type\n+field.\n+\n+[source,console]\n+----\n+GET sec_logs/_eql/search\n+{\n+  \"event_type_field\": \"file.type\",\n+  \"rule\": \"\"\"\n+    file where agent.id == \"8a4f500d\"\n+  \"\"\"\n+}\n+----\n+\n+[discrete]\n+[[eql-search-specify-timestamp-field]]\n+=== Specify a timestamp field\n+\n+The EQL search API uses `@timestamp` as the required <<eql-required-fields,event\n+timestamp field>> by default. You can use the `timestamp_field` parameter to\n+specify another timestamp field.\n+\n+For example, the following request specifies `file.accessed` as the event\n+timestamp field.\n+\n+[source,console]\n+----\n+GET sec_logs/_eql/search\n+{\n+  \"timestamp_field\": \"file.accessed\",\n+  \"event_type_field\": \"event.category\",\n+  \"rule\": \"\"\"\n+    file where (file.size > 1 and file.type == \"file\")\n+  \"\"\"\n+}\n+----\n+\n+[discrete]\n+[[eql-search-filter-query-dsl]]", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "69fdcdc11836e1b9058b9438a1c800b3534280ad"}, "originalPosition": 120}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NjQyNTAwNA==", "bodyText": "thanks. Addressed with e195cee.", "url": "https://github.com/elastic/elasticsearch/pull/52953#discussion_r386425004", "createdAt": "2020-03-02T14:30:17Z", "author": {"login": "jrodewig"}, "path": "docs/reference/eql/search.asciidoc", "diffHunk": "@@ -40,8 +41,120 @@ GET sec_logs/_eql/search\n   \"\"\"\n }\n ----\n-// TEST[continued]\n \n Because the `sec_log` index follows the ECS, you don't need to specify the\n-event type or timestamp fields. The request uses the `event.category` and\n-`@timestamp` fields by default.\n+timestamp fields. The request uses the `@timestamp` field by default.\n+\n+The API returns the following response containing the matching event:\n+\n+[source,console-result]\n+----\n+{\n+  \"took\": 3,\n+  \"timed_out\": false,\n+  \"hits\": {\n+    \"total\": {\n+      \"value\": 1,\n+      \"relation\": \"eq\"\n+    },\n+    \"events\": [\n+      {\n+        \"_index\": \"sec_logs\",\n+        \"_id\": \"1\",\n+        \"_score\": 0.9400072,\n+        \"_source\": {\n+          \"@timestamp\": \"2020-12-07T11:06:07.000Z\",\n+          \"agent\": {\n+            \"id\": \"8a4f500d\"\n+          },\n+          \"event\": {\n+            \"category\": \"process\"\n+          },\n+          \"process\": {\n+            \"name\": \"cmd.exe\",\n+            \"path\": \"C:\\\\Windows\\\\System32\\\\cmd.exe\"\n+          }\n+        }\n+      }\n+    ]\n+  }\n+}\n+----\n+// TESTRESPONSE[s/\"took\": 3/\"took\": $body.took/]\n+\n+[discrete]\n+[[eql-search-specify-event-type-field]]\n+=== Specify an event type field\n+\n+The EQL search API uses `event_type` as the required <<eql-required-fields,event\n+type field>> by default. You can use the `event_type_field` parameter to specify\n+another event type field.\n+\n+For example, the following request specifies `file.type` as the event type\n+field.\n+\n+[source,console]\n+----\n+GET sec_logs/_eql/search\n+{\n+  \"event_type_field\": \"file.type\",\n+  \"rule\": \"\"\"\n+    file where agent.id == \"8a4f500d\"\n+  \"\"\"\n+}\n+----\n+\n+[discrete]\n+[[eql-search-specify-timestamp-field]]\n+=== Specify a timestamp field\n+\n+The EQL search API uses `@timestamp` as the required <<eql-required-fields,event\n+timestamp field>> by default. You can use the `timestamp_field` parameter to\n+specify another timestamp field.\n+\n+For example, the following request specifies `file.accessed` as the event\n+timestamp field.\n+\n+[source,console]\n+----\n+GET sec_logs/_eql/search\n+{\n+  \"timestamp_field\": \"file.accessed\",\n+  \"event_type_field\": \"event.category\",\n+  \"rule\": \"\"\"\n+    file where (file.size > 1 and file.type == \"file\")\n+  \"\"\"\n+}\n+----\n+\n+[discrete]\n+[[eql-search-filter-query-dsl]]", "state": "SUBMITTED", "replyTo": {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NjI4MjI0Mw=="}, "originalCommit": {"oid": "69fdcdc11836e1b9058b9438a1c800b3534280ad"}, "originalPosition": 120}]}}]}}}, "rateLimit": {"limit": 5000, "remaining": 3462, "cost": 1, "resetAt": "2021-11-12T11:57:46Z"}}}