{"data": {"repository": {"pullRequest": {"id": "MDExOlB1bGxSZXF1ZXN0MzkxNTI3NDc4", "number": 53867, "reviewThreads": {"totalCount": 3, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yMFQxMzozOToyMVrODp3w-A==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yNVQxNTozNToxOFrODrRS1w==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDIzOlB1bGxSZXF1ZXN0UmV2aWV3VGhyZWFkMjQ1MjMxODY0OnYy", "diffSide": "RIGHT", "path": "docs/reference/eql/functions.asciidoc", "isResolved": true, "comments": {"totalCount": 1, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yMFQxMzozOToyMVrOF5UDSg==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yMFQxMzozOToyMVrOF5UDSg==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM5NTY0MTY3NA==", "bodyText": "@costin\nThese examples are a modified version of those from the original EQL substring docs.\nHowever, they're not all working as expected in ES.\nI included my testing approach below. Let me know if this behavior is expected. If so, I can update the docs.\nIndex setup\nMap process.name as a keyword field so it doesn't get analyzed.\nPUT my_index\n{\n  \"mappings\": {\n    \"properties\": {\n      \"process\": {\n        \"properties\": {\n          \"name\": {\n            \"type\": \"keyword\"\n          }\n        }\n      }\n    }\n  }\n}\n\nIndex a doc containing quick brown fox in the process.name field.\nPUT my_index/_doc/1\n{\n  \"@timestamp\": \"2020-12-06T11:04:05.000Z\",\n  \"event\": {\n    \"category\": \"process\"\n  },\n  \"process\": {\n    \"name\": \"quick brown fox\"\n  }\n}\n\nStarting position of 0 returns results\nA starting position of 0 returns results as expected.\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, 0, 5) == \"quick\"\n  \"\"\"\n}\n\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, 0, 7) == \"quick b\"\n  \"\"\"\n}\n\nResponse:\n{\n  \"took\" : 2,\n  \"timed_out\" : false,\n  \"hits\" : {\n    \"total\" : {\n      \"value\" : 1,\n      \"relation\" : \"eq\"\n    },\n    \"events\" : [\n      {\n        \"_index\" : \"my_index\",\n        \"_id\" : \"1\",\n        \"_score\" : null,\n        \"_source\" : {\n          \"@timestamp\" : \"2020-12-06T11:04:05.000Z\",\n          \"event\" : {\n            \"category\" : \"process\"\n          },\n          \"process\" : {\n            \"name\" : \"quick brown fox\"\n          }\n        },\n        \"sort\" : [\n          1607252645000\n        ]\n      }\n    ]\n  }\n}\n\nNon-zero, positive offsets return no results\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, 6, 11) == \"brown\"\n  \"\"\"\n}\n\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, 6) == \"b\"\n  \"\"\"\n}\n\nResponse:\n{\n  \"took\" : 1,\n  \"timed_out\" : false,\n  \"hits\" : {\n    \"total\" : {\n      \"value\" : 0,\n      \"relation\" : \"eq\"\n    },\n    \"events\" : [ ]\n  }\n}\n\nA negative starting position with no end position returns no results\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, -3) == \"f\"\n  \"\"\"\n}\n\nResponse:\n{\n  \"took\" : 1,\n  \"timed_out\" : false,\n  \"hits\" : {\n    \"total\" : {\n      \"value\" : 0,\n      \"relation\" : \"eq\"\n    },\n    \"events\" : [ ]\n  }\n}\n\nA negative end position returns an error\nGET my_index/_eql/search\n{\n  \"query\": \"\"\"\n    process where substring(process.name, -3, -1) == \"fo\"\n  \"\"\"\n}\n\nError:\n{\n  \"error\" : {\n    \"root_cause\" : [\n      {\n        \"type\" : \"sql_illegal_argument_exception\",\n        \"reason\" : \"A positive number is required for [length]; received [-1]\"\n      }\n    ],\n    \"type\" : \"search_phase_execution_exception\",\n    \"reason\" : \"all shards failed\",\n    \"phase\" : \"query\",\n    \"grouped\" : true,\n    \"failed_shards\" : [\n      {\n        \"shard\" : 0,\n        \"index\" : \"my_index\",\n        \"node\" : \"UYH0jOvXSN-ot5Vu6ml-_w\",\n        \"reason\" : {\n          \"type\" : \"script_exception\",\n          \"reason\" : \"runtime error\",\n          \"script_stack\" : [\n            \"org.elasticsearch.xpack.sql.expression.function.scalar.string.SubstringFunctionProcessor.doProcess(SubstringFunctionProcessor.java:63)\",\n            \"org.elasticsearch.xpack.sql.expression.function.scalar.whitelist.InternalSqlScriptUtils.substring(InternalSqlScriptUtils.java:418)\",\n            \"InternalSqlScriptUtils.nullSafeFilter(InternalSqlScriptUtils.eq(InternalSqlScriptUtils.substring(InternalSqlScriptUtils.docValue(doc,params.v0),params.v1,params.v2),params.v3))\",\n            \"                                                                                                                                                                ^---- HERE\"\n          ],\n          \"script\" : \"InternalSqlScriptUtils.nullSafeFilter(InternalSqlScriptUtils.eq(InternalSqlScriptUtils.substring(InternalSqlScriptUtils.docValue(doc,params.v0),params.v1,params.v2),params.v3))\",\n          \"lang\" : \"painless\",\n          \"position\" : {\n            \"offset\" : 160,\n            \"start\" : 0,\n            \"end\" : 176\n          },\n          \"caused_by\" : {\n            \"type\" : \"sql_illegal_argument_exception\",\n            \"reason\" : \"A positive number is required for [length]; received [-1]\"\n          }\n        }\n      }\n    ],\n    \"caused_by\" : {\n      \"type\" : \"sql_illegal_argument_exception\",\n      \"reason\" : \"A positive number is required for [length]; received [-1]\"\n    }\n  },\n  \"status\" : 400\n}", "url": "https://github.com/elastic/elasticsearch/pull/53867#discussion_r395641674", "createdAt": "2020-03-20T13:39:21Z", "author": {"login": "jrodewig"}, "path": "docs/reference/eql/functions.asciidoc", "diffHunk": "@@ -0,0 +1,60 @@\n+[[eql-function-ref]]\n+== EQL function reference\n+++++\n+<titleabbrev>Function reference</titleabbrev>\n+++++\n+\n+experimental::[]\n+\n+{es} supports the following EQL functions:\n+\n+* <<eql-substring-fn>>\n+\n+[discrete]\n+[[eql-substring-fn]]\n+=== `substring`\n+Extracts a substring from a source string at provided start and end positions.\n+\n+If no end position is provided, the function extracts only the character in the\n+start position.\n+\n+[%collapsible]\n+====\n+*Example*\n+[source,eql]\n+----\n+substring(\"quick brown fox\", 0, 5)      // returns \"quick\"\n+substring(\"quick brown fox\", 6, 11)     // returns \"brown\"\n+substring(\"quick brown fox\", 6)         // returns \"b\"\n+substring(\"quick brown fox\", -3, -1)    // returns \"fo\"\n+substring(\"quick brown fox\", -3)        // returns \"f\"\n+----", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "49bce33c3ddff26f0f4802714b2fa057160859fd"}, "originalPosition": 31}]}}, {"id": "MDIzOlB1bGxSZXF1ZXN0UmV2aWV3VGhyZWFkMjQ2Njk4Mjg4OnYy", "diffSide": "RIGHT", "path": "docs/reference/eql/functions.asciidoc", "isResolved": true, "comments": {"totalCount": 2, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yNVQxNTozNDoyNVrOF7g_YQ==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yNVQxNTozOToyOVrOF7hPYQ==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM5Nzk1MDgxNw==", "bodyText": "Separate question should fn be a prefix instead of a suffix to make it easy to categorize, e.g. eql-fn-substring", "url": "https://github.com/elastic/elasticsearch/pull/53867#discussion_r397950817", "createdAt": "2020-03-25T15:34:25Z", "author": {"login": "costin"}, "path": "docs/reference/eql/functions.asciidoc", "diffHunk": "@@ -0,0 +1,60 @@\n+[[eql-function-ref]]\n+== EQL function reference\n+++++\n+<titleabbrev>Function reference</titleabbrev>\n+++++\n+\n+experimental::[]\n+\n+{es} supports the following EQL functions:\n+\n+* <<eql-substring-fn>>", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "f9f30baf9de3c25f14104bd963d5b4d4b6753db5"}, "originalPosition": 11}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM5Nzk1NDkxMw==", "bodyText": "Good call. This'll help w/ copy/paste in the future. Moved to prefix with f03b9e1.", "url": "https://github.com/elastic/elasticsearch/pull/53867#discussion_r397954913", "createdAt": "2020-03-25T15:39:29Z", "author": {"login": "jrodewig"}, "path": "docs/reference/eql/functions.asciidoc", "diffHunk": "@@ -0,0 +1,60 @@\n+[[eql-function-ref]]\n+== EQL function reference\n+++++\n+<titleabbrev>Function reference</titleabbrev>\n+++++\n+\n+experimental::[]\n+\n+{es} supports the following EQL functions:\n+\n+* <<eql-substring-fn>>", "state": "SUBMITTED", "replyTo": {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM5Nzk1MDgxNw=="}, "originalCommit": {"oid": "f9f30baf9de3c25f14104bd963d5b4d4b6753db5"}, "originalPosition": 11}]}}, {"id": "MDIzOlB1bGxSZXF1ZXN0UmV2aWV3VGhyZWFkMjQ2Njk4NzExOnYy", "diffSide": "RIGHT", "path": "docs/reference/eql/functions.asciidoc", "isResolved": false, "comments": {"totalCount": 2, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yNVQxNTozNToxOFrOF7hCLQ==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wMy0yNVQxNTo0MzozNVrOF7hcQA==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM5Nzk1MTUzMw==", "bodyText": "I would add that if the start is higher than the length of the string or end, an empty string is returned.", "url": "https://github.com/elastic/elasticsearch/pull/53867#discussion_r397951533", "createdAt": "2020-03-25T15:35:18Z", "author": {"login": "costin"}, "path": "docs/reference/eql/functions.asciidoc", "diffHunk": "@@ -0,0 +1,60 @@\n+[[eql-function-ref]]\n+== EQL function reference\n+++++\n+<titleabbrev>Function reference</titleabbrev>\n+++++\n+\n+experimental::[]\n+\n+{es} supports the following EQL functions:\n+\n+* <<eql-substring-fn>>\n+\n+[discrete]\n+[[eql-substring-fn]]\n+=== `substring`\n+\n+Extracts a substring from a source string at provided start and end positions.\n+\n+If no end position is provided, the function extracts the remaining string.\n+\n+[%collapsible]\n+====\n+*Example*\n+[source,eql]\n+----\n+substring(\"start regsvr32.exe\", 6)        // returns \"regsvr32.exe\"\n+substring(\"start regsvr32.exe\", 0, 5)     // returns \"start\"\n+substring(\"start regsvr32.exe\", 6, 14)    // returns \"regsvr32\"\n+substring(\"start regsvr32.exe\", -4)       // returns \".exe\"\n+substring(\"start regsvr32.exe\", -4, -1)   // returns \".ex\"\n+----\n+\n+*Syntax*\n+\n+[source,txt]\n+----\n+substring(<source>, <start_pos>[, <end_pos>])\n+----\n+\n+*Parameters*\n+\n+`<source>`::\n+(Required, string)\n+Source string.\n+\n+`<start_pos>`::\n+(Required, integer)\n+Starting position for extraction.\n++\n+Positions are zero-indexed. Negative offsets are supported.\n+\n+`<end_pos>`::\n+(Optional, integer)\n+End position for extraction. If this position is not provided, the function\n+returns the remaining string.\n++\n+Positions are zero-indexed. Negative offsets are supported.", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "f9f30baf9de3c25f14104bd963d5b4d4b6753db5"}, "originalPosition": 57}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM5Nzk1ODIwOA==", "bodyText": "Good note. Added with 9d38109.", "url": "https://github.com/elastic/elasticsearch/pull/53867#discussion_r397958208", "createdAt": "2020-03-25T15:43:35Z", "author": {"login": "jrodewig"}, "path": "docs/reference/eql/functions.asciidoc", "diffHunk": "@@ -0,0 +1,60 @@\n+[[eql-function-ref]]\n+== EQL function reference\n+++++\n+<titleabbrev>Function reference</titleabbrev>\n+++++\n+\n+experimental::[]\n+\n+{es} supports the following EQL functions:\n+\n+* <<eql-substring-fn>>\n+\n+[discrete]\n+[[eql-substring-fn]]\n+=== `substring`\n+\n+Extracts a substring from a source string at provided start and end positions.\n+\n+If no end position is provided, the function extracts the remaining string.\n+\n+[%collapsible]\n+====\n+*Example*\n+[source,eql]\n+----\n+substring(\"start regsvr32.exe\", 6)        // returns \"regsvr32.exe\"\n+substring(\"start regsvr32.exe\", 0, 5)     // returns \"start\"\n+substring(\"start regsvr32.exe\", 6, 14)    // returns \"regsvr32\"\n+substring(\"start regsvr32.exe\", -4)       // returns \".exe\"\n+substring(\"start regsvr32.exe\", -4, -1)   // returns \".ex\"\n+----\n+\n+*Syntax*\n+\n+[source,txt]\n+----\n+substring(<source>, <start_pos>[, <end_pos>])\n+----\n+\n+*Parameters*\n+\n+`<source>`::\n+(Required, string)\n+Source string.\n+\n+`<start_pos>`::\n+(Required, integer)\n+Starting position for extraction.\n++\n+Positions are zero-indexed. Negative offsets are supported.\n+\n+`<end_pos>`::\n+(Optional, integer)\n+End position for extraction. If this position is not provided, the function\n+returns the remaining string.\n++\n+Positions are zero-indexed. Negative offsets are supported.", "state": "SUBMITTED", "replyTo": {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM5Nzk1MTUzMw=="}, "originalCommit": {"oid": "f9f30baf9de3c25f14104bd963d5b4d4b6753db5"}, "originalPosition": 57}]}}]}}}, "rateLimit": {"limit": 5000, "remaining": 4268, "cost": 1, "resetAt": "2021-11-12T13:16:51Z"}}}