{"pr_number": 1777, "pr_title": "Update the docs for the 0.9.1 release", "pr_createdAt": "2020-10-09T15:52:39Z", "pr_url": "https://github.com/open-telemetry/opentelemetry-java/pull/1777", "timeline": [{"oid": "11f6f0668dca32418276c3b4313321fd7023f096", "url": "https://github.com/open-telemetry/opentelemetry-java/commit/11f6f0668dca32418276c3b4313321fd7023f096", "message": "Update the docs for the 0.9.1 release", "committedDate": "2020-10-09T15:44:35Z", "type": "commit"}, {"oid": "2829a08a9f90abb4df714787a3d39c685ff83412", "url": "https://github.com/open-telemetry/opentelemetry-java/commit/2829a08a9f90abb4df714787a3d39c685ff83412", "message": "correct a bad method name", "committedDate": "2020-10-09T15:55:41Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUwMjUzNjk5Nw==", "url": "https://github.com/open-telemetry/opentelemetry-java/pull/1777#discussion_r502536997", "bodyText": "Suggested change\n        \n          \n    \n\n        \n      \n    \n    \n      \n          \n            \n                - FAAS semantic attributes have been added\n          \n          \n            \n                - FaaS semantic attributes have been added", "author": "Oberon00", "createdAt": "2020-10-09T16:15:29Z", "path": "CHANGELOG.md", "diffHunk": "@@ -2,8 +2,56 @@\n \n ## Unreleased\n \n-- Extensions:\n-    - BREAKING CHANGE: Made Propagators to expose only a singleton instance\n+## 0.9.1 - 2020-10-07\n+\n+- API\n+    - BREAKING CHANGE: SpanId, TraceId and TraceFlags are no longer used as instances, but only contain helper methods for managing conversion between Strings, bytes and other formats. SpanId and TraceId are now natively String-typed, and the TraceFlags is a single byte.\n+    - BREAKING CHANGE: Propagators now only expose a singleton instance.\n+    - BREAKING CHANGE: The LabelConsumer and AttributeConsumer are now first-class interfaces, and the underlying consumer interface has had the key made additionally generic. Please prefer using the specific interfaces, rather than the underlying `ReadableKeyValuePairs.KeyValueConsumer`.\n+    - BREAKING CHANGE: Minimum JDK version has been updated to 8, with Android API level 24.\n+    - BREAKING CHANGE: Metric Instrument names are now case-insensitive.\n+    - BREAKING CHANGE: The type-safety on Attributes has been moved to a new AttributeKey, and the AttributeValue wrappers have been removed. This impacts all the semantic attribute definitions, and the various APIs that use Attributes.\n+    - BREAKING CHANGE: The obsolete HTTP_STATUS_TEXT semantic attribute has been removed.\n+    - BREAKING CHANGE: The type of the REDIS_DATABASE_INDEX semantic attribute has been changed to be numeric.\n+    - BREAKING CHANGE: Constant Labels have been removed from metric Instrument definitions.\n+    - BREAKING CHANGE: The number of available Span Status options has been greatly reduced (from 16 to 3).\n+    - BREAKING CHANGE: Constant labels have been removed from metric Instrument definitions.\n+    - BREAKING CHANGE: The only way to specify span parenting is via a parent Context\n+    - BREAKING CHANGE: The default TextMapPropagator is now a no-op in the API\n+    - BREAKING CHANGE: CorrelationContext has been renamed to Baggage\n+    - BREAKING CHANGE: Null-valued span attribute behavior has been changed to being \"unspecified\".\n+    - BREAKING CHANGE: Link and Event interfaces have been removed from the API\n+    - BREAKING CHANGE: The Status object has been removed from the API, in favor of StatusCanonicalCode\n+    - BUGFIX: the `noParent` option on a Span was being ignored if it was set after setting an explicit parent.\n+    - BUGFIX: Attributes and Labels now preserve the latest added entry when an existing key has been used.\n+    - BUGFIX: Updated some of the W3C traceparent validation logic to better match the spec.\n+    - FAAS semantic attributes have been added", "originalCommit": "2829a08a9f90abb4df714787a3d39c685ff83412", "replyToReviewId": null, "replies": null, "type": "inlineReview"}, {"oid": "3da79f8bc019b4e6e1742229413c1306dc42ab24", "url": "https://github.com/open-telemetry/opentelemetry-java/commit/3da79f8bc019b4e6e1742229413c1306dc42ab24", "message": "Update CHANGELOG.md\n\nCo-authored-by: Christian Neumüller <christian+github@neumueller.me>", "committedDate": "2020-10-09T16:22:26Z", "type": "commit"}]}