{"data": {"repository": {"pullRequest": {"id": "MDExOlB1bGxSZXF1ZXN0Mzk4NDQyMjM2", "number": 4158, "title": "[GSIP-190] assume +0 vote after 10 days", "bodyText": "See GSIP-190 for policy change:\n\nAssume +0 vote after 10 days\n\nIt has been some time since these pages were updated:\n\n Combines the voting procedure from the gsip and psc pages into an include, and attempt to make them consistent.\n Includs the markdown gsip template as part of the gsip page to save time\n Changes irc meeting to video meeting\n Consistently says 6 months, rather than 2 months, to consider PSC member inactive\n Note OSGeo stuff (annual report, budget, officer, code of conduct)\n\nChecklist\nFor all pull requests:\n\n Confirm you have read the contribution guidelines\n You have sent a Contribution Licence Agreement (CLA) as necessary (not required for small changes, e.g., fixing typos in documentation)\n Make sure the first PR targets the master branch, eventual backports will be managed later. This can be ignored if the PR is fixing an issue that only happens in a specific branch, but not in newer ones.\n\nThe following are required only for core and extension modules (they are welcomed, but not required, for community modules):\n\n There is a ticket in Jira describing the issue/improvement/feature (a notable exemptions is, changes not visible to end users)\n PR for bug fixes and small new features are presented as a single commit\n Commit message must be in the form \"[GEOS-XYZW] Title of the Jira ticket\" (export to XML in Jira generates the message in this exact form)\n The pull request contains changes related to a single objective. If multiple focuses cannot be avoided, each one is in its own commit and has a separate ticket describing it.\n New unit tests have been added covering the changes\n This PR passes all existing unit tests (test results will be reported by travis-ci after opening this PR)\n This PR passes the QA checks (QA checks results will be reported by travis-ci after opening this PR)\n Commits changing the UI, existing user workflows, or adding new functionality, need to include documentation updates (screenshots, text)\n Commits changing the REST API, or any configuration object, should check if the REST API docs (Swagger YAML files and classic documentation) need to be updated.\n\nSubmitting the PR does not require you to check all items, but by the time it gets merged, they should be either satisfied or inapplicable.", "createdAt": "2020-04-04T00:53:15Z", "url": "https://github.com/geoserver/geoserver/pull/4158", "merged": true, "mergeCommit": {"oid": "70d619ff5953b6f6c9f8bb11dc8f7202f216aa39"}, "closed": true, "closedAt": "2020-05-12T07:04:46Z", "author": {"login": "jodygarnett"}, "timelineItems": {"totalCount": 3, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpPPAAABcUKqawgH2gAyMzk4NDQyMjM2OjA5MzZjZDgyNzI2MDM4ZjIxYzk5NTQ4MzJjYzM3MGIzMmVkMTQzNTk=", "endCursor": "Y3Vyc29yOnYyOpPPAAABcgeyQLAH2gAyMzk4NDQyMjM2OjA5YTI4ZmQ2NGVjODFhNjg1MDMyM2FlOWMzYjQyZjI3ZWQ2ZDk5Njc=", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"__typename": "PullRequestCommit", "commit": {"oid": "0936cd82726038f21c9954832cc370b32ed14359", "author": {"user": {"login": "jodygarnett", "name": "Jody Garnett"}}, "url": "https://github.com/geoserver/geoserver/commit/0936cd82726038f21c9954832cc370b32ed14359", "committedDate": "2020-04-04T00:49:57Z", "message": "[GSIP-190] assume +0 vote after 10 days\n\nThis pull request:\n\n* [x] combines the voting procedure from the gsip and psc pages into an include\n* [x] includs the markdown gsip template as part of the documentation\n* [x] changes irc meeting to video meeting\n* [x] consistently says 6 months, rather than 2 months, to consider PSC member inactive\n\nSigned-off-by: Jody Garnett <jody.garnett@gmail.com>"}}, {"__typename": "PullRequestReview", "id": "MDE3OlB1bGxSZXF1ZXN0UmV2aWV3NDAyNzQ3NTM0", "url": "https://github.com/geoserver/geoserver/pull/4158#pullrequestreview-402747534", "createdAt": "2020-04-29T14:52:10Z", "commit": {"oid": "0936cd82726038f21c9954832cc370b32ed14359"}, "state": "APPROVED", "comments": {"totalCount": 2, "pageInfo": {"startCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wNC0yOVQxNDo1MjoxMFrOGOCwSQ==", "endCursor": "Y3Vyc29yOnYyOpK0MjAyMC0wNC0yOVQxNDo1NjowNFrOGOC8Tw==", "hasNextPage": false, "hasPreviousPage": false}, "nodes": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQxNzM3ODM3Nw==", "bodyText": "We already have a template in the wiki, and the proposals page links to it:\nhttps://github.com/geoserver/geoserver/wiki/GSIP-XXXX\nWhy duplicate it?", "url": "https://github.com/geoserver/geoserver/pull/4158#discussion_r417378377", "createdAt": "2020-04-29T14:52:10Z", "author": {"login": "aaime"}, "path": "doc/en/developer/source/policies/gsip_template.txt", "diffHunk": "@@ -0,0 +1,47 @@\n+# GSIP 1234 - Title", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "0936cd82726038f21c9954832cc370b32ed14359"}, "originalPosition": 1}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQxNzM4MTQ1NQ==", "bodyText": "This probably needs some amendment. When was this written, the whole PSC was actively participating in meetings, nowadays only a portion takes part in the video calls. We can amend it simply by saying that members not participating to the meeting can follow up after the meeting minutes mail.", "url": "https://github.com/geoserver/geoserver/pull/4158#discussion_r417381455", "createdAt": "2020-04-29T14:56:04Z", "author": {"login": "aaime"}, "path": "doc/en/developer/source/policies/psc.rst", "diffHunk": "@@ -84,49 +84,30 @@ Process\n \n The primary role of the PSC is to make decisions relating to project management. The following decision making process is used. It is based on the \"Proposal-Vote\" system.\n \n- * Issues that require a decision are based on GeoServer Improvement Proposals (GSIPs). For more on making a proposal see :ref:`gsip`\n- * Proposals may be made by any interested party (PSC, Non-PSC, committer,user,etc...)\n- * Proposals should be addressed within one week of being submitted, votes take place at the subsequent IRC meeting.\n- * Each PSC member may vote one of the following in support of the proposal:\n-   \n-   * +1 : For\n-   * -1 : Against\n-   * +0: Mildly for, but mostly indifferent\n-   * -0: Mildly against, but mostly indifferent\n-\n- * A -1 vote must be accompanied with a detailed reason of being against.\n- * A vote is *successful* if there is a majority of positive votes.\n- * A vote is *unanimous*, if there are either:\n+GeoServer Improvement Proposals\n+^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n \n-   #. No -1 votes against it, or\n-   #. No +1 votes for it.\n+A GeoServer Improvement Proposals (GSIPs) is needed for any action that:\n \n- * In the event of an *successful non unanimous* vote, the following steps are taken:\n- \n-   * Each member who votes -1 _may_ supply an alternative with which the original author can use to rework the proposal in order to satisfy that PSC member.\n-   * If at least one -1 voting PSC member supplies some alternative criteria, the original author must rework the proposal and resubmit, and the voting process starts again from scratch.\n-   * If no -1 voters are able to supply alternative criteria, the proposal is accepted.\n-   * In the event of an *unsuccessful* vote, the author may rework and submit. A proposal may not be resubmitted after being rejected three times.\n-   * Note that a majority of positive votes does not need to be a majority of the full PSC, just a majority of the 'active' PSC - defined by those present at an IRC meeting or responding within 4 days on email.  PSC members need not sound in on every single motion, but are expected to be active - the section on stepping down details that if a PSC is not active for 2 months they will\n+  * Has a major effect on others in the GeoServer community; or\n+  * Will break backwards compatibility; or\n+  * Change core code\n \n-When not to use the GSIP\n-^^^^^^^^^^^^^^^^^^^^^^^^\n+For more on making a proposal see :ref:`gsip`.\n \n-A GSIP is only needed for:\n+.. include:: gsip_voting.txt\n \n-  * an action that has a major effect on others in the GeoServer community.\n-  * If an action will break backwards compatibility, or change core code, a GSIP is recommended.\n+Snap Decisions\n+^^^^^^^^^^^^^^\n \n-A GSIP is NOT needed for:\n+A GSIP proposal is NOT needed for:\n \n-  * an improvement that can go in a community module; or\n-  * a bug fix that doesn't rework anything substantially\n+* an improvement that can go in a community module; or\n+* a bug fix that doesn't rework anything substantially\n \n-For minor decisions where feedback might be desired, the course of action to take is to consult the development list or raise it in an irc meeting.  The GeoServer Project recognizes that it is run those who are actually doing the work, and thus we want to avoid high overhead for 'getting things done'.\n+For minor decisions where feedback might be desired, the course of action to take is to consult the development list or raise it in a video meeting.  The GeoServer Project recognizes that it is run those who are actually doing the work, and thus we want to avoid high overhead for 'getting things done'.", "state": "SUBMITTED", "replyTo": null, "originalCommit": {"oid": "0936cd82726038f21c9954832cc370b32ed14359"}, "originalPosition": 65}]}}, {"__typename": "PullRequestCommit", "commit": {"oid": "09a28fd64ec81a6850323ae9c3b42f27ed6d9967", "author": {"user": {"login": "jodygarnett", "name": "Jody Garnett"}}, "url": "https://github.com/geoserver/geoserver/commit/09a28fd64ec81a6850323ae9c3b42f27ed6d9967", "committedDate": "2020-05-12T07:03:42Z", "message": "revised based on feedback\n\nSigned-off-by: Jody Garnett <jody.garnett@gmail.com>"}}]}}}, "rateLimit": {"limit": 5000, "remaining": 1471, "cost": 1, "resetAt": "2021-11-01T14:20:25Z"}}}