{"pr_number": 6002, "pr_title": "Accessibility improvements to editor pane", "pr_createdAt": "2020-01-13T02:42:56Z", "pr_url": "https://github.com/rstudio/rstudio/pull/6002", "timeline": [{"oid": "ffc4d1a48e2c53acd67cd46dc2187482e084459b", "url": "https://github.com/rstudio/rstudio/commit/ffc4d1a48e2c53acd67cd46dc2187482e084459b", "message": "mark editor panes as tabpanels and label with filename", "committedDate": "2020-01-11T01:42:30Z", "type": "commit"}, {"oid": "72da8be7594c67bab4f9b036ea47289866ce6a7a", "url": "https://github.com/rstudio/rstudio/commit/72da8be7594c67bab4f9b036ea47289866ce6a7a", "message": "Merge branch 'master' into feature/editor-pane-a11y-improvements", "committedDate": "2020-01-12T00:19:01Z", "type": "commit"}, {"oid": "5f25c09b04a76d61c9555f20a4634dff280e8de7", "url": "https://github.com/rstudio/rstudio/commit/5f25c09b04a76d61c9555f20a4634dff280e8de7", "message": "fixes to source-pane accessibility\n\n- make document outline view aria-hidden when visibly hidden\n- annotate document outline view splitter\n- initial wiring for command to speak editor status\n- mark various source pane tabpanels with correct role, and give them labels (text editor, object explorer, code browser, data viewer, url viewer. profile results)\n-", "committedDate": "2020-01-13T01:36:29Z", "type": "commit"}, {"oid": "a254ad5279eebb3ebc88645b6dae01e79a240c9e", "url": "https://github.com/rstudio/rstudio/commit/a254ad5279eebb3ebc88645b6dae01e79a240c9e", "message": "announce details of current editor status when requested", "committedDate": "2020-01-13T02:32:54Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM2NTY4MzMxMw==", "url": "https://github.com/rstudio/rstudio/pull/6002#discussion_r365683313", "bodyText": "This seems to just be an extension of what's already there but I always get a little nervous when multiple timers start being about. This looks sound but I always ask in this situation \"are there any funny conditions we could get in?\"\nThere are some hardcoded times (like the 4000ms on line 71) as well that, at least in the next revision, might want to get pulled out to at least class constants. Not a big deal for this scope but probably something to think about as these things continue to grow in complexity.\nIf we end up with a handful of timers in flight in the future it may be worth offloading some of these status changes to an event bus system.", "author": "adamconroy", "createdAt": "2020-01-13T08:27:22Z", "path": "src/gwt/src/org/rstudio/core/client/widget/AriaLiveStatusWidget.java", "diffHunk": "@@ -63,8 +66,23 @@ public void clearMessage()\n       public void run()\n       {\n          getElement().setInnerText(resultsMessage_);\n+         if (clearReaderTimer_.isRunning())\n+            clearReaderTimer_.cancel();\n+         clearReaderTimer_.schedule(4000);\n       }\n    };\n \n+   /**\n+    * Timer for clearing the previous message if nothing new arrives\n+    */\n+   private Timer clearReaderTimer_ = new Timer()\n+   {\n+     @Override\n+     public void run()\n+     {\n+        getElement().setInnerText(\"\");\n+     }\n+   };\n+", "originalCommit": "a254ad5279eebb3ebc88645b6dae01e79a240c9e", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM2NTk1ODMyNQ==", "url": "https://github.com/rstudio/rstudio/pull/6002#discussion_r365958325", "bodyText": "All fair points. I hate when I add (or see) timers in the code, but if you look, we have dozens of them, and most have hardcoded values. That doesn't make it a \"good thing\".\nIn this case, there are definitely \"funny conditions we could get in\", and they are unknowable without testing combinations of screen readers, browsers, user controlled settings for screen reader speech rate, and length of the messages being injected. Our code has no idea how long it will take for a given message to be read, or if a screen reader will read the message even after the text has been cleared.\nTwo reasons I'm doing this clear after a delay:\n\n\nThe text in a live-alert region, although invisible to sighted users, is visible to screen readers so if the user is navigating through the UI with the screen reader cursor, they will come across it and it is weird to get whatever the last announcement was (which might have happened hours / days ago) read again. So I want to clear it after a while to reduce the chances of that.\n\n\nIf you use the new command I added that reads the current editor status (row, column, etc), it is quite reasonable that a user might issue that command again while on the same line (missed details the first time). A screen reader will not read the same announcement twice in a row, so clearing it increases the chances of them hearing it the second time (but only if they wait 4 seconds, so far from perfect). Another strategy would be to have two live regions, and have the code alternate between them with each announcement, clearing the other one when updating the current one. Would still want the timer to clear each region after some amount of time, but would be more robust in general, I'll open a task to look into that in the future.", "author": "gtritchie", "createdAt": "2020-01-13T18:29:12Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM2NTY4MzMxMw=="}], "type": "inlineReview"}]}