{"pr_number": 2352, "pr_title": "Handle long column names in key/value columnize dialog", "pr_createdAt": "2020-03-02T13:05:20Z", "pr_url": "https://github.com/OpenRefine/OpenRefine/pull/2352", "timeline": [{"oid": "8816cd511a55213e65aec21c3d5a2b407605fe63", "url": "https://github.com/OpenRefine/OpenRefine/commit/8816cd511a55213e65aec21c3d5a2b407605fe63", "message": "changes for #898:\n* made \"Columnize by Key/Value columns\" dialog resizable\n* set overflow styling, which solves the issue in Chromium-based browsers (Chrome, Edge, Opera) but doesn't work in FireFox and WebKit-based browsers (like Epiphany @ Linux, not tested in Safari but most likely won't work either)", "committedDate": "2020-03-02T12:57:02Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NjQ1NDUxNA==", "url": "https://github.com/OpenRefine/OpenRefine/pull/2352#discussion_r386454514", "bodyText": "Is this what causes the whole dialog to have a resize handle that seems on Firefox to allow expanding/shrinking only left-to-right?  I think it should allow adjust both width and height as well, dragging around to resize, like it works on textarea inputs (our expression editor input, for example).  Any way to make it work similar?", "author": "thadguidry", "createdAt": "2020-03-02T15:17:49Z", "path": "main/webapp/modules/core/scripts/views/data-table/menu-edit-cells.js", "diffHunk": "@@ -679,6 +679,16 @@ DataTableColumnHeaderUI.extendMenu(function(column, columnHeaderUI, menu) {\n \n       $('<option>').attr(\"value\", column2.name).text(column2.name).appendTo(elmts.noteColumnSelect);\n     }\n+\n+    var currentHeight = dialog.outerHeight();\n+    var currentWidth = dialog.outerWidth();\n+    dialog.resizable({", "originalCommit": "8816cd511a55213e65aec21c3d5a2b407605fe63", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NjUyMzU1NA==", "url": "https://github.com/OpenRefine/OpenRefine/pull/2352#discussion_r386523554", "bodyText": "not really. To facts:\n\nresizing is only secondary feature requested in issue #898 to support long column names. Primary one is horizontal scrolling which doesn't work in FireFox at all. Only resizing works in FF, but I wasn't able to see such 'righ-side-only' stretching as your screenshot demoes. In my FF versiion (70+) resizing works properly, proportionally resizing all 3 lists and making them wider / thinner. What FF version this screenshot has been taken in ?\nExistent html markup doesn't support vertical resizing. But in fact, vertical stretching is not required because it's about too long column names, not about column numbers.\nAgain. primary change was to add horizontal list scrolling, which was added by introducing style.overflow=auto. In reality, the only way to show full column name to user is having horizontal scrolling withing every list (not dialog window). That was added and it works fine in Chromium-based browsers as mentioned in PR description. You can test it by renaming column names into somethin long, as original issue's description says.\n\nIn fact, this PR is an attempt to provide quick remedy to the issue upon existent dialog codebase. I've tested various approaches and this is best balance between efforts and results.\nIn Chromium, it solves the issue completely. In FireFox - only partially. Firefox is only roughly 5% share of total browsers used.\nAny ideas  what platforms most of OpenRefine users are upon ? The point is, Safari @ MacOs doesn't support that horizontal scrolling for  tag.\nIt's about browser quircks as it's always been. Chrome is recommended.\nHopefully this helps ;)", "author": "obarabanov", "createdAt": "2020-03-02T17:02:36Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NjQ1NDUxNA=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NjUzMjQzOQ==", "url": "https://github.com/OpenRefine/OpenRefine/pull/2352#discussion_r386532439", "bodyText": "Yes, I have same result for FF (73.0.1) and it does needed make wider or thinner, so that's OK.\nThanks fine.\nYeap, understood.  This is definitely an improvement!  Thanks!", "author": "thadguidry", "createdAt": "2020-03-02T17:18:52Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM4NjQ1NDUxNA=="}], "type": "inlineReview"}, {"oid": "7a3b3a9a7a92411d5d6a7fe99854296b1d1c56a4", "url": "https://github.com/OpenRefine/OpenRefine/commit/7a3b3a9a7a92411d5d6a7fe99854296b1d1c56a4", "message": "Enforce uniform column widths in key-value columnize dialog", "committedDate": "2020-03-04T09:43:42Z", "type": "commit"}]}