{"pr_number": 6997, "pr_title": "[website] [release] add blog for 2.5.2 release", "pr_createdAt": "2020-05-20T03:24:13Z", "pr_url": "https://github.com/apache/pulsar/pull/6997", "timeline": [{"oid": "f923c012674cf1b8c6c6a9344111081100c6dac9", "url": "https://github.com/apache/pulsar/commit/f923c012674cf1b8c6c6a9344111081100c6dac9", "message": "add blog for 2.5.2 release", "committedDate": "2020-05-20T03:21:55Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyNzcyMzcyOA==", "url": "https://github.com/apache/pulsar/pull/6997#discussion_r427723728", "bodyText": "Suggested change\n        \n          \n    \n\n        \n      \n    \n    \n      \n          \n            \n            ## Support Async mode\n          \n          \n            \n            ## Support Async mode for Pulsar Functions", "author": "codelipenghui", "createdAt": "2020-05-20T03:40:31Z", "path": "site2/website/blog/2020-05-19-Apache-Pulsar-2-5-2.md", "diffHunk": "@@ -0,0 +1,132 @@\n+---\n+author: Jia Zhai\n+authorURL: https://twitter.com/Jia_Zhai\n+title: Apache Pulsar 2.5.2\n+---\n+\n+We are proud to publish Apache Pulsar 2.5.2. This is the result of a huge effort from the community, with over 56 commits, general improvements and bug fixes.\n+\n+For detailed changes related to 2.5.2 release, refer to the <b>[release notes](/release-notes/#2.5.2)</b> and the <b>[PR list for Pulsar 2.5.2](https://github.com/apache/pulsar/pulls?q=is:pr%20label:release/2.5.2%20is:closed)</b>.\n+\n+The following highlights some improved features and fixed bugs in this release.\n+\n+<!--truncate-->\n+\n+## Implement AutoTopicCreation by namespace level override\n+\n+Introduce a new namespace policy `autoTopicCreationOverride`, which enables an override of broker `autoTopicCreation` settings on the namespace level. You can disable `autoTopicCreation` for the broker while allowing it on a specific namespace.\n+\n+## Add customized deletionLag and threshold for offloading policies per namespace\n+\n+Support configuring `deletionLag` and threshold in the offloading policy on the namespace level to remove data from the offloaded tiered storage.\n+\n+## Invalidate managed ledgers ZooKeeper cache instead of reloading on watcher triggered\n+\n+The ZooKeeper children cache is reloaded for z-nodes when topics are frequently created or deleted. This creates additional load on the ZooKeeper and the broker, slows down brokers and makes them less stable. In this release, `ZooKeeperManagedLedgerCache` is introduced to invalidate instead of reloading the ZooKeeper cache, when topics are created or deleted. This helps reduce pressures on the ZooKeeper.\n+\n+## Respect retention policy when there is no traffic\n+\n+In previous releases, retention is checked when the ledger rollover happens. So if the traffic is stopped, the ledgers are not cleaned up even if all the messages are already acknowledged. In Pulsar 2.5.2, `retentionCheckIntervalInSeconds` is introduced to check if consumed ledgers need to be trimmed between intervals. If the value is set to 0 or a negative number, the system does not check the consumed ledgers.\n+\n+## Bump Netty version to 4.1.48.Final\n+\n+The ZlibDecoders in Netty 4.1.x (before 4.1.46) allow for unbounded memory allocation while decoding a ZlibEncoded byte stream. An attacker could send a large ZlibEncoded byte stream to the Netty server, forcing the server to allocate all of its free memory to a single decoder. The bug is fixed in Netty `4.1.48.Final` .\n+\n+## Increase timeout for loading topics\n+\n+Loading replicated topics is quite an expensive operation and involves global ZooKeeper lookups and the start of many sub-processes. In Pulsar 2.5.2, we increase the timeout for loading topics which have many replicated clusters to 60 seconds.\n+\n+## Fix incorrect cursor state for cursor without consumers\n+\n+If consumers of a subscription are closed, the cursor is set to inactive. But the cursor is set to active during `PulsarStats.updateStats()` when the backlog size is less than `backloggedCursorThresholdEntries`. In Pulsar 2.5.2, we move the `checkBackloggedCursors()` from `ManagedLedger` to `Topic` and check the consumer list to fix this bug.\n+\n+## Change non-durable cursor to active to improve performance\n+\n+In non-durable subscription mode, the cursor is not active, which leads to the written entries not being put into cache. This would degrade the reading performance. In Pulsar 2.5.2, we set the `NonDurableCursorImpl` to active and remove three override methods `setActive()`, `isActive()`, `setInactive()` to improve the reading performance.\n+\n+## Add keystore configurations to TLS\n+\n+In Pulsar 2.5.2, we add keystore configurations to the TLS to allow users to define their own CA certificates while the internal communication uses an internal CA certificate. This change keeps the original TLS settings untouched, and adds new configurations in needed paths.\n+\n+## Close producer when the topic does not exists\n+\n+In previous releases, when we create a producer for a non-existent topic, the `ProducerImpl` object is hanging in the dump. This leads to OOM in micro-service which by mistake tries to produce consistently to a non-existent topic. In Pulsar 2.5.2, we fix the bug in the following two aspects:\n+\n+- Fix the exception handle for a non-existent topic.\n+- Change state to `Close` when the producer gets the `TopicDoesNotExists` exception.\n+\n+## Fix `topicPublishRateLimiter` not effective after restarting broker\n+\n+In previous releases, when a publishing rate is configured on the namespace, it can limit the publishing rate. But when the broker is restarted, the limit expires. In Pulsar 2.5.2, this bug is fixed.\n+\n+## Expose pulsar_out_bytes_total and pulsar_out_messages_total for namespace/subscription/consumer\n+\n+Add pulsar_out_bytes_total and pulsar_out_messages_total for the namespace, subscription, and consumer. This helps to avoid missing the rate to be computed in Prometheus or missing change of rates within the scraping interval.\n+\n+## Fix `ttlDurationDefaultInSeconds` policy\n+\n+The TTL for namespaces should be retrieved from the broker configuration if it is not configured at namespace policies. In previous releases, the code only returns the value stored in namespace policies directly without judging if the TTL is configured or not. In Pulsar 2.5.2, we add a condition to test if TTL is configured at namespace policies. If not, the broker retrieves value stored in broker configuration and returns it as the output.\n+\n+## Fix long field parse in GenricJsonRecord\n+\n+For messages sent in JSON schema, the long field is decoded as int if its value is smaller than `Integer.MAX_VALUE`. Otherwise, the long field is decoded as a string. Pulsar 2.5.2 introduces a field type check in GenericJsonRecord to fix this bug.\n+\n+## Fix the leak of cursor reset if message encode fails in Avro schema\n+\n+If the Avro encode for a message fails after a few bytes are written, the cursor in the stream is not reset. The following `flush()`, which normally resets the cursor, is skipped if there is an exception. In Pulsar 2.5.2, we introduced a `flush()` in the finally block to fix this bug.\n+\n+## Update topic partitions automatically\n+\n+In Pulsar 2.5.2, the C++ client supports previously-created producers and consumers to automatically update partitions when the partitions for a topic are updated.\n+\n+- Add a `boost::asio::deadline_timer` to `PartitionedConsumerImpl` and `PartitionedProducerImpl` to register a lookup task to detect partition changes periodically.\n+- Add an unsigned int configuration parameter to indicate the period of detecting partition changes.\n+- Unlock the `mutex_` in `PartitionedConsumerImpl::receive` after `state_` were checked.\n+\n+## Fix default message ID in sent callback\n+\n+In previous releases, the `MessageId` in the callback is always the default value (`-1, -1, -1, -1`). In Pulsar 2.5.2, we remove the useless field `messageId` of `BatchMessageContainer::MessageContainer` and add the `const MessageId&` argument to `batchMessageCallBack`. Therefore, we can get the correct message ID in the callback if the message is sent successfully.\n+\n+## Fix message ID error if messages are sent to partitioned topics\n+\n+If messages are sent to a partitioned topic, the `partition` field of the message ID is always set to -1 because the `SendReceipt` command only contains the ledger ID and the entry ID. In Pulsar 2.5.2, we fix this bug by adding a `partition` field to `ProducerImpl` and setting the `partition` field of the message ID with it in the `ackReceived` method.\n+\n+## Support Async mode", "originalCommit": "f923c012674cf1b8c6c6a9344111081100c6dac9", "replyToReviewId": null, "replies": null, "type": "inlineReview"}, {"oid": "238c8a310dbc1f502c2d9e03d6a9e96a5d2497d7", "url": "https://github.com/apache/pulsar/commit/238c8a310dbc1f502c2d9e03d6a9e96a5d2497d7", "message": "change following penghui's comments", "committedDate": "2020-05-20T03:44:56Z", "type": "commit"}]}