{"pr_number": 6286, "pr_title": "Clarify documentation on Subscriptions, especially pub-sub vs queuing", "pr_createdAt": "2020-02-10T19:45:23Z", "pr_url": "https://github.com/apache/pulsar/pull/6286", "timeline": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM3NzQ5MTA0Nw==", "url": "https://github.com/apache/pulsar/pull/6286#discussion_r377491047", "bodyText": "I am not sure this clarification here is clear enough. topic-subscription already indicates that messages are fan-out to different subscriptions. The clarification seems to be indicating it is one way or another. I would suggest just adding a tip at the end of this section.\n> If you want to achieve traditional \"fanout pubsub messaging\" among consumers, you can make each consumer ...\n> If you want to achieve \"message queuing\" among cnosumer, you can ...", "author": "sijie", "createdAt": "2020-02-11T08:21:53Z", "path": "site2/docs/concepts-messaging.md", "diffHunk": "@@ -176,9 +176,11 @@ Topic name component | Description\n \n A namespace is a logical nomenclature within a tenant. A tenant can create multiple namespaces via the [admin API](admin-api-namespaces.md#create). For instance, a tenant with different applications can create a separate namespace for each application. A namespace allows the application to create and manage a hierarchy of topics. The topic `my-tenant/app1` is a namespace for the application `app1` for `my-tenant`. You can create any number of [topics](#topics) under the namespace.\n \n-## Subscription modes\n+## Subscriptions\n \n-A subscription is a named configuration rule that determines how messages are delivered to consumers. There are four available subscription modes in Pulsar: [exclusive](#exclusive), [shared](#shared), [failover](#failover), and [key_shared](#key_shared). These modes are illustrated in the figure below.\n+A subscription is a named configuration rule that determines how messages are delivered to consumers.  Each consumer may use a unique subscription name exclusive only to it, and then each consumer on the topic would receive all messages independent of other consumers (fan-out pub-sub messaging).  Alternatively multiple consumers may use the same subscription name in either a shared or failover mode (message queuing). ", "originalCommit": "74852e9788b44d91a1904874f1254487c7cc893e", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM3Nzc0MTYyMg==", "url": "https://github.com/apache/pulsar/pull/6286#discussion_r377741622", "bodyText": "Updated with your suggestion of making it a separate note and added a bullet point that it isn't just an either-or proposition as you can do both simultaneously.", "author": "slominskir", "createdAt": "2020-02-11T16:18:30Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM3NzQ5MTA0Nw=="}], "type": "inlineReview"}, {"oid": "cd2b25bef48e19440239112e5606de33e1eba6b5", "url": "https://github.com/apache/pulsar/commit/cd2b25bef48e19440239112e5606de33e1eba6b5", "message": "Emphasis that a subscription is an important concept from which subscription modes are built and add a note about combination flexibility", "committedDate": "2020-02-11T16:42:45Z", "type": "commit"}]}