{"pr_number": 6545, "pr_title": "[blog] The Apache Pulsar 2020 User Survey Report", "pr_createdAt": "2020-03-17T04:41:10Z", "pr_url": "https://github.com/apache/pulsar/pull/6545", "timeline": [{"oid": "f4783bf4728fb25521e7768c465c50945c4af3ab", "url": "https://github.com/apache/pulsar/commit/f4783bf4728fb25521e7768c465c50945c4af3ab", "message": "[blog] the apache pulsar 2020 user survey report", "committedDate": "2020-03-16T08:31:54Z", "type": "commit"}, {"oid": "477c492ec0be1ca5fd212d67838c98b159c9e8f5", "url": "https://github.com/apache/pulsar/commit/477c492ec0be1ca5fd212d67838c98b159c9e8f5", "message": "Fix markdown error", "committedDate": "2020-03-16T08:44:45Z", "type": "commit"}, {"oid": "fee0ca49ff09f5d9f062931c3f9205ee9e253344", "url": "https://github.com/apache/pulsar/commit/fee0ca49ff09f5d9f062931c3f9205ee9e253344", "message": "Add pulsar-adoption photo", "committedDate": "2020-03-16T08:46:20Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDM5MzQ0MzYwNA==", "url": "https://github.com/apache/pulsar/pull/6545#discussion_r393443604", "bodyText": "Suggested change\n        \n          \n    \n\n        \n      \n    \n    \n      \n          \n            \n            to scale, to its multi-datacenter replication, which allows Pulsar to handle datacenter failures,\n          \n          \n            \n            to scale, to its multi-datacenter replication, which allows Pulsar to handle data center failures,", "author": "Anonymitaet", "createdAt": "2020-03-17T04:50:30Z", "path": "site2/website/blog/2020-03-17-announcing-the-apache-pulsar-2020-user-survey-report.md", "diffHunk": "@@ -0,0 +1,55 @@\n+---\n+author: Sijie Guo\n+authorURL: https://twitter.com/sijieg\n+title: \"Announcing: The Apache Pulsar 2020 User Survey Report\"\n+---\n+\n+For the first time ever, the Apache Pulsar PMC team is publishing a user survey report.\n+**The 2020 Apache Pulsar User Survey Report** reveals Pulsar’s accelerating rate of global\n+adoption, details how organizations are leveraging Pulsar to build real-time streaming\n+applications, and highlights key features on Pulsar’s product roadmap.\n+\n+Pulsar adoption has largely been driven by the market’s increased demand for real-time,\n+data-enabled technologies. While companies have tried to leverage monolithic messaging\n+systems to build-out real-time offerings, they’ve hit major roadblocks. Ultimately, these\n+technologies are not equipped to provide the scale or reliability that mission-critical\n+applications require.\n+\n+As a result, companies have sought-out Apache Pulsar for its cloud-native, distributed\n+messaging and streaming platform capabilities. From asynchronous applications to core\n+business applications to ETL, companies are increasingly leveraging Pulsar to develop\n+real-time applications.\n+\n+Pulsar has received global adoption from major technology companies such as Verizon Media,\n+Narvar, Overstock, Nutanix, Yahoo! JAPAN, Tencent, OVHCloud, and Clever Cloud, who rely on\n+its ability to deliver on performance, scalability, and resiliency. As the Pulsar project\n+and community garner increasing attention, we’re excited to share the **2020 Apache Pulsar User Survey Report**.\n+\n+![](../img/pulsar-adoption.png)\n+\n+In the 2020 Apache Pulsar User Survey Report, we hear from 165 users and learn how their\n+companies are leveraging Pulsar’s cloud-native, multi-layer design architecture, built-in\n+multi-tenancy, and multi-cluster replication, to build scalable real-time offerings. This\n+report details insights and use cases on how organizations are deploying Pulsar today.\n+\n+The report also reveals Pulsar’s top-used features, its most popular applications, and how\n+it is delivering scalable, reliable, real-time streaming solutions for organizations. In\n+this quotation from Qiang Fei, Tech Lead for Tencent, we see how\n+[one organization is leveraging Pulsar to improve their offering](https://streamnative.io/whitepaper/case-studay-apache-pulsar-tencent-billing/):\n+\n+> Pulsar provides us with a highly consistent and highly reliable distributed message queue that\n+> fits well in our financial use cases. Multi-tenant and storage separation architecture design\n+> greatly reduces our operational and maintenance overhead. We have used Pulsar on a very large\n+> scale in our organization and we are impressed that Pulsar is able to provide high consistency\n+> while supporting high concurrent client connections.\n+> \n+> - Qiang Fei, Tech Lead at Tencent\n+\n+From its built-in multi-tenancy, which reduces architectural complexity and enables organizations\n+to scale, to its multi-datacenter replication, which allows Pulsar to handle datacenter failures,", "originalCommit": "fee0ca49ff09f5d9f062931c3f9205ee9e253344", "replyToReviewId": null, "replies": null, "type": "inlineReview"}, {"oid": "4b504863d6c895f9290c3c262cfbdd0347646591", "url": "https://github.com/apache/pulsar/commit/4b504863d6c895f9290c3c262cfbdd0347646591", "message": "Fix yu's comments", "committedDate": "2020-03-17T07:54:11Z", "type": "commit"}]}