{"pr_number": 7917, "pr_title": "[Issue 7864][docs]Update document for how to pick active consumer for failover subscription.", "pr_createdAt": "2020-08-28T03:04:44Z", "pr_url": "https://github.com/apache/pulsar/pull/7917", "timeline": [{"oid": "b85c8b9a2e2911df1e9934dc145ebaf187c2855b", "url": "https://github.com/apache/pulsar/commit/b85c8b9a2e2911df1e9934dc145ebaf187c2855b", "message": "Update document for how to pick active consumer for failover subscription.\n\nUpdate document to specify how active consumer is picked for partitioned and non-partitoned topic for failover subscription mode. The change was push in 2.4.2 but document has not been updated.", "committedDate": "2020-08-28T03:01:42Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3OTE1OTIzNw==", "url": "https://github.com/apache/pulsar/pull/7917#discussion_r479159237", "bodyText": "Suggestions from language perspectives:\nIn failover mode, multiple consumers can attach to the same subscription. In failover mode, the broker selects the master consumer for the partitioned topic based on the priority level and the lexicographical sorting of a consumer name. If two consumers have an identical priority level, the broker selects the master consumer based on the lexicographical sorting. If these two consumers have different priority levels, the broker selects the consumer with a higher priority level as the master consumer. Only the master consumer receives messages. When the master consumer is not connected, all (non-acknowledged and subsequent) messages are delivered to the next consumer in line.\nThe broker assigns partitioned topics to the consumer with the highest priority level. If multiple consumers have the same priority level, the broker assigns topics to consumers evenly.\nIn failover mode, the broker selects the master consumer for a non-partitioned topic based on the order that they subscribe to the non-partitioned topic.", "author": "Jennifer88huang", "createdAt": "2020-08-28T11:27:05Z", "path": "site2/docs/concepts-messaging.md", "diffHunk": "@@ -254,7 +254,7 @@ In the diagram below, only **Consumer A-0** is allowed to consume messages.\n \n ### Failover\n \n-In *failover* mode, multiple consumers can attach to the same subscription. In failover mode, the broker selects the master consumer based on the priority level and the lexicographical sorting of a consumer name. If two consumers have an identical priority level, the broker selects the master consumer based on the lexicographical sorting. If these two consumers have different priority levels, the broker selects the consumer with a higher priority level as the master consumer. The master consumer is initially the only one receiving messages. When the master consumer disconnects, all (non-acknowledged and subsequent) messages are delivered to the next consumer in line.\n+In *failover* mode, multiple consumers can attach to the same subscription. For partitioned topic, in failover mode the broker selects the master consumer based on the priority level and the lexicographical sorting of a consumer name. If two consumers have an identical priority level, the broker selects the master consumer based on the lexicographical sorting. If these two consumers have different priority levels, the broker selects the consumer with a higher priority level as the master consumer. The master consumer is initially the only one receiving messages. When the master consumer disconnects, all (non-acknowledged and subsequent) messages are delivered to the next consumer in line. For non-partitioned topic in failover mode the broker will pick consumer in the order they subscribe to the non partitioned topic.\n \n For partitioned topics, the broker assigns partitioned topics to the consumer with the highest priority level. If multiple consumers have the highest priority level, the broker evenly assigns topics to consumers with these consumers.\n ", "originalCommit": "b85c8b9a2e2911df1e9934dc145ebaf187c2855b", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3OTE2MzYxNQ==", "url": "https://github.com/apache/pulsar/pull/7917#discussion_r479163615", "bodyText": "Do the following two have some conflicts?\n\nIf multiple consumers have the same priority level, the broker assigns topics to consumers evenly.\"\nIf two consumers have an identical priority level, the broker selects the master consumer based on the lexicographical sorting.", "author": "Jennifer88huang", "createdAt": "2020-08-28T11:29:54Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3OTE1OTIzNw=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3OTcwNjg5MQ==", "url": "https://github.com/apache/pulsar/pull/7917#discussion_r479706891", "bodyText": "Thanks for the comment, yes it's conflicting description, I've updated the doc to reflect the latest way broker pick active consumer for topic in failover sub mode.", "author": "MarvinCai", "createdAt": "2020-08-30T01:10:24Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3OTE1OTIzNw=="}], "type": "inlineReview"}, {"oid": "29466e2b7a5e8b86e91e374c28b639db4b8523d6", "url": "https://github.com/apache/pulsar/commit/29466e2b7a5e8b86e91e374c28b639db4b8523d6", "message": "Update doc to address comments and reflect the latest implementation of active consumer selection for fail over sub mode.", "committedDate": "2020-08-30T01:07:49Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3OTg3NDAxNQ==", "url": "https://github.com/apache/pulsar/pull/7917#discussion_r479874015", "bodyText": "In failover mode, multiple consumers can attach to the same subscription. A master consumer is picked for topics and receives messages. When the master consumer disconnects, all (non-acknowledged and subsequent) messages are delivered to the next consumer in line.", "author": "Jennifer88huang", "createdAt": "2020-08-31T03:51:10Z", "path": "site2/docs/concepts-messaging.md", "diffHunk": "@@ -254,9 +254,11 @@ In the diagram below, only **Consumer A-0** is allowed to consume messages.\n \n ### Failover\n \n-In *failover* mode, multiple consumers can attach to the same subscription. In failover mode, the broker selects the master consumer based on the priority level and the lexicographical sorting of a consumer name. If two consumers have an identical priority level, the broker selects the master consumer based on the lexicographical sorting. If these two consumers have different priority levels, the broker selects the consumer with a higher priority level as the master consumer. The master consumer is initially the only one receiving messages. When the master consumer disconnects, all (non-acknowledged and subsequent) messages are delivered to the next consumer in line.\n+In *failover* mode, multiple consumers can attach to the same subscription. A master consumer will be picked for non-partitioned topic or each partition of partitioned topic. The master consumer is the only one receiving messages. When the master consumer disconnects, all (non-acknowledged and subsequent) messages are delivered to the next consumer in line. ", "originalCommit": "29466e2b7a5e8b86e91e374c28b639db4b8523d6", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3OTg4Njk1NA==", "url": "https://github.com/apache/pulsar/pull/7917#discussion_r479886954", "bodyText": "I'll keep the non-partitioned topic or each partition of partitioned topic part as I think this detail is useful to readers.", "author": "MarvinCai", "createdAt": "2020-08-31T04:53:22Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3OTg3NDAxNQ=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3OTkxNTU4Mg==", "url": "https://github.com/apache/pulsar/pull/7917#discussion_r479915582", "bodyText": "that's ok", "author": "Jennifer88huang", "createdAt": "2020-08-31T06:16:01Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3OTg3NDAxNQ=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ4MDI1MTU0MA==", "url": "https://github.com/apache/pulsar/pull/7917#discussion_r480251540", "bodyText": "cool, updated", "author": "MarvinCai", "createdAt": "2020-08-31T16:40:15Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQ3OTg3NDAxNQ=="}], "type": "inlineReview"}, {"oid": "3d23b1832e654344dca65c11f3d966185a819501", "url": "https://github.com/apache/pulsar/commit/3d23b1832e654344dca65c11f3d966185a819501", "message": "Address pr comment to make description more concise.", "committedDate": "2020-08-31T04:55:35Z", "type": "commit"}]}