{"pr_number": 2288, "pr_title": "Maintain Feature Overview Text", "pr_createdAt": "2020-10-28T10:27:11Z", "pr_url": "https://github.com/ls1intum/Artemis/pull/2288", "timeline": [{"oid": "d7af7893dc7239965a0b0a8af4bc93b9e5d00b36", "url": "https://github.com/ls1intum/Artemis/commit/d7af7893dc7239965a0b0a8af4bc93b9e5d00b36", "message": "incoorperate Nadines feedback", "committedDate": "2020-10-28T10:22:57Z", "type": "commit"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMzYwNjU2MA==", "url": "https://github.com/ls1intum/Artemis/pull/2288#discussion_r513606560", "bodyText": "Mit Artemis kannst du auf deine persönliche Klausur zugreifen und deine Einsendung überprüfen über die Zusammenfassungsseite der Klausur, die nach der Abgabe verfügbar wird. => Mit Artemis kannst du auf deine persönliche Klausur zugreifen und deine Einsendung über die Zusammenfassungsseite der Klausur, die nach der Abgabe verfügbar wird, überprüfen.", "author": "FrankeLukas", "createdAt": "2020-10-28T16:54:08Z", "path": "src/main/webapp/i18n/de/featureOverview.json", "diffHunk": "@@ -126,20 +126,20 @@\n                 \"summary\": {\n                     \"title\": \"Überblick auf deiner Abgabe\",\n                     \"shortDescription\": \"Greife immer auf deine Zusammenfassung zu.\",\n-                    \"descriptionTextOne\": \"\\\"Was war deine Antwort auf Frage 2?\\\"\\n\\n- \\\"Ich kann mich nicht mehr erinnern, ich denke Option B\\\".\\n\\n\\n\\nMit Artemis kannst du jederzeit auf deine persönliche Prüfung zugreifen und deine Einsendung überprüfen. Dies geschieht über die Zusammenfassungsseite der Prüfung, die nach dem Einreichen verfügbar wird. Die Zusammenfassung enthält eine Übersicht über alle deine Abgaben und zeigt sie in einer aggregierten Ansicht an. Zusätzlich enthält sie den letzten Commit-Hash sowie den Link zu deinem Repository, wo du den Code für Programmieraufgaben einsehen und analysieren kannst. Für den Fall, dass du die es lokal auf dem Gerät deiner Wahl speichern möchtest, bietet Artemis die Möglichkeit, die komplette Zusammenfassung als .pdf herunterzuladen.\"\n+                    \"descriptionTextOne\": \"\\\"Was war deine Antwort auf Frage 2?\\\"\\n\\n- \\\"Ich kann mich nicht mehr erinnern, ich denke Option B\\\".\\n\\nMit Artemis kannst du auf deine persönliche Klausur zugreifen und deine Einsendung überprüfen über die Zusammenfassungsseite der Klausur, die nach der Abgabe verfügbar wird. Die Zusammenfassung enthält eine Übersicht über alle deine Abgaben und zeigt sie in einer aggregierten Ansicht an. Zusätzlich enthält sie den letzten Commit-Hash sowie den Link zu deinem Repository, wo du den Code für Programmieraufgaben einsehen und analysieren kannst. Für den Fall, dass du die es lokal auf dem Gerät deiner Wahl speichern möchtest, bietet Artemis die Möglichkeit, die komplette Zusammenfassung als PDF Datei herunterzuladen.\"", "originalCommit": "d7af7893dc7239965a0b0a8af4bc93b9e5d00b36", "replyToReviewId": null, "replies": null, "type": "inlineReview"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMzYwODc4NQ==", "url": "https://github.com/ls1intum/Artemis/pull/2288#discussion_r513608785", "bodyText": "you can set up programming-, modeling, text- and quiz exercises -> should use modelling-", "author": "FrankeLukas", "createdAt": "2020-10-28T16:56:55Z", "path": "src/main/webapp/i18n/en/featureOverview.json", "diffHunk": "@@ -9,67 +9,67 @@\n                 \"createConductAssess\": {\n                     \"title\": \"Create, Conduct and Assess Exams\",\n                     \"shortDescription\": \"Create, conduct and assess, all within the Artemis platform.\",\n-                    \"descriptionTextOne\": \"Artemis supports an exam mode, which offers a unique way of assessing the performance of your students. You can create exams for each course and register all or some of your students. Within the exam, you can set up programming-, modeling, text- and quiz exercises or import existing ones. Before releasing the exam to your students, you can conduct tests runs to make sure everything runs smoothly. Define a working time for the exam and make adjustments individual students as needed. Students may submit early.\\n\\nNo stable internet connection? Artemis saves all changes locally and automatically synchronizes every 30 seconds to avoid issues caused by unstable internet connections.\\n\\nOnce the exam conduction is over, it is time to assess the submissions. Your assessment team starts the assessment from the Assessment Dashboard, which also visualizes the assessment progress.\\n\\nWith all exams assessed you can release the results and allow all students to review their result. If they believe they found a mistake in their assessment they can use the complaint feature to request a re-review. A second assessor, will then be able to re-assess the specific submission and decide whether to accept or reject the complaint.\\n\\nFinally, Artemis also creates a statistical report of the exam to evaluate and examine the performance of your students.\\n\\nCreate, conduct & assess, all within Artemis!\"\n+                    \"descriptionTextOne\": \"Artemis supports an exam mode, which offers a unique way of assessing the performance of your students. You can create exams for each course and register all or a selection of your students. Within the exam, you can set up programming-, modeling, text- and quiz exercises or import existing ones. Before releasing the exam to your students, you can conduct test runs to make sure everything runs smoothly. Define a working time for the exam and make adjustments individual students as needed, students may submit early.\\n\\nNo stable internet connection? Artemis saves all changes locally and automatically synchronizes every 30 seconds to avoid issues caused by unstable internet connections during the conduction.\\n\\nOnce the exam conduction is over, it is time to assess the submissions. Your assessment team starts the assessment from the Assessment Dashboard, which also visualizes the assessment progress.\\n\\nOnce all exams have been assessed you can release the results and give all students the opportunity to review their result. If they believe they found a mistake in their assessment, they can use the complaint feature to request a reassessment. A second assessor will then be able to re-assess the specific submission and decide whether to accept or reject the complaint.\\n\\nFinally, Artemis also creates a statistical report of the exam to evaluate and examine your students' performance.\\n\\nCreate, conduct & assess, all within Artemis!\"", "originalCommit": "d7af7893dc7239965a0b0a8af4bc93b9e5d00b36", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMzYwOTc3OQ==", "url": "https://github.com/ls1intum/Artemis/pull/2288#discussion_r513609779", "bodyText": "and make adjustments individual students as needed => and make adjustments for individual students as needed\nappending students may submit early. to that sentence also feels a bit odd. (Should be left as individual sentence?)", "author": "FrankeLukas", "createdAt": "2020-10-28T16:58:15Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMzYwODc4NQ=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxNDM4MjczNQ==", "url": "https://github.com/ls1intum/Artemis/pull/2288#discussion_r514382735", "bodyText": "The second change was proposed by one of the instructors, I think it's ok if we leave it this way. I implemented the rest of your feedback, thanks. :)", "author": "anditurdiu", "createdAt": "2020-10-29T16:09:47Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDUxMzYwODc4NQ=="}], "type": "inlineReview"}, {"oid": "4f4ba53461dff531b4c790d010d6ca02209e8d7c", "url": "https://github.com/ls1intum/Artemis/commit/4f4ba53461dff531b4c790d010d6ca02209e8d7c", "message": "Update featureOverview.json\n\nAdd feedback", "committedDate": "2020-10-29T16:05:31Z", "type": "commit"}, {"oid": "7f170b7cc8b116b98cad07ec66d7b69dfcdf5b31", "url": "https://github.com/ls1intum/Artemis/commit/7f170b7cc8b116b98cad07ec66d7b69dfcdf5b31", "message": "Update featureOverview.json\n\nAdd feedback", "committedDate": "2020-10-29T16:06:31Z", "type": "commit"}, {"oid": "bbf7ea96aeb1a6623338a7045d48caedd254d3f9", "url": "https://github.com/ls1intum/Artemis/commit/bbf7ea96aeb1a6623338a7045d48caedd254d3f9", "message": "Merge branch 'develop' into chore/improve-feature-overview-text", "committedDate": "2020-10-29T16:06:48Z", "type": "commit"}, {"oid": "f4fcab28d700e01aba102ed7cf2bec8d418d95f4", "url": "https://github.com/ls1intum/Artemis/commit/f4fcab28d700e01aba102ed7cf2bec8d418d95f4", "message": "Merge branch 'develop' into chore/improve-feature-overview-text", "committedDate": "2020-10-29T17:24:46Z", "type": "commit"}]}