{"pr_number": 1578, "pr_title": "Add cutting to the default Studio workflow", "pr_createdAt": "2020-05-12T09:01:14Z", "pr_url": "https://github.com/opencast/opencast/pull/1578", "timeline": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzY0MDUwOA==", "url": "https://github.com/opencast/opencast/pull/1578#discussion_r423640508", "bodyText": "In case the smil file contains only one segment over the whole video length, the operation will be \"skipped\" but it does not copy the source track and set the target flavor/tags on it. The next operation will fail (or be skipped), because there are no tracks with */trimmed flavor. Be carefully with this option.", "author": "wsmirnow", "createdAt": "2020-05-12T10:49:55Z", "path": "etc/workflows/studio-upload.xml", "diffHunk": "@@ -202,14 +202,37 @@\n       </configurations>\n     </operation>\n \n+    <!-- Cut the videos -->\n+\n+    <operation\n+        id=\"clone\"\n+        exception-handler-workflow=\"partial-error\">\n+      <configurations>\n+        <configuration key=\"source-flavor\">smil/cutting</configuration>\n+        <configuration key=\"target-flavor\">smil/tmp</configuration>\n+      </configurations>\n+    </operation>\n+\n+    <operation id=\"editor\"\n+      exception-handler-workflow=\"partial-error\"\n+      description=\"Cut the recording according to the edit decision list\">\n+      <configurations>\n+        <configuration key=\"source-flavors\">*/prepared</configuration>\n+        <configuration key=\"smil-flavors\">smil/tmp</configuration>\n+        <configuration key=\"target-smil-flavor\">smil/tmp</configuration>\n+        <configuration key=\"target-flavor-subtype\">trimmed</configuration>\n+        <configuration key=\"skip-if-not-trimmed\">true</configuration>", "originalCommit": "860fc5fda0e97e22169a17dd35c69fff496da61c", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzcxNTQ2OQ==", "url": "https://github.com/opencast/opencast/pull/1578#discussion_r423715469", "bodyText": "I tested it and it worked. And from my understanding of the code of the editor-WOH, that is expected: Before the operation is actually skipped, the media package elements should be cloned, and the clones be given the correct flavors.\nHowever, I admit that I was unsure about this option, so if anyone has evidence for it not working or for my understanding to be wrong, it would be greatly appreciated. 😄", "author": "JulianKniephoff", "createdAt": "2020-05-12T13:04:23Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzY0MDUwOA=="}], "type": "inlineReview"}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzY0NTMzMg==", "url": "https://github.com/opencast/opencast/pull/1578#discussion_r423645332", "bodyText": "In case of Studio video upload, you want to trimm the video and archive the trimmed result, without the uploaded smil file. Also the editor-trimm operation should be moved to the partial-transcode-studio-tracks workflow, where it can do the magic stuff before the first snapshot operation.", "author": "wsmirnow", "createdAt": "2020-05-12T10:59:06Z", "path": "etc/workflows/studio-upload.xml", "diffHunk": "@@ -142,7 +142,7 @@\n         exception-handler-workflow=\"partial-error\"\n         description=\"Tagging source material for archival\">\n       <configurations>\n-        <configuration key=\"source-flavors\">dublincore/*,security/*,*/source</configuration>\n+        <configuration key=\"source-flavors\">dublincore/*,security/*,smil/*,*/source</configuration>", "originalCommit": "860fc5fda0e97e22169a17dd35c69fff496da61c", "replyToReviewId": null, "replies": [{"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzczODkzNA==", "url": "https://github.com/opencast/opencast/pull/1578#discussion_r423738934", "bodyText": "I'm not sure I follow. If I put the editor operation in partial-transcode-studio-tracks, that happens before prepare-av, but it operates on the media generated by prepare-av. I mean, maybe it doesn't have to, I'm not sure, but that's the way it is in the standard workflow, where I stole this from. 😅\nAnd what's the reasoning behind archiving the trimmed version without the cutting information as opposed to all of the source material, like the standard workflow does? 🤔", "author": "JulianKniephoff", "createdAt": "2020-05-12T13:37:24Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzY0NTMzMg=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzc2OTY4Mg==", "url": "https://github.com/opencast/opencast/pull/1578#discussion_r423769682", "bodyText": "The idea behind the partial-transcode-studio-tracks is not to loose the source material at any state of the workflow but archive the transcoded version of the tracks without waste space with original video files.\n\nmark source material for archive (but do not take a snapshot)\ntranscode all tracks\nswitch the flavors and archive tags\ntake snapshot and go on with regular processing\n\nIf any operation from 1. or 2. fail, the error handler workflow will archive the original source files and you will be save.\nIdeally you want to replace the transcode operation (2.) with the editor. If it does not work (for reasons), put the editor operation in between 2. and 3. Do not forget to remove the archive tag from smil file before taking snapshot (4.)\nAs other workflows expects the */prepared version, this must be generated and archived. Otherwise the following workflows will fail. In most cases all tracks does have an audio stream and the prepared version is same as source. AssetManager keep track of it and make a hardlink on filesystem.", "author": "wsmirnow", "createdAt": "2020-05-12T14:16:31Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzY0NTMzMg=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzg4Nzg1Mw==", "url": "https://github.com/opencast/opencast/pull/1578#discussion_r423887853", "bodyText": "Okay, I think I understand now. However, I'm not sure I agree with your premise, that we actually want to archive the trimmed version, and just discard the original videos.\nThat's not what we do for other ways of getting data into Opencast, either. When a CA uploads a video and someone cuts it, we then also don't just throw away the uncut version.\nOn the other hand when Studio finally learns to cut the video itself client side, we would also not have the uncut version in Opencast, right? Or would we still upload the uncut version plus a SMIL file and only use the client side trimming for the download version? 🤔\nCan we get a third (or even more for all I care 😉) opinion on this?", "author": "JulianKniephoff", "createdAt": "2020-05-12T16:54:57Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzY0NTMzMg=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyNDAzODc3Ng==", "url": "https://github.com/opencast/opencast/pull/1578#discussion_r424038776", "bodyText": "The initial trimming is initiated by the user, that creates the video file with studio and decide to trim it. It has nothing to do with the editor in the admin UI. We should respect it.", "author": "wsmirnow", "createdAt": "2020-05-12T21:16:39Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzY0NTMzMg=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyNDIwODY2MQ==", "url": "https://github.com/opencast/opencast/pull/1578#discussion_r424208661", "bodyText": "Right now, I would slightly tend to keep the original file as well (i.e. uncut), as this is unlikely to be significantly larger than the cut one (Studio users will very likely only remove tens of seconds at most). However, as mentioned, as soon as Studio actually does the cutting itself, Opencast does not have the uncut version anyway. And I would certainly oppose deliberately uploading the uncut version from Studio.\nSoooooo... \"I don't care\" is what I want to say :D I think it doesn't make a large difference and the situation will change in some time anyway.", "author": "LukasKalbertodt", "createdAt": "2020-05-13T06:49:57Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzY0NTMzMg=="}, {"id": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyNTIyMTczNw==", "url": "https://github.com/opencast/opencast/pull/1578#discussion_r425221737", "bodyText": "Personally I'm very much in the camp where the complete set of original files is kept, and trimmed copies are treated as any other intermediate file.  We want a single source of truth, and discarding the original after trimming it seems wrong to me.\nThat being said, those saying that the user trimmed the video prior to ingesting it, and that we should respect that do have a point.  What if the user is trimming off something that's not allowed to be kept (say, privacy reasons, or licensing).  Do our adopters run a risk by potentially having that footage in their archive, whether they know they have it or not?  If the trim in Studio was truly done client side (this would be a nice feature), then we wouldn't get the data at all - and we would be ok with that.  So why do we feel like we get to keep it when the presentr thinks that we're not even getting it in the first place.  Normally I would say that the presenter is out of luck, but especially in light of the current COVID-19 situation we have to assume that these recordings may be being done in suboptimal places.  Kids could be run through the frame, someone could spill their coffee, all kinds of things which would not otherwise occur in a classroom or office setting.\nAs much as I prefer in all other cases to keep the original source media and create an intermediate trimmed copy, I think in this case we need to respect user choice.  Perhaps we should document that this is not what is done in other cases in the studio docs, so that institutions can make the choice to keep everything if they really feel a need for it.  It will also (hopefully) help us in the future when someone eventually digs this up and asks why we did it differently :D", "author": "gregorydlogan", "createdAt": "2020-05-14T15:22:10Z", "replyToReviewId": "MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyMzY0NTMzMg=="}], "type": "inlineReview"}, {"oid": "120ed7045105a2eda0ff080362e546942fda5115", "url": "https://github.com/opencast/opencast/commit/120ed7045105a2eda0ff080362e546942fda5115", "message": "Add cutting to the default Studio workflow", "committedDate": "2020-05-14T08:23:37Z", "type": "commit"}, {"oid": "120ed7045105a2eda0ff080362e546942fda5115", "url": "https://github.com/opencast/opencast/commit/120ed7045105a2eda0ff080362e546942fda5115", "message": "Add cutting to the default Studio workflow", "committedDate": "2020-05-14T08:23:37Z", "type": "forcePushed"}]}